{
  "updated_at": "2025-04-02T00:12:42.810755+00:00",
  "player_news": [
    {
      "player_id": 377122,
      "player_name": "Endrick Felipe Moreira de Sousa",
      "trending_score": 100.0,
      "trend_summary": "Endrick scored against Real Sociedad in the Copa del Rey semifinal, joining Cristiano Ronaldo in Real Madrid history, but Real Madrid manager Carlo Ancelotti has urged the young player to be patient and accept his bench time as he develops. The eight-goal thriller ended 4-4 (5-4 on aggregate), sending Real Madrid to the Copa del Rey final.\n",
      "news": [
        {
          "title": "Endrick joins Cristiano Ronaldo in Real Madrid history books during Real Sociedad clash",
          "description": "Endrick joins Cristiano Ronaldo in Real Madrid history books during Real Sociedad clash  Yahoo",
          "date": "Tue, 01 Apr 2025 21:15:00 GMT"
        },
        {
          "title": "Real Madrid vs Sociedad 4-4 Copa del Rey semifinal – as it happened",
          "description": "Real Madrid vs Sociedad 4-4 Copa del Rey semifinal – as it happened  Al Jazeera",
          "date": "Tue, 01 Apr 2025 19:35:32 GMT"
        },
        {
          "title": "WATCH: Real Madrid back ahead on aggregate as Endrick Felipe scores against Real Sociedad",
          "description": "WATCH: Real Madrid back ahead on aggregate as Endrick Felipe scores against Real Sociedad  Football España",
          "date": "Tue, 01 Apr 2025 20:06:16 GMT"
        },
        {
          "title": "Watch: Endrick bags brilliant Real Madrid goal vs Real Sociedad",
          "description": "Watch: Endrick bags brilliant Real Madrid goal vs Real Sociedad  Yahoo",
          "date": "Tue, 01 Apr 2025 20:58:00 GMT"
        },
        {
          "title": "One in, one out? Endrick and Arda Guler decide Real Madrid futures amid lack of minutes under Carlo Ancelotti",
          "description": "One in, one out? Endrick and Arda Guler decide Real Madrid futures amid lack of minutes under Carlo Ancelotti  MSN",
          "date": "Tue, 01 Apr 2025 14:24:47 GMT"
        },
        {
          "title": "Real Madrid vs Real Sociedad Highlights, Copa del Rey semifinal second-leg: RMA 4-4 RSO (5-4); Rudiger scores winner",
          "description": "Real Madrid vs Real Sociedad Highlights, Copa del Rey semifinal second-leg: RMA 4-4 RSO (5-4); Rudiger scores winner  Sportstar",
          "date": "Tue, 01 Apr 2025 20:56:40 GMT"
        },
        {
          "title": "Real Madrid hold Sociedad in eight-goal thriller to reach Copa final",
          "description": "Real Madrid hold Sociedad in eight-goal thriller to reach Copa final  Al Jazeera",
          "date": "Tue, 01 Apr 2025 22:52:30 GMT"
        },
        {
          "title": "Real Madrid finish off Real Sociedad in extra time to reach Spanish Cup final",
          "description": "Real Madrid finish off Real Sociedad in extra time to reach Spanish Cup final  The Straits Times",
          "date": "Tue, 01 Apr 2025 22:42:19 GMT"
        },
        {
          "title": "‘Suck it up on the bench’ – Carlo Ancelotti sends message to Real Madrid ace Endrick",
          "description": "‘Suck it up on the bench’ – Carlo Ancelotti sends message to Real Madrid ace Endrick  TribalFootball",
          "date": "Tue, 01 Apr 2025 13:18:06 GMT"
        },
        {
          "title": "Carlo Ancelotti urges Endrick to 'suck it on the bench' on journey to becoming regular Real Madrid starter",
          "description": "Carlo Ancelotti urges Endrick to 'suck it on the bench' on journey to becoming regular Real Madrid starter  tntsports.co.uk",
          "date": "Tue, 01 Apr 2025 13:35:00 GMT"
        }
      ]
    },
    {
      "player_id": 2285,
      "player_name": "Antonio Rüdiger",
      "trending_score": 74.0,
      "trend_summary": "Antonio Rüdiger propelled Real Madrid to the Copa del Rey final with a late winning goal against Real Sociedad in a thrilling 4-4 (5-4 aggregate) semi-final clash. However, an injury to Rüdiger has prompted Carlo Ancelotti to address Real Madrid's transfer stance.\n",
      "news": [
        {
          "title": "Real Madrid 4–4 Real Sociedad: Player Ratings As Los Blancos Rally to Advance to Copa del Rey Final",
          "description": "Real Madrid 4–4 Real Sociedad: Player Ratings As Los Blancos Rally to Advance to Copa del Rey Final  Sports Illustrated",
          "date": "Tue, 01 Apr 2025 22:23:07 GMT"
        },
        {
          "title": "Real Madrid player ratings vs Real Sociedad: Antonio Rudiger the hero again! Blancos into Copa del Rey final after Bernabeu epic as treble hopes stay alive",
          "description": "Real Madrid player ratings vs Real Sociedad: Antonio Rudiger the hero again! Blancos into Copa del Rey final after Bernabeu epic as treble hopes stay alive  Goal.com",
          "date": "Tue, 01 Apr 2025 22:28:29 GMT"
        },
        {
          "title": "WATCH: Real Madrid back in front with minutes to go as Antonio Rudiger scores",
          "description": "WATCH: Real Madrid back in front with minutes to go as Antonio Rudiger scores  Football España",
          "date": "Tue, 01 Apr 2025 22:05:35 GMT"
        },
        {
          "title": "Real Madrid 4-4 Real Sociedad (5-4 on aggregate): Antonio Rudiger scores winner in Copa del Rey semi-final",
          "description": "Real Madrid 4-4 Real Sociedad (5-4 on aggregate): Antonio Rudiger scores winner in Copa del Rey semi-final  BBC",
          "date": "Tue, 01 Apr 2025 22:52:30 GMT"
        },
        {
          "title": "Carlo Ancelotti sets out Real Madrid transfer stance after Antonio Rudiger injury",
          "description": "Carlo Ancelotti sets out Real Madrid transfer stance after Antonio Rudiger injury  MSN",
          "date": "Tue, 01 Apr 2025 13:22:53 GMT"
        },
        {
          "title": "Real Madrid hold Real Sociedad in eight-goal thriller to reach Copa del Rey final",
          "description": "Real Madrid hold Real Sociedad in eight-goal thriller to reach Copa del Rey final  Yahoo Sports",
          "date": "Tue, 01 Apr 2025 22:27:14 GMT"
        },
        {
          "title": "Bernabéu erupts as Rüdiger’s late show seals Copa del Rey final spot for Real",
          "description": "Bernabéu erupts as Rüdiger’s late show seals Copa del Rey final spot for Real  The Guardian",
          "date": "Tue, 01 Apr 2025 23:42:00 GMT"
        },
        {
          "title": "Real Madrid vs Sociedad 4-4 Copa del Rey semifinal – as it happened",
          "description": "Real Madrid vs Sociedad 4-4 Copa del Rey semifinal – as it happened  Al Jazeera",
          "date": "Tue, 01 Apr 2025 19:35:32 GMT"
        },
        {
          "title": "Real Madrid 4-4 Real Sociedad (aet, 5-4 agg): Rudiger sends Ancelotti's side to Copa del Rey final",
          "description": "Real Madrid 4-4 Real Sociedad (aet, 5-4 agg): Rudiger sends Ancelotti's side to Copa del Rey final  FotMob",
          "date": "Tue, 01 Apr 2025 22:50:35 GMT"
        },
        {
          "title": "Real Madrid vs. Real Sociedad score: Copa del Rey result, stats as Rudiger goal caps off wacky extra-time thriller",
          "description": "Real Madrid vs. Real Sociedad score: Copa del Rey result, stats as Rudiger goal caps off wacky extra-time thriller  sportingnews.com",
          "date": "Tue, 01 Apr 2025 22:30:00 GMT"
        }
      ]
    },
    {
      "player_id": 153430,
      "player_name": "Anthony David Junior Elanga",
      "trending_score": 45.0,
      "trend_summary": "Anthony Elanga scored a brilliant solo goal for Nottingham Forest against his former club, Manchester United, securing a 1-0 victory. The performance, lauded by his coach and described as the \"goal of his life,\" has ignited dreams of a Champions League berth for Forest while simultaneously drawing criticism of Manchester United's defense.\n",
      "news": [
        {
          "title": "How Nottingham Forest beat Manchester United thanks to Anthony Elanga's brilliant early solo goal",
          "description": "How Nottingham Forest beat Manchester United thanks to Anthony Elanga's brilliant early solo goal  The New York Times",
          "date": "Tue, 01 Apr 2025 22:05:23 GMT"
        },
        {
          "title": "Nottingham Forest 1-0 Manchester United: Anthony Elanga on target against former employers as Forest edge closer to Champions League berth",
          "description": "Nottingham Forest 1-0 Manchester United: Anthony Elanga on target against former employers as Forest edge closer to Champions League berth  Yahoo Sports",
          "date": "Tue, 01 Apr 2025 22:00:11 GMT"
        },
        {
          "title": "'A special player'",
          "description": "'A special player'",
          "date": "Tue, 01 Apr 2025 22:49:44 GMT"
        },
        {
          "title": "Rio Ferdinand blames THREE Man United players for Elanga's solo winner",
          "description": "Rio Ferdinand blames THREE Man United players for Elanga's solo winner  Daily Mail",
          "date": "Tue, 01 Apr 2025 22:59:04 GMT"
        },
        {
          "title": "Anthony Elanga haunts Man United with goal of his life in 85-metre run",
          "description": "Anthony Elanga haunts Man United with goal of his life in 85-metre run  The Times",
          "date": "Tue, 01 Apr 2025 22:30:00 GMT"
        },
        {
          "title": "Nottingham Forest coach Nuno Espirito Santo full of praise for Anthony Elanga after key win",
          "description": "Nottingham Forest coach Nuno Espirito Santo full of praise for Anthony Elanga after key win  Flashscore.com",
          "date": "Tue, 01 Apr 2025 23:05:01 GMT"
        },
        {
          "title": "Anthony Elanga reminds Manchester United of lesson they continuously fail to learn",
          "description": "Anthony Elanga reminds Manchester United of lesson they continuously fail to learn  The Independent",
          "date": "Tue, 01 Apr 2025 22:05:00 GMT"
        },
        {
          "title": "Anthony Elanga scores solo stunner against former club Man Utd at City Ground",
          "description": "Anthony Elanga scores solo stunner against former club Man Utd at City Ground  Sky Sports",
          "date": "Tue, 01 Apr 2025 23:01:24 GMT"
        },
        {
          "title": "Rio Ferdinand blasts three Man Utd stars for not 'taking out' Anthony Elanga",
          "description": "Rio Ferdinand blasts three Man Utd stars for not 'taking out' Anthony Elanga  Metro.co.uk",
          "date": "Tue, 01 Apr 2025 23:18:00 GMT"
        },
        {
          "title": "Anthony Elanga shows Man Utd just what they're missing 👻",
          "description": "Anthony Elanga shows Man Utd just what they're missing 👻  Yahoo Sports",
          "date": "Tue, 01 Apr 2025 19:56:00 GMT"
        }
      ]
    },
    {
      "player_id": 1460,
      "player_name": "Bukayo Ayoyinka Temidayo Saka",
      "trending_score": 38.0,
      "trend_summary": "After a three-month layoff, Bukayo Saka marked his return by scoring in Arsenal's 2-1 Premier League win against Fulham. His comeback performance is hailed as a \"real boost\" for the team, though pre-match questions surrounded whether he would even start.\n",
      "news": [
        {
          "title": "Saka scores in Arsenal win after 3-month layoff",
          "description": "Saka scores in Arsenal win after 3-month layoff  ESPN",
          "date": "Tue, 01 Apr 2025 20:44:00 GMT"
        },
        {
          "title": "Bukayo Saka marks Arsenal return in perfect style ⚡",
          "description": "Bukayo Saka marks Arsenal return in perfect style ⚡  Yahoo Sports",
          "date": "Tue, 01 Apr 2025 20:28:00 GMT"
        },
        {
          "title": "Watch: Bukayo Saka scores in return as Arsenal beat Fulham 2-1 in Premier League",
          "description": "Watch: Bukayo Saka scores in return as Arsenal beat Fulham 2-1 in Premier League  NBC Connecticut",
          "date": "Tue, 01 Apr 2025 21:06:20 GMT"
        },
        {
          "title": "Will Bukayo Saka be Available vs. Fulham?",
          "description": "Will Bukayo Saka be Available vs. Fulham?  Sports Illustrated",
          "date": "Tue, 01 Apr 2025 13:55:40 GMT"
        },
        {
          "title": "Saka’s fairytale return shows his miracle-making potential for Arsenal",
          "description": "Saka’s fairytale return shows his miracle-making potential for Arsenal  The Independent",
          "date": "Tue, 01 Apr 2025 22:26:00 GMT"
        },
        {
          "title": "Arsenal 2-1 Fulham: Bukayo Saka scores seven minutes into comeback but it's a not all good news for Mikel Arte",
          "description": "Arsenal 2-1 Fulham: Bukayo Saka scores seven minutes into comeback but it's a not all good news for Mikel Arte  Daily Mail",
          "date": "Tue, 01 Apr 2025 20:53:55 GMT"
        },
        {
          "title": "Arsenal: Mikel Arteta admits Gabriel fears but left delighted for Bukayo Saka",
          "description": "Arsenal: Mikel Arteta admits Gabriel fears but left delighted for Bukayo Saka  Sky Sports",
          "date": "Tue, 01 Apr 2025 21:49:57 GMT"
        },
        {
          "title": "Bukayo Saka instantly scores on return as Arsenal extend incredible record that stretches back 121 years...",
          "description": "Bukayo Saka instantly scores on return as Arsenal extend incredible record that stretches back 121 years...  talkSPORT",
          "date": "Tue, 01 Apr 2025 20:42:33 GMT"
        },
        {
          "title": "Arsenal 2-1 Fulham: Bukayo Saka return 'a real boost'",
          "description": "Arsenal 2-1 Fulham: Bukayo Saka return 'a real boost'",
          "date": "Tue, 01 Apr 2025 21:54:22 GMT"
        },
        {
          "title": "Will Bukayo Saka start for Arsenal tonight against Fulham after injury?",
          "description": "Will Bukayo Saka start for Arsenal tonight against Fulham after injury?  London Evening Standard",
          "date": "Tue, 01 Apr 2025 21:51:13 GMT"
        }
      ]
    },
    {
      "player_id": 19305,
      "player_name": "Ryan James Yates",
      "trending_score": 22.0,
      "trend_summary": "Ryan Yates celebrated a \"special\" win after Nottingham Forest completed a league double over Manchester United. While Yates is mentioned in the context of the victory, the headlines focus on Elanga's standout performance, including a goal against Manchester United and Forest's FA Cup match against Ipswich Town.\n",
      "news": [
        {
          "title": "Ryan Yates on ‘special’ win after Nottingham Forest after do league double over Man Utd",
          "description": "Ryan Yates on ‘special’ win after Nottingham Forest after do league double over Man Utd  Hayters TV",
          "date": "Tue, 01 Apr 2025 21:30:27 GMT"
        },
        {
          "title": "Nottingham Forest 1 Man Utd 0 – How Elanga’s seven touches in nine seconds cut Amorim’s team apart",
          "description": "Nottingham Forest 1 Man Utd 0 – How Elanga’s seven touches in nine seconds cut Amorim’s team apart  The New York Times",
          "date": "Tue, 01 Apr 2025 22:06:01 GMT"
        },
        {
          "title": "'A special player'",
          "description": "'A special player'",
          "date": "Tue, 01 Apr 2025 22:49:44 GMT"
        },
        {
          "title": "Nottingham Forest vs Ipswich Town LIVE: FA Cup result, final score and reaction",
          "description": "Nottingham Forest vs Ipswich Town LIVE: FA Cup result, final score and reaction  Yahoo Sports",
          "date": "Tue, 01 Apr 2025 09:51:31 GMT"
        },
        {
          "title": "Electric Elanga haunts Manchester United with Nottingham Forest winner",
          "description": "Electric Elanga haunts Manchester United with Nottingham Forest winner  The Guardian",
          "date": "Tue, 01 Apr 2025 22:59:00 GMT"
        },
        {
          "title": "Nottingham Forest vs Manchester United Highlights: What happened in the NFO v MUN Premier League 2024-25 match?",
          "description": "Nottingham Forest vs Manchester United Highlights: What happened in the NFO v MUN Premier League 2024-25 match?  Sportstar",
          "date": "Tue, 01 Apr 2025 21:00:00 GMT"
        },
        {
          "title": "Nottingham Forest vs Man Utd LIVE: Premier League result and reaction",
          "description": "Nottingham Forest vs Man Utd LIVE: Premier League result and reaction  The Independent",
          "date": "Tue, 01 Apr 2025 21:08:00 GMT"
        },
        {
          "title": "Nottingham Forest's Resilience Shines In Narrow Victory Against Manchester United",
          "description": "Nottingham Forest's Resilience Shines In Narrow Victory Against Manchester United  myKhel",
          "date": "Tue, 01 Apr 2025 22:45:35 GMT"
        },
        {
          "title": "‘Not too shabby!’ Elanga scores goal of the season contender as Forest close in on Champions League",
          "description": "‘Not too shabby!’ Elanga scores goal of the season contender as Forest close in on Champions League  The Football Faithful",
          "date": "Tue, 01 Apr 2025 21:48:00 GMT"
        },
        {
          "title": "'A very hard game for us'",
          "description": "'A very hard game for us'",
          "date": "Tue, 01 Apr 2025 22:31:54 GMT"
        }
      ]
    }
  ]
}