{
  "updated_at": "2025-04-02T23:53:37.916290+00:00",
  "player_news": [
    {
      "player_id": 386828,
      "player_name": "Lamine Yamal Nasraoui Ebana",
      "trending_score": 100.0,
      "trend_summary": "Lamine Yamal delivered a brilliant assist in Barcelona's victory against Atlético Madrid in the Copa del Rey, a match they ultimately edged to reach the final against Real Madrid. Beyond his on-field contributions, including a goal for Spain against The Netherlands in extra time, Yamal's burgeoning career sees him venture into the world of sports ownership with his Kings League franchise receiving a World Cup wildcard.\n",
      "news": [
        {
          "title": "Watch: Lamine Yamal bags brilliant assist as Barcelona take the lead vs Atlético",
          "description": "Watch: Lamine Yamal bags brilliant assist as Barcelona take the lead vs Atlético  Yahoo",
          "date": "Wed, 02 Apr 2025 20:20:00 GMT"
        },
        {
          "title": "Pure magic! Lamine Yamal reaches 18 assists this season",
          "description": "Pure magic! Lamine Yamal reaches 18 assists this season  FCBN",
          "date": "Wed, 02 Apr 2025 21:20:20 GMT"
        },
        {
          "title": "Copa del Rey: Atletico Madrid vs Barcelona semifinal – start, lineup, news",
          "description": "Copa del Rey: Atletico Madrid vs Barcelona semifinal – start, lineup, news  Al Jazeera",
          "date": "Wed, 02 Apr 2025 11:30:59 GMT"
        },
        {
          "title": "WATCH: Lamine Yamal fires Spain in front in extra time against The Netherlands",
          "description": "WATCH: Lamine Yamal fires Spain in front in extra time against The Netherlands  Yahoo Sports",
          "date": "Wed, 02 Apr 2025 13:18:17 GMT"
        },
        {
          "title": "Yamal’s new Kings League franchise wildcarded into World Cup",
          "description": "Yamal’s new Kings League franchise wildcarded into World Cup  Inside World Football",
          "date": "Wed, 02 Apr 2025 10:11:50 GMT"
        },
        {
          "title": "Lamine Yamal did it all: Assist, great match... and a bloody ankle!",
          "description": "Lamine Yamal did it all: Assist, great match... and a bloody ankle!  FCBN",
          "date": "Wed, 02 Apr 2025 22:28:22 GMT"
        },
        {
          "title": "Lamine Yamal's net worth in 2025 has been revealed",
          "description": "Lamine Yamal's net worth in 2025 has been revealed  GiveMeSport",
          "date": "Wed, 02 Apr 2025 06:31:00 GMT"
        },
        {
          "title": "Lamine Yamal Net Worth: Salary and Sponsorship Deals (2025)",
          "description": "Lamine Yamal Net Worth: Salary and Sponsorship Deals (2025)  MSN",
          "date": "Wed, 02 Apr 2025 15:52:13 GMT"
        },
        {
          "title": "Will Lamine Yamal feature in Barcelona’s Copa Del Rey semi-final against Atletico Madrid?",
          "description": "Will Lamine Yamal feature in Barcelona’s Copa Del Rey semi-final against Atletico Madrid?  SportsTiger.com",
          "date": "Wed, 02 Apr 2025 14:55:30 GMT"
        },
        {
          "title": "Barcelona edge past Atletico Madrid to set up Copa del Rey final with Real Madrid",
          "description": "Barcelona edge past Atletico Madrid to set up Copa del Rey final with Real Madrid  BBC",
          "date": "Wed, 02 Apr 2025 14:29:41 GMT"
        }
      ]
    },
    {
      "player_id": 931,
      "player_name": "Ferran Torres García",
      "trending_score": 86.0,
      "trend_summary": "Ferran Torres's decisive goal propelled Barcelona to a narrow 1-0 victory against Atletico Madrid in the Copa del Rey semi-final, securing a coveted El Clasico final against Real Madrid. His performance is being hailed as a bright spot under new management.\n",
      "news": [
        {
          "title": "WATCH: Barcelona strike first blow against Atletico Madrid as Ferran Torres scores",
          "description": "WATCH: Barcelona strike first blow against Atletico Madrid as Ferran Torres scores  Yahoo Sports",
          "date": "Wed, 02 Apr 2025 22:18:45 GMT"
        },
        {
          "title": "Atletico Madrid 0-1 Barcelona: Player Ratings as Ferran Torres Sets Up El Clasico Copa del Rey Final",
          "description": "Atletico Madrid 0-1 Barcelona: Player Ratings as Ferran Torres Sets Up El Clasico Copa del Rey Final  Sports Illustrated",
          "date": "Wed, 02 Apr 2025 21:57:46 GMT"
        },
        {
          "title": "The 'Shark' bites again: Ferran Torres takes Barça to the final",
          "description": "The 'Shark' bites again: Ferran Torres takes Barça to the final  FCBN",
          "date": "Wed, 02 Apr 2025 23:00:47 GMT"
        },
        {
          "title": "Torres sends Barcelona past Atlético and into clásico Copa del Rey final",
          "description": "Torres sends Barcelona past Atlético and into clásico Copa del Rey final  The Guardian",
          "date": "Wed, 02 Apr 2025 21:47:00 GMT"
        },
        {
          "title": "Barca’s narrow 1-0 win at Atletico Madrid seals Copa semifinal – updates",
          "description": "Barca’s narrow 1-0 win at Atletico Madrid seals Copa semifinal – updates  Al Jazeera",
          "date": "Wed, 02 Apr 2025 20:09:11 GMT"
        },
        {
          "title": "Barcelona player ratings vs Atletico Madrid: Lamine Yamal and Ferran Torres produce moment of magic to settle semi-final and secure Clasico clash in Copa del Rey final",
          "description": "Barcelona player ratings vs Atletico Madrid: Lamine Yamal and Ferran Torres produce moment of magic to settle semi-final and secure Clasico clash in Copa del Rey final  Goal.com",
          "date": "Wed, 02 Apr 2025 21:29:44 GMT"
        },
        {
          "title": "Ferran Torres goal sets up Barcelona vs Real Madrid Copa del Rey final",
          "description": "Ferran Torres goal sets up Barcelona vs Real Madrid Copa del Rey final  London Evening Standard",
          "date": "Wed, 02 Apr 2025 21:37:10 GMT"
        },
        {
          "title": "Bizarre Vinícius Jr. vs Ferran Torres stat surfaces",
          "description": "Bizarre Vinícius Jr. vs Ferran Torres stat surfaces  Yahoo",
          "date": "Wed, 02 Apr 2025 15:57:00 GMT"
        },
        {
          "title": "Barcelona beat Atletico to set up cup final against Real Madrid",
          "description": "Barcelona beat Atletico to set up cup final against Real Madrid  The Straits Times",
          "date": "Wed, 02 Apr 2025 22:22:00 GMT"
        },
        {
          "title": "Barça-Atlético Madrid: Xavi Hernández's signing shines brightest under Hansi Flick",
          "description": "Barça-Atlético Madrid: Xavi Hernández's signing shines brightest under Hansi Flick  Diari ARA",
          "date": "Wed, 02 Apr 2025 05:01:13 GMT"
        }
      ]
    },
    {
      "player_id": 521,
      "player_name": "Robert Lewandowski",
      "trending_score": 67.0,
      "trend_summary": "Robert Lewandowski recently broke a La Liga record in Barcelona's win over Girona and scored a penalty to level a match, while admitting to rationing his effort to maintain fitness. Despite this, Barcelona are reportedly cooling their pursuit of a €45 million replacement and are even set to challenge Real Madrid for Lewandowski's heir.\n",
      "news": [
        {
          "title": "WATCH: Barcelona back on level terms as Robert Lewandowski scores from the penalty spot",
          "description": "WATCH: Barcelona back on level terms as Robert Lewandowski scores from the penalty spot  Yahoo Sports",
          "date": "Wed, 02 Apr 2025 17:50:00 GMT"
        },
        {
          "title": "Bayern Munich Pays the €80M and Blows Up Barça: Flick is Left Without His Star",
          "description": "Bayern Munich Pays the €80M and Blows Up Barça: Flick is Left Without His Star  carpetasfcb.com",
          "date": "Wed, 02 Apr 2025 11:00:00 GMT"
        },
        {
          "title": "Surprise La Liga forward outscores Vinicius, Robert Lewandowski and Jude Bellingham in 2024 without penalties",
          "description": "Surprise La Liga forward outscores Vinicius, Robert Lewandowski and Jude Bellingham in 2024 without penalties  Yahoo Sports",
          "date": "Wed, 02 Apr 2025 13:18:17 GMT"
        },
        {
          "title": "Robert Lewandowski makes history, breaks La Liga record in Barcelona's win over Girona",
          "description": "Robert Lewandowski makes history, breaks La Liga record in Barcelona's win over Girona  MSN",
          "date": "Wed, 02 Apr 2025 20:03:08 GMT"
        },
        {
          "title": "Champions League top-scorer reveals admiration for Lewandowski, Barcelona",
          "description": "Champions League top-scorer reveals admiration for Lewandowski, Barcelona  Barca Universal",
          "date": "Wed, 02 Apr 2025 06:50:46 GMT"
        },
        {
          "title": "Robert Lewandowski admits rationing out effort over last two months to maintain fitness",
          "description": "Robert Lewandowski admits rationing out effort over last two months to maintain fitness  Yahoo Sports",
          "date": "Wed, 02 Apr 2025 13:18:17 GMT"
        },
        {
          "title": "Robert Lewandowski Starts",
          "description": "Robert Lewandowski Starts",
          "date": "Wed, 02 Apr 2025 00:50:10 GMT"
        },
        {
          "title": "Barcelona cool their pursuit of €45 million-rated Robert Lewandowski replacement",
          "description": "Barcelona cool their pursuit of €45 million-rated Robert Lewandowski replacement  Yahoo Sports",
          "date": "Wed, 02 Apr 2025 13:18:17 GMT"
        },
        {
          "title": "Barcelona set to challenge Real Madrid for Robert Lewandowski’s heir – report",
          "description": "Barcelona set to challenge Real Madrid for Robert Lewandowski’s heir – report  Yahoo Sports",
          "date": "Wed, 02 Apr 2025 13:18:17 GMT"
        },
        {
          "title": "Robert Lewandowski Starts",
          "description": "Robert Lewandowski Starts",
          "date": "Wed, 02 Apr 2025 05:43:46 GMT"
        }
      ]
    },
    {
      "player_id": 19599,
      "player_name": "Damián Emiliano Martínez Romero",
      "trending_score": 56.0,
      "trend_summary": "Emiliano Martínez's Aston Villa secured a dominant 3-0 victory over Brighton in Premier League action. Villa also beat Preston to reach the FA Cup semi-finals, where they will face Crystal Palace.\n",
      "news": [
        {
          "title": "Game summary",
          "description": "Game summary  MSN",
          "date": "Wed, 02 Apr 2025 22:55:40 GMT"
        },
        {
          "title": "Brighton 0-3 Aston Villa: Highlights, man of the match, stats as Rashford boosts Villa's European hopes",
          "description": "Brighton 0-3 Aston Villa: Highlights, man of the match, stats as Rashford boosts Villa's European hopes  Sports Mole",
          "date": "Wed, 02 Apr 2025 21:00:00 GMT"
        },
        {
          "title": "Aston Villa ratings v Brighton: Rashford & Asensio score but other forward stands out",
          "description": "Aston Villa ratings v Brighton: Rashford & Asensio score but other forward stands out  birminghamworld.uk",
          "date": "Wed, 02 Apr 2025 21:20:00 GMT"
        },
        {
          "title": "Brighton vs Aston Villa: previous stats",
          "description": "Brighton vs Aston Villa: previous stats",
          "date": "Wed, 02 Apr 2025 05:36:21 GMT"
        },
        {
          "title": "Rashford scores as Aston Villa secure big win at Brighton",
          "description": "Rashford scores as Aston Villa secure big win at Brighton  TribalFootball",
          "date": "Wed, 02 Apr 2025 03:09:00 GMT"
        },
        {
          "title": "Aston Villa beat Preston to reach FA Cup semi-finals, face Crystal Palace",
          "description": "Aston Villa beat Preston to reach FA Cup semi-finals, face Crystal Palace  Yahoo Sports",
          "date": "Wed, 02 Apr 2025 12:35:39 GMT"
        },
        {
          "title": "“Lacking a bit of experience” – Former Chelsea manager names 2 players the club need to sign",
          "description": "“Lacking a bit of experience” – Former Chelsea manager names 2 players the club need to sign  chelsea.news",
          "date": "Wed, 02 Apr 2025 11:30:00 GMT"
        },
        {
          "title": "Strong Aston Villa midfield triangle starts against Brighton",
          "description": "Strong Aston Villa midfield triangle starts against Brighton  claretvillans.com",
          "date": "Wed, 02 Apr 2025 17:55:39 GMT"
        },
        {
          "title": "Marcus Rashford scores first Premier League goal for Villa in win at Brighton",
          "description": "Marcus Rashford scores first Premier League goal for Villa in win at Brighton  inkl",
          "date": "Wed, 02 Apr 2025 21:01:10 GMT"
        },
        {
          "title": "Argentina, a group of death at the 2026 World Cup?",
          "description": "Argentina, a group of death at the 2026 World Cup?  French Football Weekly",
          "date": "Wed, 02 Apr 2025 04:48:41 GMT"
        }
      ]
    },
    {
      "player_id": 158054,
      "player_name": "Nick Woltemade",
      "trending_score": 45.0,
      "trend_summary": "Nick Woltemade delivered a strong performance alongside Angelo Stiller in Stuttgart's 3-1 victory over RB Leipzig, securing VfB Stuttgart's first DFB Pokal final appearance since 2013. His performance has also sparked speculation, with some suggesting he could be a smart summer signing for Liverpool as a potential Darwin Nunez replacement.\n",
      "news": [
        {
          "title": "PLAYER RATINGS",
          "description": "PLAYER RATINGS",
          "date": "Wed, 02 Apr 2025 21:39:38 GMT"
        },
        {
          "title": "This Darwin Nunez Replacement Could Be Liverpool’s Smartest Summer Signing",
          "description": "This Darwin Nunez Replacement Could Be Liverpool’s Smartest Summer Signing  Yahoo Sports",
          "date": "Wed, 02 Apr 2025 15:50:00 GMT"
        },
        {
          "title": "Stuttgart beat RB Leipzig 3-1 to reach German Cup final",
          "description": "Stuttgart beat RB Leipzig 3-1 to reach German Cup final  The Straits Times",
          "date": "Wed, 02 Apr 2025 21:07:00 GMT"
        },
        {
          "title": "Stuttgart beat Leipzig to reach German Cup final",
          "description": "Stuttgart beat Leipzig to reach German Cup final  NST Online",
          "date": "Wed, 02 Apr 2025 23:35:13 GMT"
        },
        {
          "title": "Stuttgart beat RB Leipzig to reach German Cup final",
          "description": "Stuttgart beat RB Leipzig to reach German Cup final  BBC",
          "date": "Wed, 02 Apr 2025 21:11:15 GMT"
        },
        {
          "title": "RB Leipzig vs. VfB Stuttgart: live game updates, stats, play-by-play",
          "description": "RB Leipzig vs. VfB Stuttgart: live game updates, stats, play-by-play  Yahoo",
          "date": "Wed, 02 Apr 2025 18:45:00 GMT"
        },
        {
          "title": "Bayern Munich coach Vincent Kompany eager for Club World Cup, playing in front of American fans",
          "description": "Bayern Munich coach Vincent Kompany eager for Club World Cup, playing in front of American fans  Yahoo Sports",
          "date": "Wed, 02 Apr 2025 16:21:28 GMT"
        }
      ]
    }
  ]
}