{
  "updated_at": "2025-02-10T23:56:56.424317+00:00",
  "player_news": [
    {
      "player_id": 3007,
      "player_name": "Przemysław Adam Frankowski",
      "trending_score": 100.0,
      "trend_summary": "Polish international Przemysław Frankowski has completed a €8 million transfer from RC Lens to Galatasaray, ending weeks of speculation surrounding his future. The winger had been pushing for a move to the Turkish giants, and has now signed a contract with the Süper Lig club.",
      "news": [
        {
          "title": "Lens’ Przemyslaw Frankowski forcing through Galatasaray move",
          "description": "Lens’ Przemyslaw Frankowski forcing through Galatasaray move  Yahoo Sports",
          "date": "Mon, 10 Feb 2025 10:20:00 GMT"
        },
        {
          "title": "Galatasaray signs Polish international Frankowski",
          "description": "Galatasaray signs Polish international Frankowski  APA",
          "date": "Mon, 10 Feb 2025 14:32:00 GMT"
        },
        {
          "title": "Shocking Transfer: Polish Star Przemysław Frankowski Joins Galatasaray!",
          "description": "Shocking Transfer: Polish Star Przemysław Frankowski Joins Galatasaray!  Elblog.pl",
          "date": "Mon, 10 Feb 2025 09:32:39 GMT"
        },
        {
          "title": "Lens winger Frankowski joins Galatasaray for €8 million",
          "description": "Lens winger Frankowski joins Galatasaray for €8 million",
          "date": "Mon, 10 Feb 2025 11:35:53 GMT"
        },
        {
          "title": "Strike in Ligue 1, the decision falls",
          "description": "Strike in Ligue 1, the decision falls  French Football Weekly",
          "date": "Mon, 10 Feb 2025 17:18:06 GMT"
        }
      ]
    },
    {
      "player_id": 21509,
      "player_name": "Marcus Lilian Thuram-Ulien",
      "trending_score": 84.0,
      "trend_summary": "Marcus Thuram's Serie A debut for Inter Milan was cut short due to an early injury in the first half of their match against Fiorentina. Despite Inter's 3-1 victory, Thuram's setback is a significant blow as the team chases the Serie A title.",
      "news": [
        {
          "title": "Thuram forced off early in Inter-Fiorentina first half",
          "description": "Thuram forced off early in Inter-Fiorentina first half  Football Italia",
          "date": "Mon, 10 Feb 2025 21:02:21 GMT"
        },
        {
          "title": "Video – Inter Milan share Marcus Thuram First Goal For Club In Serie A Clash Vs Fiorentina",
          "description": "Video – Inter Milan share Marcus Thuram First Goal For Club In Serie A Clash Vs Fiorentina  OneFootball",
          "date": "Mon, 10 Feb 2025 05:37:32 GMT"
        },
        {
          "title": "France Superstar Could Be Benched In Inter Milan Vs Fiorentina Serie A Clash As Inzaghi Plans Shakeup Of Team",
          "description": "France Superstar Could Be Benched In Inter Milan Vs Fiorentina Serie A Clash As Inzaghi Plans Shakeup Of Team  SempreInter.com",
          "date": "Mon, 10 Feb 2025 09:44:53 GMT"
        },
        {
          "title": "Inter take revenge on Fiorentina to stay in title hunt",
          "description": "Inter take revenge on Fiorentina to stay in title hunt  The Straits Times",
          "date": "Mon, 10 Feb 2025 22:48:00 GMT"
        },
        {
          "title": "Inter vs Fiorentina Prediction: Team News, Predicted Lineups and Where To Watch",
          "description": "Inter vs Fiorentina Prediction: Team News, Predicted Lineups and Where To Watch  WhoScored.com",
          "date": "Mon, 10 Feb 2025 13:46:00 GMT"
        },
        {
          "title": "Serie A: Inter vs Fiorentina – probable line-ups and where to watch on TV",
          "description": "Serie A: Inter vs Fiorentina – probable line-ups and where to watch on TV  Football Italia",
          "date": "Mon, 10 Feb 2025 08:57:48 GMT"
        },
        {
          "title": "Inter Milan vs. Fiorentina: Preview, Team News, and Prediction for Serie A Clash – Sportnews",
          "description": "Inter Milan vs. Fiorentina: Preview, Team News, and Prediction for Serie A Clash – Sportnews  HPBL",
          "date": "Mon, 10 Feb 2025 20:08:33 GMT"
        },
        {
          "title": "Marcus Thuram, it turns badly",
          "description": "Marcus Thuram, it turns badly  French Football Weekly",
          "date": "Mon, 10 Feb 2025 07:20:07 GMT"
        },
        {
          "title": "Inter vs Fiorentina Prediction, Match Preview and Live Streaming, 10 February 2025",
          "description": "Inter vs Fiorentina Prediction, Match Preview and Live Streaming, 10 February 2025  InsideSport",
          "date": "Mon, 10 Feb 2025 19:20:06 GMT"
        },
        {
          "title": "Serie A: Inter dominates the fiorentina but loses Marcus Thuram on injury",
          "description": "Serie A: Inter dominates the fiorentina but loses Marcus Thuram on injury  French Football Weekly",
          "date": "Mon, 10 Feb 2025 22:00:55 GMT"
        }
      ]
    },
    {
      "player_id": 747,
      "player_name": "Carlos Henrique Casimiro",
      "trending_score": 59.0,
      "trend_summary": "Manchester United midfielder Casemiro is reportedly set to depart on loan, with a South American club reportedly investigating the possibility. Despite the transfer window being closed, United are said to have reached an agreement to offload the Brazilian, who could be replaced by Ederson for a fee of £42 million.",
      "news": [
        {
          "title": "Casemiro set for loan away as Man Utd scout ‘wonderkid’ – Paper Round",
          "description": "Casemiro set for loan away as Man Utd scout ‘wonderkid’ – Paper Round  Eurosport COM",
          "date": "Mon, 10 Feb 2025 22:47:00 GMT"
        },
        {
          "title": "Man Utd can now sign Ederson for £42m, could replace Casemiro",
          "description": "Man Utd can now sign Ederson for £42m, could replace Casemiro  OneFootball",
          "date": "Mon, 10 Feb 2025 16:47:07 GMT"
        },
        {
          "title": "South American giants 'investigating' Casemiro loan",
          "description": "South American giants 'investigating' Casemiro loan  90min UK",
          "date": "Mon, 10 Feb 2025 14:45:32 GMT"
        },
        {
          "title": "Man Utd 'reach agreement' to loan out Casemiro in late transfer",
          "description": "Man Utd 'reach agreement' to loan out Casemiro in late transfer  FootballTransfers",
          "date": "Mon, 10 Feb 2025 18:37:00 GMT"
        },
        {
          "title": "Manchester United could agree to surprise exit despite transfer window being closed...",
          "description": "Manchester United could agree to surprise exit despite transfer window being closed...  talkSPORT",
          "date": "Mon, 10 Feb 2025 14:10:26 GMT"
        },
        {
          "title": "United must sign Atalanta star with Casemiro poised to leave, ideal player for Amorim",
          "description": "United must sign Atalanta star with Casemiro poised to leave, ideal player for Amorim  OneFootball",
          "date": "Mon, 10 Feb 2025 10:40:32 GMT"
        },
        {
          "title": "Man Utd in 'agreement' to offload £60m flop in 'very risky business' deal for mooted new club",
          "description": "Man Utd in 'agreement' to offload £60m flop in 'very risky business' deal for mooted new club  Football365",
          "date": "Mon, 10 Feb 2025 11:45:34 GMT"
        },
        {
          "title": "Manchester United ready to cover majority of wages to help star player leave this month on loan",
          "description": "Manchester United ready to cover majority of wages to help star player leave this month on loan",
          "date": "Mon, 10 Feb 2025 12:01:00 GMT"
        },
        {
          "title": "Man United ‘agree Casemiro exit’ after approach from new club",
          "description": "Man United ‘agree Casemiro exit’ after approach from new club  Joe UK",
          "date": "Mon, 10 Feb 2025 11:06:02 GMT"
        },
        {
          "title": "Man Utd could complete deal more than a week after transfer window closes in shock move nobody expected",
          "description": "Man Utd could complete deal more than a week after transfer window closes in shock move nobody expected  SPORTbible",
          "date": "Mon, 10 Feb 2025 12:22:33 GMT"
        }
      ]
    },
    {
      "player_id": 786,
      "player_name": "Nicolò Zaniolo",
      "trending_score": 42.0,
      "trend_summary": "Nicolò Zaniolo has expressed regret over his summer transfer decision, citing an injury suffered while playing for Aston Villa as a contributing factor. In a recent match between Inter and Fiorentina, Zaniolo was instrumental in Inter's 2-1 victory, scoring the match-winning goal.",
      "news": [
        {
          "title": "Zaniolo regrets Aston Villa injury and summer transfer decision",
          "description": "Zaniolo regrets Aston Villa injury and summer transfer decision  OneFootball",
          "date": "Mon, 10 Feb 2025 15:10:45 GMT"
        },
        {
          "title": "Zaniolo regrets Aston Villa injury and summer transfer decision",
          "description": "Zaniolo regrets Aston Villa injury and summer transfer decision  Football Italia",
          "date": "Mon, 10 Feb 2025 15:06:23 GMT"
        },
        {
          "title": "Serie A: Inter 2-1 Fiorentina – Inzaghi revenge on La Viola",
          "description": "Serie A: Inter 2-1 Fiorentina – Inzaghi revenge on La Viola  Football Italia",
          "date": "Mon, 10 Feb 2025 21:42:29 GMT"
        }
      ]
    },
    {
      "player_id": 136087,
      "player_name": "Fabiano Parisi",
      "trending_score": 29.0,
      "trend_summary": "In a thrilling Serie A clash, Fabiano Parisi's Fiorentina narrowly fell 2-1 to Inter Milan, despite a valiant effort that included a crucial assist for his team's only goal.",
      "news": [
        {
          "title": "Serie A: Inter 2-1 Fiorentina – Inzaghi revenge on La Viola",
          "description": "Serie A: Inter 2-1 Fiorentina – Inzaghi revenge on La Viola  Football Italia",
          "date": "Mon, 10 Feb 2025 21:42:29 GMT"
        }
      ]
    }
  ]
}