{
  "updated_at": "2025-03-26T00:06:24.429846+00:00",
  "player_news": [
    {
      "player_id": 1496,
      "player_name": "Raphael Dias Belloli",
      "trending_score": 100.0,
      "trend_summary": "Ahead of the World Cup qualifier against Argentina, Raphinha has ignited tensions by declaring that Brazil will \"beat them up.\" Meanwhile, a separate report speculates on the surprising price it would take to remove him from FC Barcelona.\n",
      "news": [
        {
          "title": "Raphinha: We will beat up Argentina",
          "description": "Raphinha: We will beat up Argentina  sportsmax.tv",
          "date": "Tue, 25 Mar 2025 20:14:15 GMT"
        },
        {
          "title": "Raphinha says Brazil will ‘beat up Argentina on and off pitch if we have to’ in World Cup qualifier",
          "description": "Raphinha says Brazil will ‘beat up Argentina on and off pitch if we have to’ in World Cup qualifier  The Indian Express",
          "date": "Tue, 25 Mar 2025 09:52:33 GMT"
        },
        {
          "title": "Brazil star Raphinha stokes up Argentina tensions and promises: \"We'll beat them up\"",
          "description": "Brazil star Raphinha stokes up Argentina tensions and promises: \"We'll beat them up\"  The Mirror",
          "date": "Tue, 25 Mar 2025 11:36:00 GMT"
        },
        {
          "title": "Brazil will beat Argentina up in World Cup qualifier, says Raphinha",
          "description": "Brazil will beat Argentina up in World Cup qualifier, says Raphinha  The Straits Times",
          "date": "Tue, 25 Mar 2025 12:41:00 GMT"
        },
        {
          "title": "Raphinha: What is the price to take him out of Barça? You will be surprised",
          "description": "Raphinha: What is the price to take him out of Barça? You will be surprised  FC Barcelona Noticias",
          "date": "Tue, 25 Mar 2025 01:08:00 GMT"
        },
        {
          "title": "Brazil's Raphinha vows: 'We’ll beat them up' ahead of Argentina showdown",
          "description": "Brazil's Raphinha vows: 'We’ll beat them up' ahead of Argentina showdown  Gulf News",
          "date": "Tue, 25 Mar 2025 08:06:21 GMT"
        },
        {
          "title": "Argentina vs Brazil LIVE Streaming Online, FIFA World Cup 2026 Qualifiers: How to watch ARG v BRA match? Telecast news, Predicted lineups",
          "description": "Argentina vs Brazil LIVE Streaming Online, FIFA World Cup 2026 Qualifiers: How to watch ARG v BRA match? Telecast news, Predicted lineups  The Indian Express",
          "date": "Tue, 25 Mar 2025 18:21:00 GMT"
        },
        {
          "title": "Raphinha's Bold Words Ignite Tensions Before Brazil-Argentina Clash",
          "description": "Raphinha's Bold Words Ignite Tensions Before Brazil-Argentina Clash  Evrim Ağacı",
          "date": "Tue, 25 Mar 2025 05:32:50 GMT"
        },
        {
          "title": "We’ll beat them up: Raphinha sounds warning bell ahead of Argentina vs Brazil World Cup qualifier",
          "description": "We’ll beat them up: Raphinha sounds warning bell ahead of Argentina vs Brazil World Cup qualifier  Sportstar",
          "date": "Tue, 25 Mar 2025 05:07:06 GMT"
        },
        {
          "title": "Barcelona star Raphinha opens up on Ballon d’Or claims",
          "description": "Barcelona star Raphinha opens up on Ballon d’Or claims  Sporting News",
          "date": "Tue, 25 Mar 2025 12:57:07 GMT"
        }
      ]
    },
    {
      "player_id": 363695,
      "player_name": "Murillo Santiago Costa dos Santos",
      "trending_score": 93.0,
      "trend_summary": "Murillo, Nottingham Forest's breakout Brazilian defender, is turning heads in the Premier League and sparking transfer speculation just months after signing a new deal. Meanwhile, Amir Murillo is set to miss Marseille's upcoming Ligue 1 match against Reims.\n",
      "news": [
        {
          "title": "Who is Murillo? Meet Nottingham Forest's Brazilian sensation taking the Premier League by storm",
          "description": "Who is Murillo? Meet Nottingham Forest's Brazilian sensation taking the Premier League by storm  Nottingham Forest News",
          "date": "Tue, 25 Mar 2025 17:00:00 GMT"
        },
        {
          "title": "Pierre-Emile Højbjerg and Amir Murillo set to miss Marseille’s trip to Reims",
          "description": "Pierre-Emile Højbjerg and Amir Murillo set to miss Marseille’s trip to Reims  Get French Football News",
          "date": "Tue, 25 Mar 2025 13:31:36 GMT"
        },
        {
          "title": "Murillo makes fresh transfer admission just months after signing new Nottingham Forest deal",
          "description": "Murillo makes fresh transfer admission just months after signing new Nottingham Forest deal  Nottingham Forest News",
          "date": "Tue, 25 Mar 2025 18:00:00 GMT"
        },
        {
          "title": "LIVE Argentina vs Brazil updates, FIFA World Cup qualifiers: Starting lineups out; Raphinha, Alvarez start; 5:30 AM IST kick-off; ARG v BRA",
          "description": "LIVE Argentina vs Brazil updates, FIFA World Cup qualifiers: Starting lineups out; Raphinha, Alvarez start; 5:30 AM IST kick-off; ARG v BRA  Sportstar",
          "date": "Tue, 25 Mar 2025 23:03:45 GMT"
        },
        {
          "title": "Nottingham Forest sign £60m striker and ex-Derby star in dream XI if rumours are true",
          "description": "Nottingham Forest sign £60m striker and ex-Derby star in dream XI if rumours are true  3 Added Minutes",
          "date": "Tue, 25 Mar 2025 17:00:00 GMT"
        },
        {
          "title": "While Bruno Fernandes is valued at €55 million, that's what Murillo costs",
          "description": "While Bruno Fernandes is valued at €55 million, that's what Murillo costs  Red Devils fan zone",
          "date": "Tue, 25 Mar 2025 22:03:40 GMT"
        },
        {
          "title": "Argentina vs Brazil: A Superclásico for World Cup Qualification Awaits",
          "description": "Argentina vs Brazil: A Superclásico for World Cup Qualification Awaits  FootBoom",
          "date": "Tue, 25 Mar 2025 03:32:09 GMT"
        }
      ]
    },
    {
      "player_id": 42315,
      "player_name": "Mehdi Taremi",
      "trending_score": 72.0,
      "trend_summary": "Mehdi Taremi's two goals against Uzbekistan secured Iran's qualification for the 2026 World Cup, making them one of the first teams to reach the tournament. The Inter Milan striker's heroics have sparked discussion about potential travel bans impacting the team's participation.\n",
      "news": [
        {
          "title": "Iran qualifies for the 2026 World Cup after Taremi scores twice in 2-2 draw with Uzbekistan",
          "description": "Iran qualifies for the 2026 World Cup after Taremi scores twice in 2-2 draw with Uzbekistan  Times-West Virginian",
          "date": "Tue, 25 Mar 2025 19:00:00 GMT"
        },
        {
          "title": "Political football as Iran reach World Cup while Australia, Saudis stay alive",
          "description": "Political football as Iran reach World Cup while Australia, Saudis stay alive  KHQ Right Now",
          "date": "Tue, 25 Mar 2025 19:48:14 GMT"
        },
        {
          "title": "Iran qualify for 2026 World Cup amid potential Trump travel ban",
          "description": "Iran qualify for 2026 World Cup amid potential Trump travel ban  The Guardian",
          "date": "Tue, 25 Mar 2025 21:20:00 GMT"
        },
        {
          "title": "Iran 2-2 Uzbekistan: Team Melli Become Third Side To Qualify For FIFA World Cup 2026",
          "description": "Iran 2-2 Uzbekistan: Team Melli Become Third Side To Qualify For FIFA World Cup 2026  Outlook India",
          "date": "Tue, 25 Mar 2025 20:43:30 GMT"
        },
        {
          "title": "Iran become sixth team to qualify for 2026 FIFA World Cup as Mehdi Taremi grabs brace in draw against Uzbekistan",
          "description": "Iran become sixth team to qualify for 2026 FIFA World Cup as Mehdi Taremi grabs brace in draw against Uzbekistan  Goal.com",
          "date": "Tue, 25 Mar 2025 20:05:46 GMT"
        },
        {
          "title": "Inter striker Taremi the hero as Iran qualify for 2026 World Cup",
          "description": "Inter striker Taremi the hero as Iran qualify for 2026 World Cup  Football Italia",
          "date": "Tue, 25 Mar 2025 18:45:15 GMT"
        }
      ]
    },
    {
      "player_id": 744,
      "player_name": "Brahim Abdelkader Díaz",
      "trending_score": 64.0,
      "trend_summary": "Brahim Díaz featured for Morocco in their 2-0 World Cup qualifier victory over Tanzania as Morocco edges closer to the World Cup. Meanwhile, his Real Madrid teammates, Endrick Felipe and Arda Guler, face uncertain futures, with Endrick even expressing fears about missing the 2026 World Cup.\n",
      "news": [
        {
          "title": "Goals and Highlights: Morocco 2-0 Tanzania in World Cup Qualifiers",
          "description": "Goals and Highlights: Morocco 2-0 Tanzania in World Cup Qualifiers  VAVEL.com",
          "date": "Tue, 25 Mar 2025 23:33:53 GMT"
        },
        {
          "title": "Algeria, Egypt and Morocco edge closer to World Cup as South Africa face losing points",
          "description": "Algeria, Egypt and Morocco edge closer to World Cup as South Africa face losing points  The Straits Times",
          "date": "Tue, 25 Mar 2025 23:53:46 GMT"
        },
        {
          "title": "Morocco Tanzania WCup Soccer",
          "description": "Morocco Tanzania WCup Soccer  Lufkin Daily News",
          "date": "Tue, 25 Mar 2025 23:24:17 GMT"
        },
        {
          "title": "Real Madrid starlets Endrick Felipe and Arda Guler facing differing paths this summer",
          "description": "Real Madrid starlets Endrick Felipe and Arda Guler facing differing paths this summer  Football Espana",
          "date": "Tue, 25 Mar 2025 14:40:56 GMT"
        },
        {
          "title": "Morocco vs Tanzania: When, How to Watch & Score Prediction",
          "description": "Morocco vs Tanzania: When, How to Watch & Score Prediction  Morocco World News",
          "date": "Tue, 25 Mar 2025 12:30:47 GMT"
        },
        {
          "title": "Endrick Fears Missing 2026 World Cup, Open to Leaving Real Madrid",
          "description": "Endrick Fears Missing 2026 World Cup, Open to Leaving Real Madrid  DailySports",
          "date": "Tue, 25 Mar 2025 22:29:00 GMT"
        }
      ]
    },
    {
      "player_id": 1942,
      "player_name": "Junya Ito",
      "trending_score": 51.0,
      "trend_summary": "Junya Ito played in the World Cup-bound Japan squad that was held to a 0-0 draw at home by Saudi Arabia. The winger featured in the match, but the provided information offers no further details about his individual performance or impact on the game.\n",
      "news": [
        {
          "title": "Football: World Cup-bound Japan held 0-0 at home by Saudi Arabia",
          "description": "Football: World Cup-bound Japan held 0-0 at home by Saudi Arabia  Kyodo News Plus",
          "date": "Tue, 25 Mar 2025 14:43:30 GMT"
        }
      ]
    }
  ]
}