{
  "updated_at": "2025-01-20T23:51:41.369806+00:00",
  "player_news": [
    {
      "player_id": 382452,
      "player_name": "Patrick Chinazaekpere Dorgu",
      "trending_score": 100.0,
      "trend_summary": "Manchester United are reportedly in talks to sign Danish star Patrick Dorgu from Lecce, with the 19-year-old defender impressing in Serie A and for his national team. Despite rumors of a £34 million transfer, Lecce has reportedly warned United that Dorgu will not be joining them in January, casting doubt on the potential move.",
      "news": [
        {
          "title": "Manchester United in talks to sign Patrick Dorgu from Lecce",
          "description": "Manchester United in talks to sign Patrick Dorgu from Lecce",
          "date": "Mon, 20 Jan 2025 10:44:44 GMT"
        },
        {
          "title": "Why Manchester United should be excited about Patrick Dorgu",
          "description": "Why Manchester United should be excited about Patrick Dorgu  Yahoo Canada Sports",
          "date": "Mon, 20 Jan 2025 13:34:00 GMT"
        },
        {
          "title": "Football gossip: Garnacho, Dorgu, Ait-Nouri, Ancelotti, Elliot, Kerkez",
          "description": "Football gossip: Garnacho, Dorgu, Ait-Nouri, Ancelotti, Elliot, Kerkez  BBC.com",
          "date": "Mon, 20 Jan 2025 22:37:12 GMT"
        },
        {
          "title": "Man Utd to secure one of their best coups in years as Fabrizio Romano delivers major update",
          "description": "Man Utd to secure one of their best coups in years as Fabrizio Romano delivers major update  Stretty News",
          "date": "Mon, 20 Jan 2025 17:43:48 GMT"
        },
        {
          "title": "Man United schedule talks with two Serie A clubs for Garnacho and Dorgu",
          "description": "Man United schedule talks with two Serie A clubs for Garnacho and Dorgu  Football Italia",
          "date": "Mon, 20 Jan 2025 22:52:30 GMT"
        },
        {
          "title": "Man Utd looking to offload one player to help agree £34m Patrick Dorgu transfer",
          "description": "Man Utd looking to offload one player to help agree £34m Patrick Dorgu transfer  Express",
          "date": "Mon, 20 Jan 2025 20:53:00 GMT"
        },
        {
          "title": "🎥 Patrick Dorgu's best moments ahead of potential Man Utd move",
          "description": "🎥 Patrick Dorgu's best moments ahead of potential Man Utd move  OneFootball",
          "date": "Mon, 20 Jan 2025 13:16:09 GMT"
        },
        {
          "title": "Who is Patrick Dorgu? Lecce and Denmark star tipped to solve Ruben Amorim's Man United wingback problem",
          "description": "Who is Patrick Dorgu? Lecce and Denmark star tipped to solve Ruben Amorim's Man United wingback problem  Sporting News",
          "date": "Mon, 20 Jan 2025 12:31:21 GMT"
        },
        {
          "title": "Man Utd warned Patrick Dorgu will NOT join them in January amid £25m transfer talks",
          "description": "Man Utd warned Patrick Dorgu will NOT join them in January amid £25m transfer talks  The Mirror",
          "date": "Mon, 20 Jan 2025 18:15:00 GMT"
        },
        {
          "title": "Transfer Talk: Man Utd: Could Patrick Dorgu fit into Ruben Amorim's system?",
          "description": "Transfer Talk: Man Utd: Could Patrick Dorgu fit into Ruben Amorim's system?",
          "date": "Mon, 20 Jan 2025 13:59:50 GMT"
        }
      ]
    },
    {
      "player_id": 1566,
      "player_name": "Emerson Aparecido Leite de Souza Júnior",
      "trending_score": 81.0,
      "trend_summary": "Emerson Royal, the Brazilian full-back currently playing for AC Milan, has attracted interest from Fulham and Galatasaray, with both clubs reportedly initiating talks with Milan over a potential transfer. The 24-year-old has made 15 appearances for Milan this season, providing one assist.",
      "news": [
        {
          "title": "Fulham join Galatasaray in queue for Milan defender Emerson Royal",
          "description": "Fulham join Galatasaray in queue for Milan defender Emerson Royal  Football Italia",
          "date": "Mon, 20 Jan 2025 19:26:31 GMT"
        },
        {
          "title": "Romano: Galatasaray initiate talks with Milan over signing of Emerson Royal",
          "description": "Romano: Galatasaray initiate talks with Milan over signing of Emerson Royal  OneFootball",
          "date": "Mon, 20 Jan 2025 13:36:14 GMT"
        },
        {
          "title": "Milan transfers: Galatasaray call for Emerson Royal, West Ham interest Okafor",
          "description": "Milan transfers: Galatasaray call for Emerson Royal, West Ham interest Okafor  Football Italia",
          "date": "Mon, 20 Jan 2025 13:01:30 GMT"
        },
        {
          "title": "Di Marzio: Galatasaray not the only club on Emerson Royal",
          "description": "Di Marzio: Galatasaray not the only club on Emerson Royal  Milan Reports",
          "date": "Mon, 20 Jan 2025 20:00:11 GMT"
        },
        {
          "title": "Transfer Liveblog: 2025 January window – rumours and done deals",
          "description": "Transfer Liveblog: 2025 January window – rumours and done deals  Football Italia",
          "date": "Mon, 20 Jan 2025 12:40:28 GMT"
        },
        {
          "title": "Fulham join Galatasaray in Emerson Royal pursuit",
          "description": "Fulham join Galatasaray in Emerson Royal pursuit  Football Today",
          "date": "Mon, 20 Jan 2025 19:57:58 GMT"
        }
      ]
    },
    {
      "player_id": 360114,
      "player_name": "Abduqodir Khusanov",
      "trending_score": 79.0,
      "trend_summary": "Manchester City has signed 20-year-old Uzbekistan international defender Abdukodir Khusanov from Lens for a reported £33.8 million, with the player signing a contract until 2029. Khusanov, who has been capped 11 times by Uzbekistan, is seen as a promising talent and is expected to bolster Manchester City's defensive options.",
      "news": [
        {
          "title": "Manchester City complete Abdukodir Khusanov transfer from Lens",
          "description": "Manchester City complete Abdukodir Khusanov transfer from Lens",
          "date": "Mon, 20 Jan 2025 18:04:06 GMT"
        },
        {
          "title": "Who is Abdukodir Khusanov? 20-year-old Lens CB completes January move to Manchester City",
          "description": "Who is Abdukodir Khusanov? 20-year-old Lens CB completes January move to Manchester City  Transfermarkt",
          "date": "Mon, 20 Jan 2025 18:03:44 GMT"
        },
        {
          "title": "Abdukodir Khusanov: Man City sign Uzbekistan international defender from Lens",
          "description": "Abdukodir Khusanov: Man City sign Uzbekistan international defender from Lens  Sky Sports",
          "date": "Mon, 20 Jan 2025 18:08:55 GMT"
        },
        {
          "title": "Abdukodir Khusanov: Manchester City sign Lens and Uzbekistan centre-back until 2029",
          "description": "Abdukodir Khusanov: Manchester City sign Lens and Uzbekistan centre-back until 2029  BBC.com",
          "date": "Mon, 20 Jan 2025 18:13:14 GMT"
        },
        {
          "title": "10 things about Abdukodir Khusanov",
          "description": "10 things about Abdukodir Khusanov  Manchester City FC",
          "date": "Mon, 20 Jan 2025 18:00:00 GMT"
        },
        {
          "title": "Manchester City sign £33.8m defender Abdukodir Khusanov from Lens",
          "description": "Manchester City sign £33.8m defender Abdukodir Khusanov from Lens  The Guardian",
          "date": "Mon, 20 Jan 2025 20:55:00 GMT"
        },
        {
          "title": "10 things about Abdukodir Khusanov",
          "description": "10 things about Abdukodir Khusanov  OneFootball",
          "date": "Mon, 20 Jan 2025 18:40:22 GMT"
        },
        {
          "title": "What you need to know: New Man City signing Khusanov is 'built to defend'",
          "description": "What you need to know: New Man City signing Khusanov is 'built to defend'  ESPN",
          "date": "Mon, 20 Jan 2025 19:30:58 GMT"
        },
        {
          "title": "Transfer news: Manchester City confirm signing of Uzbekistan defender Abdukodir Khusanov from Lens",
          "description": "Transfer news: Manchester City confirm signing of Uzbekistan defender Abdukodir Khusanov from Lens  Flashscore.com",
          "date": "Mon, 20 Jan 2025 18:33:20 GMT"
        },
        {
          "title": "Abdukodir Khusanov to Manchester City: The Athletic 500 transfer ratings",
          "description": "Abdukodir Khusanov to Manchester City: The Athletic 500 transfer ratings  The Athletic",
          "date": "Mon, 20 Jan 2025 18:33:00 GMT"
        }
      ]
    },
    {
      "player_id": 21090,
      "player_name": "Diego Carlos Santos Silva",
      "trending_score": 77.0,
      "trend_summary": "Diego Carlos, the Brazilian defender, is poised to depart Aston Villa, with Fenerbahce reportedly nearing a verbal agreement for his transfer. The move comes amid speculation that Aston Villa is targeting Loïc Badé of Sevilla as his replacement, as Carlos' exit looms.",
      "news": [
        {
          "title": "Aston Villa reach verbal agreement with Fenerbahce for Diego Carlos transfer",
          "description": "Aston Villa reach verbal agreement with Fenerbahce for Diego Carlos transfer",
          "date": "Mon, 20 Jan 2025 18:17:25 GMT"
        },
        {
          "title": "Aston Villa submit Loïc Badé offer as Diego Carlos exit looms",
          "description": "Aston Villa submit Loïc Badé offer as Diego Carlos exit looms  Yahoo Sports",
          "date": "Mon, 20 Jan 2025 13:37:00 GMT"
        },
        {
          "title": "Aston Villa keen on Sevilla's Loic Bade as Diego Carlos replacement",
          "description": "Aston Villa keen on Sevilla's Loic Bade as Diego Carlos replacement  BeSoccer EN",
          "date": "Mon, 20 Jan 2025 16:16:31 GMT"
        },
        {
          "title": "Goodbye to Sevilla's Dreamed Return",
          "description": "Goodbye to Sevilla's Dreamed Return  fichajes.net",
          "date": "Mon, 20 Jan 2025 16:54:00 GMT"
        },
        {
          "title": "Wolves swoop for Diego Carlos from under Mourinho's nose with £10m bid",
          "description": "Wolves swoop for Diego Carlos from under Mourinho's nose with £10m bid  Daily Mail",
          "date": "Mon, 20 Jan 2025 22:49:39 GMT"
        },
        {
          "title": "Aston Villa going all out to sign Liverpool target after Diego Carlos leaves",
          "description": "Aston Villa going all out to sign Liverpool target after Diego Carlos leaves  TEAMtalk",
          "date": "Mon, 20 Jan 2025 13:54:06 GMT"
        },
        {
          "title": "Aston Villa deal gets Romano ‘here we go’ after Emery CONFIRMS replacement",
          "description": "Aston Villa deal gets Romano ‘here we go’ after Emery CONFIRMS replacement  FootballTransfers",
          "date": "Mon, 20 Jan 2025 11:50:00 GMT"
        },
        {
          "title": "Transfer news and rumours today: Diego Carlos to Fenerbahce, Luis Guilherme to Al-Hilal",
          "description": "Transfer news and rumours today: Diego Carlos to Fenerbahce, Luis Guilherme to Al-Hilal  Sports Mole",
          "date": "Mon, 20 Jan 2025 17:51:00 GMT"
        },
        {
          "title": "Aston Villa transfer news: Diego Carlos deal get Fabrizio Romano ‘here we go’ as Emery CONFIRMS replacement",
          "description": "Aston Villa transfer news: Diego Carlos deal get Fabrizio Romano ‘here we go’ as Emery CONFIRMS replacement  MSN",
          "date": "Mon, 20 Jan 2025 17:06:44 GMT"
        },
        {
          "title": "Transfer news live updates: January window tracker as Manchester City complete Khusanov signing",
          "description": "Transfer news live updates: January window tracker as Manchester City complete Khusanov signing",
          "date": "Mon, 20 Jan 2025 21:59:44 GMT"
        }
      ]
    },
    {
      "player_id": 136723,
      "player_name": "Chukwunonso Tristan Madueke",
      "trending_score": 72.0,
      "trend_summary": "Noni Madueke made a dazzling return to Chelsea's starting lineup, impressing with his performance against Wolves in the Premier League, where he stood out as one of the Blues' top players. Despite scoring a \"stolen\" goal that he later apologized for, Madueke has been tasked by Chelsea boss Enzo Maresca to improve his work rate.",
      "news": [
        {
          "title": "Madueke lauds Chalobah's 'leadership' after 'unbelievable' Chelsea return",
          "description": "Madueke lauds Chalobah's 'leadership' after 'unbelievable' Chelsea return  TNT Sports",
          "date": "Mon, 20 Jan 2025 23:14:00 GMT"
        },
        {
          "title": "‘Jamie, you’re terrible’ – Jamie Carragher brutally tricks Noni Madueke with Thomas Tuchel wind-up...",
          "description": "‘Jamie, you’re terrible’ – Jamie Carragher brutally tricks Noni Madueke with Thomas Tuchel wind-up...  talkSPORT",
          "date": "Mon, 20 Jan 2025 23:09:09 GMT"
        },
        {
          "title": "Chelsea 3-1 Wolves: Noni Madueke stands out",
          "description": "Chelsea 3-1 Wolves: Noni Madueke stands out  BBC.com",
          "date": "Mon, 20 Jan 2025 22:16:52 GMT"
        },
        {
          "title": "Noni Madueke issues apology to Chelsea teammate after 'stolen' goal",
          "description": "Noni Madueke issues apology to Chelsea teammate after 'stolen' goal  Evening Standard",
          "date": "Mon, 20 Jan 2025 23:48:57 GMT"
        },
        {
          "title": "Noni Madueke trolls Chelsea teammate after stealing his goal in Wolves win",
          "description": "Noni Madueke trolls Chelsea teammate after stealing his goal in Wolves win  Metro.co.uk",
          "date": "Mon, 20 Jan 2025 23:32:00 GMT"
        },
        {
          "title": "Chelsea’s Noni Madueke ordered to improve work rate by boss Enzo Maresca",
          "description": "Chelsea’s Noni Madueke ordered to improve work rate by boss Enzo Maresca  The Independent",
          "date": "Mon, 20 Jan 2025 23:40:00 GMT"
        },
        {
          "title": "Chelsea player ratings as Cole Palmer quiet but Noni Madueke turns it on in crucial Wolves win",
          "description": "Chelsea player ratings as Cole Palmer quiet but Noni Madueke turns it on in crucial Wolves win  Football.London",
          "date": "Mon, 20 Jan 2025 22:10:53 GMT"
        },
        {
          "title": "Chelsea 3-1 Wolves: Blues score two second-half goals in five minutes to climb above Man City into fourth... a",
          "description": "Chelsea 3-1 Wolves: Blues score two second-half goals in five minutes to climb above Man City into fourth... a  Daily Mail",
          "date": "Mon, 20 Jan 2025 22:00:40 GMT"
        },
        {
          "title": "Chelsea star apologises to team-mate after Wolves win and shares private chat",
          "description": "Chelsea star apologises to team-mate after Wolves win and shares private chat  Express",
          "date": "Mon, 20 Jan 2025 22:33:00 GMT"
        },
        {
          "title": "Chelsea player ratings vs Wolves: Noni Madueke bright and Trevoh Chalobah superb on return",
          "description": "Chelsea player ratings vs Wolves: Noni Madueke bright and Trevoh Chalobah superb on return  MSN",
          "date": "Mon, 20 Jan 2025 22:38:31 GMT"
        }
      ]
    }
  ]
}