{
  "updated_at": "2025-02-12T00:14:20.079057+00:00",
  "player_news": [
    {
      "player_id": 744,
      "player_name": "Brahim Abdelkader Díaz",
      "trending_score": 100.0,
      "trend_summary": "In a thrilling Champions League encounter, Brahim Díaz scored a crucial equalizer for Real Madrid against Manchester City, bringing the tie to a 2-2 draw at halftime. The Spanish playmaker's goal, assisted by Kylian Mbappé, has given Real Madrid hope of overturning the deficit in the second leg at the Santiago Bernabéu.",
      "news": [
        {
          "title": "Real Madrid's Brahim Diaz Knows The Champions League Tie vs Manchester City Is Far From Over",
          "description": "Real Madrid's Brahim Diaz Knows The Champions League Tie vs Manchester City Is Far From Over  Sports Illustrated",
          "date": "Tue, 11 Feb 2025 23:08:48 GMT"
        },
        {
          "title": "Brahim Díaz: \"We Capitalized Well on Their Mistakes\"",
          "description": "Brahim Díaz: \"We Capitalized Well on Their Mistakes\"  FootBoom",
          "date": "Tue, 11 Feb 2025 23:34:02 GMT"
        },
        {
          "title": "WATCH: Brahim Diaz brings Real Madrid back level again against Manchester City",
          "description": "WATCH: Brahim Diaz brings Real Madrid back level again against Manchester City  Football Espana",
          "date": "Tue, 11 Feb 2025 21:51:20 GMT"
        },
        {
          "title": "Man City vs Real Madrid: Champions League latest result and reaction",
          "description": "Man City vs Real Madrid: Champions League latest result and reaction",
          "date": "Tue, 11 Feb 2025 22:29:21 GMT"
        },
        {
          "title": "Man City 2-3 Real Madrid: Jude Bellingham scores dramatic winner in Champions League thriller",
          "description": "Man City 2-3 Real Madrid: Jude Bellingham scores dramatic winner in Champions League thriller  Metro.co.uk",
          "date": "Tue, 11 Feb 2025 18:16:00 GMT"
        },
        {
          "title": "Manchester City 2 Real Madrid 3: Jude Bellingham’s late, late winner and another City collapse",
          "description": "Manchester City 2 Real Madrid 3: Jude Bellingham’s late, late winner and another City collapse",
          "date": "Tue, 11 Feb 2025 23:59:05 GMT"
        },
        {
          "title": "Man City vs Real Madrid 2-3: UEFA Champions League – as it happened",
          "description": "Man City vs Real Madrid 2-3: UEFA Champions League – as it happened  Al Jazeera English",
          "date": "Tue, 11 Feb 2025 23:37:30 GMT"
        },
        {
          "title": "Man City vs. Real Madrid final score: UEFA Champions League result, stats as Bellingham seals another Man City collapse",
          "description": "Man City vs. Real Madrid final score: UEFA Champions League result, stats as Bellingham seals another Man City collapse  Sporting News",
          "date": "Tue, 11 Feb 2025 22:55:00 GMT"
        },
        {
          "title": "Real Madrid player ratings vs Man City: Los Blancos don't know when they're beaten! Jude Bellingham and Brahim Diaz complete late turnaround as Kylian Mbappe also leaves his mark on Champions League thriller",
          "description": "Real Madrid player ratings vs Man City: Los Blancos don't know when they're beaten! Jude Bellingham and Brahim Diaz complete late turnaround as Kylian Mbappe also leaves his mark on Champions League thriller  Goal Saudi Arabia",
          "date": "Tue, 11 Feb 2025 22:06:17 GMT"
        },
        {
          "title": "Manchester City vs Real Madrid: UEFA Champions League stats & head-to-head",
          "description": "Manchester City vs Real Madrid: UEFA Champions League stats & head-to-head  BBC.com",
          "date": "Tue, 11 Feb 2025 22:23:31 GMT"
        }
      ]
    },
    {
      "player_id": 1100,
      "player_name": "Erling Braut Haaland",
      "trending_score": 26.0,
      "trend_summary": "Erling Haaland's remarkable goal against Real Madrid in the UEFA Champions League highlights his continued dominance, while reports indicate he has rejected a lucrative offer to leave Manchester City, solidifying his status as one of football's most sought-after players.",
      "news": [
        {
          "title": "Report: Erling Haaland has Rejected a ‘Lucrative’ Offer to Leave Man City",
          "description": "Report: Erling Haaland has Rejected a ‘Lucrative’ Offer to Leave Man City  OneFootball",
          "date": "Tue, 11 Feb 2025 16:43:45 GMT"
        },
        {
          "title": "Even Total Haaland cannot stop Manchester City’s continuing nightmare",
          "description": "Even Total Haaland cannot stop Manchester City’s continuing nightmare",
          "date": "Wed, 12 Feb 2025 00:02:00 GMT"
        },
        {
          "title": "Why Erling Haaland's goal against Real Madrid was allowed to stand despite 'offside' claims",
          "description": "Why Erling Haaland's goal against Real Madrid was allowed to stand despite 'offside' claims  SPORTbible",
          "date": "Tue, 11 Feb 2025 21:17:58 GMT"
        },
        {
          "title": "WATCH: Erling Haaland restores Manchester City lead against Real Madrid",
          "description": "WATCH: Erling Haaland restores Manchester City lead against Real Madrid  Football Espana",
          "date": "Tue, 11 Feb 2025 21:41:55 GMT"
        },
        {
          "title": "Man City vs Real Madrid: Merson goes wild in studio as Erling Haaland stuns Madrid",
          "description": "Man City vs Real Madrid: Merson goes wild in studio as Erling Haaland stuns Madrid  Sky Sports",
          "date": "Tue, 11 Feb 2025 20:39:59 GMT"
        },
        {
          "title": "UEFA Champions League 2025 highlights: Manchester City vs Real Madrid, Erling Haaland goal video",
          "description": "UEFA Champions League 2025 highlights: Manchester City vs Real Madrid, Erling Haaland goal video  Wide World of Sports",
          "date": "Tue, 11 Feb 2025 21:43:29 GMT"
        },
        {
          "title": "📈 Erling Haaland joins footballing royalty with strike against Real Madrid",
          "description": "📈 Erling Haaland joins footballing royalty with strike against Real Madrid  OneFootball",
          "date": "Tue, 11 Feb 2025 20:41:28 GMT"
        },
        {
          "title": "Will Erling Haaland Play Tonight in Manchester City vs Real Madrid UEFA Champions League 2024-25 Knockout",
          "description": "Will Erling Haaland Play Tonight in Manchester City vs Real Madrid UEFA Champions League 2024-25 Knockout  LatestLY",
          "date": "Tue, 11 Feb 2025 12:30:01 GMT"
        },
        {
          "title": "Thierry Henry didn't hesitate when choosing between Erling Haaland and Kylian Mbappe",
          "description": "Thierry Henry didn't hesitate when choosing between Erling Haaland and Kylian Mbappe  SPORTbible",
          "date": "Tue, 11 Feb 2025 21:23:11 GMT"
        },
        {
          "title": "Man City 1-1 Real Madrid LIVE: Kylian Mbappe equalises after Erling Haaland hits crossbar in Champions...",
          "description": "Man City 1-1 Real Madrid LIVE: Kylian Mbappe equalises after Erling Haaland hits crossbar in Champions...  talkSPORT",
          "date": "Tue, 11 Feb 2025 21:24:49 GMT"
        }
      ]
    },
    {
      "player_id": 129718,
      "player_name": "Jude Victor William Bellingham",
      "trending_score": 19.0,
      "trend_summary": "In a thrilling Champions League semi-final first leg, Jude Bellingham netted a dramatic stoppage-time winner for Real Madrid, securing a 3-2 victory over Manchester City. The young English midfielder's crucial goal capped a remarkable comeback for the Spanish giants, who had trailed 2-1 with just minutes remaining.",
      "news": [
        {
          "title": "Jude Bellingham Already Has a Staggering Number of Stoppage Time Winners for Real Madrid",
          "description": "Jude Bellingham Already Has a Staggering Number of Stoppage Time Winners for Real Madrid  OneFootball",
          "date": "Tue, 11 Feb 2025 23:13:31 GMT"
        },
        {
          "title": "Man City vs Real Madrid",
          "description": "Man City vs Real Madrid",
          "date": "Tue, 11 Feb 2025 22:02:59 GMT"
        },
        {
          "title": "Jude Bellingham's Late Winner Secures First-Leg Advantage for Real Madrid Against Manchester City",
          "description": "Jude Bellingham's Late Winner Secures First-Leg Advantage for Real Madrid Against Manchester City  FootBoom",
          "date": "Tue, 11 Feb 2025 22:18:04 GMT"
        },
        {
          "title": "Man City vs Real Madrid: Champions League latest result and reaction",
          "description": "Man City vs Real Madrid: Champions League latest result and reaction",
          "date": "Tue, 11 Feb 2025 22:29:21 GMT"
        },
        {
          "title": "\"I'm sure he is intervening\"",
          "description": "\"I'm sure he is intervening\"",
          "date": "Tue, 11 Feb 2025 16:42:17 GMT"
        },
        {
          "title": "Man City 2-3 Real Madrid LIVE REACTION: Bellingham scores last-gasp winner as Citizens collapse in...",
          "description": "Man City 2-3 Real Madrid LIVE REACTION: Bellingham scores last-gasp winner as Citizens collapse in...  talkSPORT",
          "date": "Tue, 11 Feb 2025 22:04:00 GMT"
        },
        {
          "title": "Man City collapse again as Jude Bellingham seals thrilling Real Madrid win",
          "description": "Man City collapse again as Jude Bellingham seals thrilling Real Madrid win",
          "date": "Tue, 11 Feb 2025 22:07:54 GMT"
        },
        {
          "title": "‘Some of our best football of the season’ – Jude Bellingham lauds Real Madrid team-mates after comeback win over Man City",
          "description": "‘Some of our best football of the season’ – Jude Bellingham lauds Real Madrid team-mates after comeback win over Man City  OneFootball",
          "date": "Tue, 11 Feb 2025 22:16:08 GMT"
        },
        {
          "title": "Football: Soccer-Real Madrid's Bellingham nets late winner in 3-2 thriller with Manchester City",
          "description": "Football: Soccer-Real Madrid's Bellingham nets late winner in 3-2 thriller with Manchester City  The Star Online",
          "date": "Tue, 11 Feb 2025 22:17:00 GMT"
        },
        {
          "title": "Fans are just finding out who Jude Bellingham's dad is ahead of Champions League clash vs Man City",
          "description": "Fans are just finding out who Jude Bellingham's dad is ahead of Champions League clash vs Man City  SPORTbible",
          "date": "Tue, 11 Feb 2025 06:30:08 GMT"
        }
      ]
    },
    {
      "player_id": 278,
      "player_name": "Kylian Mbappé Lottin",
      "trending_score": 15.0,
      "trend_summary": "Kylian Mbappé's fortuitous volley equalized for Real Madrid in a thrilling Champions League clash against Manchester City, where he returned to the Etihad Stadium, the birthplace of his European legacy. Off the pitch, PSG's coach has surprisingly claimed the team performs better without the star forward.",
      "news": [
        {
          "title": "Manchester City vs Real Madrid live updates: Mbappe flukes equaliser in Champions League tie after Haaland opener",
          "description": "Manchester City vs Real Madrid live updates: Mbappe flukes equaliser in Champions League tie after Haaland opener  The New York Times",
          "date": "Tue, 11 Feb 2025 19:33:51 GMT"
        },
        {
          "title": "Comparing how long it took Kylian Mbappe to reach 500 goals + assists with Messi and Ronaldo",
          "description": "Comparing how long it took Kylian Mbappe to reach 500 goals + assists with Messi and Ronaldo  MSN",
          "date": "Tue, 11 Feb 2025 17:17:15 GMT"
        },
        {
          "title": "Where to watch Kylian Mbappe in Champions League today: Man City vs. Real Madrid time, live stream",
          "description": "Where to watch Kylian Mbappe in Champions League today: Man City vs. Real Madrid time, live stream  syracuse.com",
          "date": "Tue, 11 Feb 2025 16:01:00 GMT"
        },
        {
          "title": "WATCH: Kylian Mbappe brings Real Madrid back level against Manchester City",
          "description": "WATCH: Kylian Mbappe brings Real Madrid back level against Manchester City  Football Espana",
          "date": "Tue, 11 Feb 2025 21:23:14 GMT"
        },
        {
          "title": "Thierry Henry didn't hesitate when choosing between Erling Haaland and Kylian Mbappe",
          "description": "Thierry Henry didn't hesitate when choosing between Erling Haaland and Kylian Mbappe  SPORTbible",
          "date": "Tue, 11 Feb 2025 21:23:11 GMT"
        },
        {
          "title": "Video: Mbappe scores a fortunate volley to equalize for Real Madrid vs. Man City",
          "description": "Video: Mbappe scores a fortunate volley to equalize for Real Madrid vs. Man City  Bolavip US",
          "date": "Tue, 11 Feb 2025 21:31:36 GMT"
        },
        {
          "title": "PSG Coach Says PSG Are Better Now Without Kylian Mbappe",
          "description": "PSG Coach Says PSG Are Better Now Without Kylian Mbappe  OneFootball",
          "date": "Tue, 11 Feb 2025 18:26:13 GMT"
        },
        {
          "title": "Man City vs Real Madrid",
          "description": "Man City vs Real Madrid",
          "date": "Tue, 11 Feb 2025 21:48:25 GMT"
        },
        {
          "title": "Real Madrid edge Manchester City in thrilling Champions League clash",
          "description": "Real Madrid edge Manchester City in thrilling Champions League clash  The News International",
          "date": "Tue, 11 Feb 2025 22:20:10 GMT"
        },
        {
          "title": "Mbappé Returns to the Ground Where His Legend Began in the Champions League",
          "description": "Mbappé Returns to the Ground Where His Legend Began in the Champions League  FootBoom",
          "date": "Tue, 11 Feb 2025 18:19:08 GMT"
        }
      ]
    },
    {
      "player_id": 341640,
      "player_name": "Raúl Asencio del Rosario",
      "trending_score": 12.0,
      "trend_summary": "Recent news available for Raúl Asencio del Rosario. Please check sports news websites for the latest updates.",
      "news": [
        {
          "title": "Real Madrid player Raul Asencio has his appeal dismissed in sex-tape investigation involving a minor",
          "description": "Real Madrid player Raul Asencio has his appeal dismissed in sex-tape investigation involving a minor",
          "date": "Tue, 11 Feb 2025 17:53:46 GMT"
        },
        {
          "title": "Real Madrid star continues as suspect in child pornography distribution case",
          "description": "Real Madrid star continues as suspect in child pornography distribution case  Yahoo Sports",
          "date": "Tue, 11 Feb 2025 12:08:00 GMT"
        },
        {
          "title": "Asencio appeal nixed in sex abuse investigation",
          "description": "Asencio appeal nixed in sex abuse investigation  ESPN",
          "date": "Tue, 11 Feb 2025 12:56:00 GMT"
        },
        {
          "title": "Real Madrid Star Remains Under Investigation In Child Pornography Case, Reports El Confidencial",
          "description": "Real Madrid Star Remains Under Investigation In Child Pornography Case, Reports El Confidencial  Forbes",
          "date": "Tue, 11 Feb 2025 12:08:36 GMT"
        },
        {
          "title": "Real Madrid star could face prison over explicit video of minor",
          "description": "Real Madrid star could face prison over explicit video of minor  AS USA",
          "date": "Tue, 11 Feb 2025 12:58:37 GMT"
        },
        {
          "title": "Real Madrid defender Raul Asencio sees Spanish court reject appeal in child sex abuse video scandal",
          "description": "Real Madrid defender Raul Asencio sees Spanish court reject appeal in child sex abuse video scandal",
          "date": "Tue, 11 Feb 2025 16:18:42 GMT"
        },
        {
          "title": "Raúl Asencio Will Have a New Release Clause with His Renewal, Fabrizio Announces It",
          "description": "Raúl Asencio Will Have a New Release Clause with His Renewal, Fabrizio Announces It  Real Madrid Confidencial",
          "date": "Tue, 11 Feb 2025 19:50:00 GMT"
        },
        {
          "title": "Court Rejects Asencio's Appeal in Investigation Over Explicit Video",
          "description": "Court Rejects Asencio's Appeal in Investigation Over Explicit Video  FootBoom",
          "date": "Tue, 11 Feb 2025 23:48:29 GMT"
        },
        {
          "title": "Real Madrid player Raúl Asencio still considered a suspect on a child pornography case",
          "description": "Real Madrid player Raúl Asencio still considered a suspect on a child pornography case  Gamereactor UK",
          "date": "Tue, 11 Feb 2025 14:07:14 GMT"
        },
        {
          "title": "Real Madrid defender Raul Asencio investigated in child pornography case and could face up to five years...",
          "description": "Real Madrid defender Raul Asencio investigated in child pornography case and could face up to five years...  The Sun",
          "date": "Tue, 11 Feb 2025 14:42:36 GMT"
        }
      ]
    }
  ]
}