{
  "updated_at": "2025-01-12T23:56:59.981419+00:00",
  "player_news": [
    {
      "player_id": 386828,
      "player_name": "Lamine Yamal Nasraoui Ebana",
      "trending_score": 100.0,
      "trend_summary": "Barcelona's Lamine Yamal has emerged as a rising star after scoring a stunning equalizer in the Supercopa final against Real Madrid, leading his team to a historic 5-2 triumph. The 19-year-old midfielder's performance has drawn comparisons to Lionel Messi and earned him praise from teammate Robert Lewandowski, who believes Yamal has the potential for future greatness.",
      "news": [
        {
          "title": "Real Madrid 2 Barcelona 5: Lamine Yamal and Co inflict a historic humiliation",
          "description": "Real Madrid 2 Barcelona 5: Lamine Yamal and Co inflict a historic humiliation",
          "date": "Sun, 12 Jan 2025 23:01:00 GMT"
        },
        {
          "title": "(WATCH) Lamine Yamal fires instant Barcelona Supercup equaliser",
          "description": "(WATCH) Lamine Yamal fires instant Barcelona Supercup equaliser  Yahoo Sports",
          "date": "Sun, 12 Jan 2025 19:35:00 GMT"
        },
        {
          "title": "Barca score four in first half to trounce Real in Supercopa final – updates",
          "description": "Barca score four in first half to trounce Real in Supercopa final – updates  Al Jazeera English",
          "date": "Sun, 12 Jan 2025 22:29:06 GMT"
        },
        {
          "title": "SUPERCUP: Spectacular 'Messianic' goal by Lamine Yamal to equalize the final",
          "description": "SUPERCUP: Spectacular 'Messianic' goal by Lamine Yamal to equalize the final  FC Barcelona Noticias",
          "date": "Sun, 12 Jan 2025 20:29:00 GMT"
        },
        {
          "title": "Lamine Yamal Channels His Inner Messi",
          "description": "Lamine Yamal Channels His Inner Messi  FootBoom",
          "date": "Sun, 12 Jan 2025 20:05:43 GMT"
        },
        {
          "title": "Real Madrid vs. Barcelona final score: Spanish Super Cup final result, stats 10-man Barca win astonishing Clasico Supercopa final",
          "description": "Real Madrid vs. Barcelona final score: Spanish Super Cup final result, stats 10-man Barca win astonishing Clasico Supercopa final  Sporting News",
          "date": "Sun, 12 Jan 2025 21:04:03 GMT"
        },
        {
          "title": "Ballon D'Or: Robert Lewandowski Backs Barcelona Teammate Lamine Yamal For Future Glory",
          "description": "Ballon D'Or: Robert Lewandowski Backs Barcelona Teammate Lamine Yamal For Future Glory  Outlook India",
          "date": "Sun, 12 Jan 2025 11:39:13 GMT"
        },
        {
          "title": "Real Madrid vs Barcelona Highlights, Spanish Super Cup 2025 Final: Five-star FC Barcelona Smash Real Madrid To Clinch Spanish Super Cup Title",
          "description": "Real Madrid vs Barcelona Highlights, Spanish Super Cup 2025 Final: Five-star FC Barcelona Smash Real Madrid To Clinch Spanish Super Cup Title  NDTV Sports",
          "date": "Sun, 12 Jan 2025 21:13:09 GMT"
        },
        {
          "title": "Barcelona hand Real Madrid latest El Clasico hammering in Supercopa final",
          "description": "Barcelona hand Real Madrid latest El Clasico hammering in Supercopa final  Al Jazeera English",
          "date": "Sun, 12 Jan 2025 22:28:18 GMT"
        },
        {
          "title": "\"We suddenly started to suffer\"",
          "description": "\"We suddenly started to suffer\"",
          "date": "Sun, 12 Jan 2025 09:50:00 GMT"
        }
      ]
    },
    {
      "player_id": 851,
      "player_name": "Wojciech Tomasz Szczęsny",
      "trending_score": 89.0,
      "trend_summary": "Wojciech Szczęsny's red card in the Supercopa de España final against Barcelona has sparked controversy, with some questioning the decision while others believe it was justified. The Polish goalkeeper's dismissal allowed Barcelona to secure a 5-2 victory and their first trophy of the Hansi Flick era.",
      "news": [
        {
          "title": "Hansi Flick makes Wojciech Szczesny starting point over Supercup selection",
          "description": "Hansi Flick makes Wojciech Szczesny starting point over Supercup selection  Yahoo Sports",
          "date": "Sun, 12 Jan 2025 18:54:00 GMT"
        },
        {
          "title": "Barca score four in first half to trounce Real in Supercopa final – updates",
          "description": "Barca score four in first half to trounce Real in Supercopa final – updates  Al Jazeera English",
          "date": "Sun, 12 Jan 2025 22:29:06 GMT"
        },
        {
          "title": "Szczesny's red card against Real Madrid 'resolves' the Barça debate",
          "description": "Szczesny's red card against Real Madrid 'resolves' the Barça debate  FC Barcelona Noticias",
          "date": "Sun, 12 Jan 2025 22:09:00 GMT"
        },
        {
          "title": "WATCH",
          "description": "WATCH",
          "date": "Sun, 12 Jan 2025 20:37:30 GMT"
        },
        {
          "title": "Real Madrid 2 Barcelona 5: Lamine Yamal and Co inflict a historic humiliation",
          "description": "Real Madrid 2 Barcelona 5: Lamine Yamal and Co inflict a historic humiliation",
          "date": "Sun, 12 Jan 2025 23:01:00 GMT"
        },
        {
          "title": "Real Madrid vs. Barcelona final score: Spanish Super Cup final result, stats 10-man Barca win astonishing Clasico Supercopa final",
          "description": "Real Madrid vs. Barcelona final score: Spanish Super Cup final result, stats 10-man Barca win astonishing Clasico Supercopa final  Sporting News",
          "date": "Sun, 12 Jan 2025 21:04:03 GMT"
        },
        {
          "title": "Szczesny implicates Barcelona in El Clásico",
          "description": "Szczesny implicates Barcelona in El Clásico  Yalla Shoot",
          "date": "Sun, 12 Jan 2025 20:42:15 GMT"
        },
        {
          "title": "First Title of the Flick Era with a Rout Against Madrid",
          "description": "First Title of the Flick Era with a Rout Against Madrid  FootBoom",
          "date": "Sun, 12 Jan 2025 22:49:34 GMT"
        },
        {
          "title": "Real Madrid 2-5 Barcelona: Player ratings as Raphinha stars in Clasico thumping",
          "description": "Real Madrid 2-5 Barcelona: Player ratings as Raphinha stars in Clasico thumping  90min UK",
          "date": "Sun, 12 Jan 2025 21:09:39 GMT"
        },
        {
          "title": "Can Real Madrid Seize Revenge? Barcelona's Title Hopes Hang in the Balance!",
          "description": "Can Real Madrid Seize Revenge? Barcelona's Title Hopes Hang in the Balance!  Qhubo",
          "date": "Sun, 12 Jan 2025 19:01:09 GMT"
        }
      ]
    },
    {
      "player_id": 521,
      "player_name": "Robert Lewandowski",
      "trending_score": 68.0,
      "trend_summary": "Robert Lewandowski's brace and Raphinha's goal powered Barcelona to a commanding victory over Real Madrid in the Spanish Super Cup final, securing the club's first trophy under Xavi. Despite Bayern Munich's interest in finding a successor for Lewandowski, the Polish striker remains focused on Barcelona's future, backing teammate Lamine Yamal for potential greatness.",
      "news": [
        {
          "title": "(WATCH) Robert Lewandowski and Raphinha put Barcelona in Supercup control",
          "description": "(WATCH) Robert Lewandowski and Raphinha put Barcelona in Supercup control  Yahoo Sports",
          "date": "Sun, 12 Jan 2025 19:49:00 GMT"
        },
        {
          "title": "Barcelona thump Clasico rivals Real Madrid to win Spanish Super Cup",
          "description": "Barcelona thump Clasico rivals Real Madrid to win Spanish Super Cup  FRANCE 24 English",
          "date": "Sun, 12 Jan 2025 21:17:11 GMT"
        },
        {
          "title": "Barca score four in first half to trounce Real in Supercopa final – updates",
          "description": "Barca score four in first half to trounce Real in Supercopa final – updates  Al Jazeera English",
          "date": "Sun, 12 Jan 2025 22:29:06 GMT"
        },
        {
          "title": "La Liga top goal scorers 2024/25: Updated Golden Boot rankings in Spain as Lewandowski leads Pichichi chase",
          "description": "La Liga top goal scorers 2024/25: Updated Golden Boot rankings in Spain as Lewandowski leads Pichichi chase  Sporting News",
          "date": "Sun, 12 Jan 2025 17:00:00 GMT"
        },
        {
          "title": "Bayern Munich star didn't hesitate when asked who's 'easier' to play with between Harry Kane and Robert Lewandowski",
          "description": "Bayern Munich star didn't hesitate when asked who's 'easier' to play with between Harry Kane and Robert Lewandowski  SPORTbible",
          "date": "Sun, 12 Jan 2025 13:39:42 GMT"
        },
        {
          "title": "Barcelona continuing to focus on finding Robert Lewandowski successor",
          "description": "Barcelona continuing to focus on finding Robert Lewandowski successor  90min UK",
          "date": "Sun, 12 Jan 2025 11:35:00 GMT"
        },
        {
          "title": "Ballon D'Or: Robert Lewandowski Backs Barcelona Teammate Lamine Yamal For Future Glory",
          "description": "Ballon D'Or: Robert Lewandowski Backs Barcelona Teammate Lamine Yamal For Future Glory  Outlook India",
          "date": "Sun, 12 Jan 2025 11:39:13 GMT"
        },
        {
          "title": "Unexpected Twist — Lewandowski Finds out the Latest News at Barça: Surprise Departure",
          "description": "Unexpected Twist — Lewandowski Finds out the Latest News at Barça: Surprise Departure  Madrid-Barcelona.com",
          "date": "Sun, 12 Jan 2025 15:00:00 GMT"
        },
        {
          "title": "Bayern star Kingsley Coman reveals difference between playing with Harry Kane & Robert Lewandowski",
          "description": "Bayern star Kingsley Coman reveals difference between playing with Harry Kane & Robert Lewandowski  Khel Now",
          "date": "Sun, 12 Jan 2025 15:00:25 GMT"
        },
        {
          "title": "Real Madrid vs Barcelona Spanish Super Cup 2025: Robert Lewandowski Expects Barca to Beat Los Blancos in",
          "description": "Real Madrid vs Barcelona Spanish Super Cup 2025: Robert Lewandowski Expects Barca to Beat Los Blancos in  LatestLY",
          "date": "Sun, 12 Jan 2025 03:00:50 GMT"
        }
      ]
    },
    {
      "player_id": 50132,
      "player_name": "Altay Bayındır",
      "trending_score": 58.0,
      "trend_summary": "In a thrilling FA Cup clash, Turkish goalkeeper Altay Bayındır emerged as Manchester United's hero, saving a crucial penalty in a shootout victory over Arsenal. The 24-year-old's heroics helped United advance to the next round despite playing with 10 men for much of the match.",
      "news": [
        {
          "title": "Man Utd news: Altay Bayindir after FA Cup victory",
          "description": "Man Utd news: Altay Bayindir after FA Cup victory  BBC.com",
          "date": "Sun, 12 Jan 2025 18:12:32 GMT"
        },
        {
          "title": "Manchester United's Ruben Amorim on Altay Bayindir, Marcus Rashford, FA Cup win at Arsenal",
          "description": "Manchester United's Ruben Amorim on Altay Bayindir, Marcus Rashford, FA Cup win at Arsenal  NBC Sports",
          "date": "Sun, 12 Jan 2025 19:07:30 GMT"
        },
        {
          "title": "\"I just want to help everyone\"",
          "description": "\"I just want to help everyone\"",
          "date": "Sun, 12 Jan 2025 19:12:00 GMT"
        },
        {
          "title": "Altay Bayindir is penalty shoot-out hero as Man United beat Arsenal in FA Cup",
          "description": "Altay Bayindir is penalty shoot-out hero as Man United beat Arsenal in FA Cup  The National",
          "date": "Sun, 12 Jan 2025 19:18:45 GMT"
        },
        {
          "title": "FA Cup: 10-man Manchester United, Bayindir dump Arsenal out on penalties",
          "description": "FA Cup: 10-man Manchester United, Bayindir dump Arsenal out on penalties  India Today",
          "date": "Sun, 12 Jan 2025 18:07:00 GMT"
        },
        {
          "title": "Joshua Zirkzee sends four-word message to Altay Bayindir after Man United’s victory over Arsenal",
          "description": "Joshua Zirkzee sends four-word message to Altay Bayindir after Man United’s victory over Arsenal  TBR Football",
          "date": "Sun, 12 Jan 2025 20:38:25 GMT"
        },
        {
          "title": "Altay Bayindir: Turkish goalkeeper becomes Manchester United 'hero' in FA Cup win at Arsenal",
          "description": "Altay Bayindir: Turkish goalkeeper becomes Manchester United 'hero' in FA Cup win at Arsenal  BBC.com",
          "date": "Sun, 12 Jan 2025 20:34:13 GMT"
        },
        {
          "title": "Arsenal 1-1 Man Utd (3-5 pens): Altay Bayindir saves from Kai Havertz in penalty shoot-out as 10-player FA Cup holders progress",
          "description": "Arsenal 1-1 Man Utd (3-5 pens): Altay Bayindir saves from Kai Havertz in penalty shoot-out as 10-player FA Cup holders progress  Sky Sports",
          "date": "Sun, 12 Jan 2025 21:48:28 GMT"
        },
        {
          "title": "Altay Bayindir the hero as 10-man Manchester United see off Arsenal in FA Cup third round",
          "description": "Altay Bayindir the hero as 10-man Manchester United see off Arsenal in FA Cup third round  OneFootball",
          "date": "Sun, 12 Jan 2025 18:50:57 GMT"
        },
        {
          "title": "Manchester United player ratings vs Arsenal: Altay Bayindir the FA Cup hero with crucial penalty saves",
          "description": "Manchester United player ratings vs Arsenal: Altay Bayindir the FA Cup hero with crucial penalty saves  Evening Standard",
          "date": "Sun, 12 Jan 2025 18:10:24 GMT"
        }
      ]
    },
    {
      "player_id": 1496,
      "player_name": "Raphael Dias Belloli",
      "trending_score": 31.0,
      "trend_summary": "In the Spanish Super Cup final, Raphinha emerged as the star for Barcelona, netting two goals and adding an assist in their 5-2 triumph over Real Madrid. The Brazilian's stellar performance earned him the title of \"man of the match\" and has sparked comparisons to Barcelona legend Lionel Messi.",
      "news": [
        {
          "title": "Real Madrid 2-5 FC Barcelona: summary, score, goals, highlights",
          "description": "Real Madrid 2-5 FC Barcelona: summary, score, goals, highlights",
          "date": "Sun, 12 Jan 2025 21:42:14 GMT"
        },
        {
          "title": "‘O Rei’ Raphinha, man of the match in the final",
          "description": "‘O Rei’ Raphinha, man of the match in the final  FC Barcelona",
          "date": "Sun, 12 Jan 2025 22:12:18 GMT"
        },
        {
          "title": "Super Captain! Raphinha led Barça's 'hand' against Madrid with a brace and an assist",
          "description": "Super Captain! Raphinha led Barça's 'hand' against Madrid with a brace and an assist  FC Barcelona Noticias",
          "date": "Sun, 12 Jan 2025 21:54:00 GMT"
        },
        {
          "title": "LIVE: Real Madrid vs Barcelona – Supercopa final",
          "description": "LIVE: Real Madrid vs Barcelona – Supercopa final  Al Jazeera English",
          "date": "Sun, 12 Jan 2025 16:52:47 GMT"
        },
        {
          "title": "Raphinha scores brace as five-star Barcelona thrash Real Madrid to win Super Cup in style",
          "description": "Raphinha scores brace as five-star Barcelona thrash Real Madrid to win Super Cup in style  Flashscore.com",
          "date": "Sun, 12 Jan 2025 21:14:48 GMT"
        },
        {
          "title": "Raphinha prevents Kylian Mbappe from receiving treatment in bizarre incident before goal...",
          "description": "Raphinha prevents Kylian Mbappe from receiving treatment in bizarre incident before goal...  talkSPORT",
          "date": "Sun, 12 Jan 2025 20:28:54 GMT"
        },
        {
          "title": "\"Ultimate big game player\", \"Easily better than Vinicius this season\"",
          "description": "\"Ultimate big game player\", \"Easily better than Vinicius this season\"",
          "date": "Sun, 12 Jan 2025 21:54:00 GMT"
        },
        {
          "title": "Five star Barcelona stun Real Madrid in Supercup final victory",
          "description": "Five star Barcelona stun Real Madrid in Supercup final victory  Football Espana",
          "date": "Sun, 12 Jan 2025 21:02:43 GMT"
        },
        {
          "title": "Barcelona player ratings vs Real Madrid: Raphinha is a REAL Ballon d'Or contender! Brilliant Brazilian inspires brutal Spanish Super Cup final romp as Lamine Yamal continues to look every inch Lionel Messi's heir",
          "description": "Barcelona player ratings vs Real Madrid: Raphinha is a REAL Ballon d'Or contender! Brilliant Brazilian inspires brutal Spanish Super Cup final romp as Lamine Yamal continues to look every inch Lionel Messi's heir  Goal.com",
          "date": "Sun, 12 Jan 2025 21:11:47 GMT"
        },
        {
          "title": "Real Madrid vs Barcelona LIVE score, Spanish Super Cup final: RMA 2-5 FCB; Szczesny sees red",
          "description": "Real Madrid vs Barcelona LIVE score, Spanish Super Cup final: RMA 2-5 FCB; Szczesny sees red  Sportstar",
          "date": "Sun, 12 Jan 2025 21:00:00 GMT"
        }
      ]
    }
  ]
}