{
  "updated_at": "2025-01-14T23:50:12.481307+00:00",
  "player_news": [
    {
      "player_id": 18931,
      "player_name": "Christopher Grant Wood",
      "trending_score": 100.0,
      "trend_summary": "Chris Wood's impressive form continued as he netted his second goal in as many games, helping Nottingham Forest secure a thrilling 1-1 draw against Liverpool in the English Premier League. The New Zealand captain's strike gave Forest an early lead, but Diogo Jota equalized for Liverpool with his first touch after coming off the bench.",
      "news": [
        {
          "title": "Nottingham Forest vs Liverpool LIVE: Result and reaction as Forest hold on for thrilling draw",
          "description": "Nottingham Forest vs Liverpool LIVE: Result and reaction as Forest hold on for thrilling draw  Yahoo Sports",
          "date": "Tue, 14 Jan 2025 22:06:50 GMT"
        },
        {
          "title": "Nottingham Forest vs Liverpool 1-1: English Premier League – as it happened",
          "description": "Nottingham Forest vs Liverpool 1-1: English Premier League – as it happened  Al Jazeera English",
          "date": "Tue, 14 Jan 2025 23:28:19 GMT"
        },
        {
          "title": "Nottingham Forest vs Liverpool live updates: Visitors equalise with Jota's goal in Premier League match",
          "description": "Nottingham Forest vs Liverpool live updates: Visitors equalise with Jota's goal in Premier League match",
          "date": "Tue, 14 Jan 2025 18:49:11 GMT"
        },
        {
          "title": "All Whites captain Chris Wood scores again as Forest move into second place",
          "description": "All Whites captain Chris Wood scores again as Forest move into second place  Friends of Football",
          "date": "Tue, 14 Jan 2025 22:06:08 GMT"
        },
        {
          "title": "📊 Chris Wood bags again as magical Forest run continues",
          "description": "📊 Chris Wood bags again as magical Forest run continues  OneFootball",
          "date": "Tue, 14 Jan 2025 18:17:05 GMT"
        },
        {
          "title": "Nottingham Forest 1-1 Liverpool: Diogo Jota equalised with first touch but Chris Wood goal takes Forest second",
          "description": "Nottingham Forest 1-1 Liverpool: Diogo Jota equalised with first touch but Chris Wood goal takes Forest second  Sky Sports",
          "date": "Tue, 14 Jan 2025 23:15:00 GMT"
        },
        {
          "title": "Jota rises to peg back Nottingham Forest after Wood gives Liverpool early scare",
          "description": "Jota rises to peg back Nottingham Forest after Wood gives Liverpool early scare  The Guardian",
          "date": "Tue, 14 Jan 2025 23:16:00 GMT"
        },
        {
          "title": "Chris Wood scores again as high flying Forest draw with Liverpool",
          "description": "Chris Wood scores again as high flying Forest draw with Liverpool  1News",
          "date": "Tue, 14 Jan 2025 22:59:48 GMT"
        },
        {
          "title": "Chris Wood’s rise to stardom: From New Zealand roots to Nottingham Forest hero",
          "description": "Chris Wood’s rise to stardom: From New Zealand roots to Nottingham Forest hero  Nogomania",
          "date": "Tue, 14 Jan 2025 20:18:05 GMT"
        },
        {
          "title": "This was a scare for Liverpool at the most intoxicating and beguiling place to watch Premier League football,",
          "description": "This was a scare for Liverpool at the most intoxicating and beguiling place to watch Premier League football,  Daily Mail",
          "date": "Tue, 14 Jan 2025 22:01:46 GMT"
        }
      ]
    },
    {
      "player_id": 2919,
      "player_name": "Matz Willy Els Sels",
      "trending_score": 90.0,
      "trend_summary": "In a thrilling Premier League encounter, Nottingham Forest goalkeeper Matz Sels played a pivotal role in his team's 1-1 draw against Liverpool, showcasing his exceptional shot-stopping abilities and earning praise from manager Nuno Espirito Santo. Sels' performance contributed to Forest's impressive rise to second place in the league standings, as they continue to challenge for European qualification.",
      "news": [
        {
          "title": "Nottingham Forest vs Liverpool 1-1: English Premier League – as it happened",
          "description": "Nottingham Forest vs Liverpool 1-1: English Premier League – as it happened  Al Jazeera English",
          "date": "Tue, 14 Jan 2025 23:28:19 GMT"
        },
        {
          "title": "Forest not discussing Premier League title chances, says goalkeeping hero Sels",
          "description": "Forest not discussing Premier League title chances, says goalkeeping hero Sels  FotMob",
          "date": "Tue, 14 Jan 2025 23:34:46 GMT"
        },
        {
          "title": "Nottingham Forest 1-1 Liverpool: Diogo Jota equalised with first touch but Chris Wood goal takes Forest second",
          "description": "Nottingham Forest 1-1 Liverpool: Diogo Jota equalised with first touch but Chris Wood goal takes Forest second  Sky Sports",
          "date": "Tue, 14 Jan 2025 23:15:00 GMT"
        },
        {
          "title": "Liverpool held by Nottingham Forest in thrilling title race clash",
          "description": "Liverpool held by Nottingham Forest in thrilling title race clash  Evening Standard",
          "date": "Tue, 14 Jan 2025 22:02:38 GMT"
        },
        {
          "title": "Nottingham Forest 1-1 Liverpool: Nuno Espirito Santo praises goalkeeper Matz Sels",
          "description": "Nottingham Forest 1-1 Liverpool: Nuno Espirito Santo praises goalkeeper Matz Sels  BBC",
          "date": "Tue, 14 Jan 2025 23:14:17 GMT"
        },
        {
          "title": "Nottingham Forest vs. Liverpool live score: Premier League result, updates, stats as Wood fires hosts in front",
          "description": "Nottingham Forest vs. Liverpool live score: Premier League result, updates, stats as Wood fires hosts in front  Sporting News",
          "date": "Tue, 14 Jan 2025 20:47:00 GMT"
        },
        {
          "title": "Nottingham Forest draw with Liverpool in Premier League thriller",
          "description": "Nottingham Forest draw with Liverpool in Premier League thriller",
          "date": "Tue, 14 Jan 2025 22:59:00 GMT"
        },
        {
          "title": "Nottingham Forest hold Liverpool as Reds miss chance to extend lead",
          "description": "Nottingham Forest hold Liverpool as Reds miss chance to extend lead",
          "date": "Tue, 14 Jan 2025 21:55:00 GMT"
        },
        {
          "title": "Jota earns Liverpool 1-1 draw at high-flying Forest",
          "description": "Jota earns Liverpool 1-1 draw at high-flying Forest  The Straits Times",
          "date": "Tue, 14 Jan 2025 22:08:47 GMT"
        },
        {
          "title": "Nottingham Forest 1-1 Liverpool: Player ratings as super sub Jota saves Reds",
          "description": "Nottingham Forest 1-1 Liverpool: Player ratings as super sub Jota saves Reds  90min UK",
          "date": "Tue, 14 Jan 2025 22:04:49 GMT"
        }
      ]
    },
    {
      "player_id": 21104,
      "player_name": "Randal Kolo Muani",
      "trending_score": 88.0,
      "trend_summary": "Randal Kolo Muani, a sought-after striker from PSG, has been the subject of intense transfer speculation, with Juventus reportedly reaching a loan agreement and Tottenham Hotspur persisting in their pursuit. The French forward has also attracted interest from Manchester United, but it is believed he has narrowed his options down to two clubs.",
      "news": [
        {
          "title": "Juventus reach loan agreement with PSG for Randal Kolo Muani",
          "description": "Juventus reach loan agreement with PSG for Randal Kolo Muani  Get French Football News",
          "date": "Tue, 14 Jan 2025 18:19:22 GMT"
        },
        {
          "title": "Tottenham persist in pursuit of Randal Kolo Muani – Is he truly the right fit?",
          "description": "Tottenham persist in pursuit of Randal Kolo Muani – Is he truly the right fit?  OneFootball",
          "date": "Tue, 14 Jan 2025 19:37:32 GMT"
        },
        {
          "title": "Report: ‘He will have to choose’ – Kolo Muani’s interest down to final two clubs",
          "description": "Report: ‘He will have to choose’ – Kolo Muani’s interest down to final two clubs  CaughtOffside",
          "date": "Tue, 14 Jan 2025 20:32:16 GMT"
        },
        {
          "title": "Juventus agree loan formula with PSG for Kolo Muani",
          "description": "Juventus agree loan formula with PSG for Kolo Muani  Football Italia",
          "date": "Tue, 14 Jan 2025 16:56:37 GMT"
        },
        {
          "title": "Randal Kolo Muani makes decision over Man Utd and Spurs as PSG agree transfer",
          "description": "Randal Kolo Muani makes decision over Man Utd and Spurs as PSG agree transfer  Metro.co.uk",
          "date": "Tue, 14 Jan 2025 20:35:00 GMT"
        },
        {
          "title": "CLOSED: Randal Kolo Muani has a new team",
          "description": "CLOSED: Randal Kolo Muani has a new team  fichajes.net",
          "date": "Tue, 14 Jan 2025 19:47:13 GMT"
        },
        {
          "title": "Tottenham door opened for Kolo Muani transfer as huge January decision awaits",
          "description": "Tottenham door opened for Kolo Muani transfer as huge January decision awaits  Football.London",
          "date": "Tue, 14 Jan 2025 18:37:49 GMT"
        },
        {
          "title": "Tottenham could actually sign £20m striker instead of Randal Kolo Muani",
          "description": "Tottenham could actually sign £20m striker instead of Randal Kolo Muani  TBR Football",
          "date": "Tue, 14 Jan 2025 18:15:00 GMT"
        },
        {
          "title": "Tottenham submit offer for PSG’s Randal Kolo Muani",
          "description": "Tottenham submit offer for PSG’s Randal Kolo Muani  Get French Football News",
          "date": "Tue, 14 Jan 2025 11:07:47 GMT"
        },
        {
          "title": "Done deal: Juventus reach Kolo Muani agreement and book medicals for PSG striker",
          "description": "Done deal: Juventus reach Kolo Muani agreement and book medicals for PSG striker  Football Italia",
          "date": "Tue, 14 Jan 2025 20:02:24 GMT"
        }
      ]
    },
    {
      "player_id": 1809,
      "player_name": "Lucas Silva Melo",
      "trending_score": 73.0,
      "trend_summary": "In the Bundesliga, Tuta's Eintracht Frankfurt faces off against Freiburg, with previous stats indicating a competitive matchup. Meanwhile, the young defender is attracting interest from Arsenal and Liverpool, as the Greek football revolution continues to produce rising stars.",
      "news": [
        {
          "title": "Eintracht Fr. vs Friburgo: previous stats",
          "description": "Eintracht Fr. vs Friburgo: previous stats",
          "date": "Tue, 14 Jan 2025 01:31:09 GMT"
        },
        {
          "title": "Greek football revolution: Olympiacos’ rising stars Christos Mouzakitis and Charalampos Kostoulas attract Arsenal and Liverpool",
          "description": "Greek football revolution: Olympiacos’ rising stars Christos Mouzakitis and Charalampos Kostoulas attract Arsenal and Liverpool  Nogomania",
          "date": "Tue, 14 Jan 2025 10:16:37 GMT"
        }
      ]
    },
    {
      "player_id": 47315,
      "player_name": "Martín Zubimendi Ibáñez",
      "trending_score": 72.0,
      "trend_summary": "Arsenal have reportedly finalized a £51 million deal to acquire highly sought-after midfielder Martín Zubimendi from Real Sociedad, edging out Liverpool for his signature. The Spanish international, hailed as \"the best midfielder in La Liga,\" is set to join the Gunners in the summer transfer window.",
      "news": [
        {
          "title": "Arsenal set to sign £51m Martin Zubimendi from Real Sociedad, with deal virtually completed to beat Liverpool",
          "description": "Arsenal set to sign £51m Martin Zubimendi from Real Sociedad, with deal virtually completed to beat Liverpool  Daily Mail",
          "date": "Tue, 14 Jan 2025 12:00:26 GMT"
        },
        {
          "title": "Nobody Wins Big As Martín Zubimendi Drifts Towards Arsenal",
          "description": "Nobody Wins Big As Martín Zubimendi Drifts Towards Arsenal  Forbes",
          "date": "Tue, 14 Jan 2025 19:11:46 GMT"
        },
        {
          "title": "Arsenal have “virtually completed” deal for Liverpool target Martin Zubimendi",
          "description": "Arsenal have “virtually completed” deal for Liverpool target Martin Zubimendi  This Is Anfield",
          "date": "Tue, 14 Jan 2025 12:37:14 GMT"
        },
        {
          "title": "Arsenal confident of Zubimendi deal in summer and confirm Jesus ACL injury",
          "description": "Arsenal confident of Zubimendi deal in summer and confirm Jesus ACL injury  The Guardian",
          "date": "Tue, 14 Jan 2025 17:34:00 GMT"
        },
        {
          "title": "Arsenal news: How Mikel Arteta will line up with Martin Zubimendi",
          "description": "Arsenal news: How Mikel Arteta will line up with Martin Zubimendi  FootballTransfers",
          "date": "Tue, 14 Jan 2025 19:25:00 GMT"
        },
        {
          "title": "What Ian Wright has said about Martin Zubimendi as Arsenal agree £50.5m deal with Real Sociedad",
          "description": "What Ian Wright has said about Martin Zubimendi as Arsenal agree £50.5m deal with Real Sociedad  TBR Football",
          "date": "Tue, 14 Jan 2025 12:45:00 GMT"
        },
        {
          "title": "'Best midfielder in La Liga'",
          "description": "'Best midfielder in La Liga'",
          "date": "Tue, 14 Jan 2025 12:36:00 GMT"
        },
        {
          "title": "Arsenal outpace Liverpool to secure Martín Zubimendi in summer transfer deal -Reports",
          "description": "Arsenal outpace Liverpool to secure Martín Zubimendi in summer transfer deal -Reports  News9 LIVE",
          "date": "Tue, 14 Jan 2025 16:34:20 GMT"
        },
        {
          "title": "Unexpected: Arsenal close to signing Martín Zubimendi",
          "description": "Unexpected: Arsenal close to signing Martín Zubimendi  DailySports",
          "date": "Tue, 14 Jan 2025 13:14:50 GMT"
        }
      ]
    }
  ]
}