{
  "updated_at": "2025-02-09T12:17:01.801358+00:00",
  "player_news": [
    {
      "player_id": 6009,
      "player_name": "Julián Álvarez",
      "trending_score": 100.0,
      "trend_summary": "In the highly anticipated Madrid derby, Julián Álvarez made a significant impact, scoring a stunning goal that silenced the Santiago Bernabéu crowd and helped Atlético Madrid secure a 1-1 draw with Real Madrid. The Argentine forward's impressive performance in the Champions League and La Liga has sparked rumors of a potential transfer, with several top clubs reportedly interested in acquiring his services.",
      "news": [
        {
          "title": "Ancelotti on VAR pen: 'Football people' confused",
          "description": "Ancelotti on VAR pen: 'Football people' confused  ESPN",
          "date": "Sat, 08 Feb 2025 23:16:00 GMT"
        },
        {
          "title": "Kylian Mbappe, Julian Alvarez score as Madrid derby ends in 1-1 draw",
          "description": "Kylian Mbappe, Julian Alvarez score as Madrid derby ends in 1-1 draw  Inquirer.net",
          "date": "Sun, 09 Feb 2025 10:17:00 GMT"
        },
        {
          "title": "Julian Alvarez has hit the ground running at Atletico Madrid – and just kept on running",
          "description": "Julian Alvarez has hit the ground running at Atletico Madrid – and just kept on running",
          "date": "Sat, 08 Feb 2025 12:34:45 GMT"
        },
        {
          "title": "Mbappé, Álvarez score as Madrid derby ends 1-1",
          "description": "Mbappé, Álvarez score as Madrid derby ends 1-1  Jamaica Gleaner",
          "date": "Sun, 09 Feb 2025 05:15:26 GMT"
        },
        {
          "title": "Mbappé fires equaliser as Real and Atlético share spoils in Madrid derby",
          "description": "Mbappé fires equaliser as Real and Atlético share spoils in Madrid derby  The Guardian",
          "date": "Sat, 08 Feb 2025 22:39:00 GMT"
        },
        {
          "title": "Julián Álvárez's Stunning Goal Silences Santiago Bernabéu",
          "description": "Julián Álvárez's Stunning Goal Silences Santiago Bernabéu  FootBoom",
          "date": "Sat, 08 Feb 2025 22:02:30 GMT"
        },
        {
          "title": "(VIDEO) All Goals from Real Madrid vs Atlético de Madrid",
          "description": "(VIDEO) All Goals from Real Madrid vs Atlético de Madrid  beIN SPORTS",
          "date": "Sat, 08 Feb 2025 21:53:17 GMT"
        },
        {
          "title": "WATCH: Atletico Madrid strike first blow in Madrid derby from the penalty spot",
          "description": "WATCH: Atletico Madrid strike first blow in Madrid derby from the penalty spot  Football Espana",
          "date": "Sat, 08 Feb 2025 20:41:18 GMT"
        },
        {
          "title": "Three questions and three answers from Real Madrid 1-1 Atlético Madrid",
          "description": "Three questions and three answers from Real Madrid 1-1 Atlético Madrid  Managing Madrid",
          "date": "Sat, 08 Feb 2025 21:58:13 GMT"
        },
        {
          "title": "Titans Clash: Mbappé and Julián Álvarez Face Off in Madrid Derby",
          "description": "Titans Clash: Mbappé and Julián Álvarez Face Off in Madrid Derby  FootBoom",
          "date": "Sat, 08 Feb 2025 17:04:02 GMT"
        }
      ]
    },
    {
      "player_id": 278,
      "player_name": "Kylian Mbappé Lottin",
      "trending_score": 99.0,
      "trend_summary": "Kylian Mbappé's late equalizer rescued Real Madrid from a disappointing draw against rivals Atlético Madrid in La Liga, while the French forward also became the youngest player to reach 500 goal contributions in his career. Off the field, Mbappé has faced controversy after a French club displayed a banner insulting his mother during a relegation battle match.",
      "news": [
        {
          "title": "Kylian Mbappe scores but Real Madrid still can’t win a big game. Will their four stars line up against Man City?",
          "description": "Kylian Mbappe scores but Real Madrid still can’t win a big game. Will their four stars line up against Man City?  The Athletic",
          "date": "Sun, 09 Feb 2025 09:58:59 GMT"
        },
        {
          "title": "Real Madrid rescued by Mbappe after Alvarez penalty for Atletico",
          "description": "Real Madrid rescued by Mbappe after Alvarez penalty for Atletico  Al Jazeera English",
          "date": "Sat, 08 Feb 2025 23:18:25 GMT"
        },
        {
          "title": "French club display banner insulting Kylian Mbappe's mother as they suffer another defeat in relegation battle",
          "description": "French club display banner insulting Kylian Mbappe's mother as they suffer another defeat in relegation battle  Sportskeeda",
          "date": "Sun, 09 Feb 2025 11:12:00 GMT"
        },
        {
          "title": "Real Madrid vs. Atletico Madrid score: Kylian Mbappe rescues point after Julian Alvarez's cold panenka penalty",
          "description": "Real Madrid vs. Atletico Madrid score: Kylian Mbappe rescues point after Julian Alvarez's cold panenka penalty  CBS Sports",
          "date": "Sat, 08 Feb 2025 23:40:00 GMT"
        },
        {
          "title": "La Liga: Kylian Mbappe Secures Real Madrid Derby Draw Against Atletico",
          "description": "La Liga: Kylian Mbappe Secures Real Madrid Derby Draw Against Atletico  NDTV Sports",
          "date": "Sun, 09 Feb 2025 03:06:27 GMT"
        },
        {
          "title": "Kylian Mbappe Becomes Youngest Player in History to Reach Incredible Goalscoring Milestone",
          "description": "Kylian Mbappe Becomes Youngest Player in History to Reach Incredible Goalscoring Milestone  Sports Illustrated",
          "date": "Sat, 08 Feb 2025 22:50:47 GMT"
        },
        {
          "title": "Kylian Mbappe, Julian Alvarez score as Madrid derby ends in 1-1 draw",
          "description": "Kylian Mbappe, Julian Alvarez score as Madrid derby ends in 1-1 draw  Inquirer.net",
          "date": "Sun, 09 Feb 2025 10:17:00 GMT"
        },
        {
          "title": "Kylian Mbappe achieves feat not even Cristiano Ronaldo managed in his debut season with Real Madrid",
          "description": "Kylian Mbappe achieves feat not even Cristiano Ronaldo managed in his debut season with Real Madrid  Bolavip US",
          "date": "Sun, 09 Feb 2025 00:05:57 GMT"
        },
        {
          "title": "Kylian Mbappe becomes youngest player to reach 500 goal contributions",
          "description": "Kylian Mbappe becomes youngest player to reach 500 goal contributions  Khel Now",
          "date": "Sun, 09 Feb 2025 09:25:34 GMT"
        },
        {
          "title": "Soccer-Mbappe rescues Real Madrid in 1-1 draw with Atletico",
          "description": "Soccer-Mbappe rescues Real Madrid in 1-1 draw with Atletico  MSN",
          "date": "Sun, 09 Feb 2025 11:57:06 GMT"
        }
      ]
    },
    {
      "player_id": 360114,
      "player_name": "Abduqodir Khusanov",
      "trending_score": 93.0,
      "trend_summary": "In a thrilling FA Cup match against Leyton Orient, Uzbekistan's Abdukodir Khusanov netted his maiden goal for Manchester City, a fortuitous deflection that secured a 2-1 victory for the Premier League giants. Despite Nico Gonzalez's disappointing debut, Khusanov's historic strike has earned him praise from manager Pep Guardiola.",
      "news": [
        {
          "title": "WATCH: Uzbekistan international Abdukodir Khusanov scores his first ever Manchester City goal after wicked deflection in FA Cup win vs Leyton Orient",
          "description": "WATCH: Uzbekistan international Abdukodir Khusanov scores his first ever Manchester City goal after wicked deflection in FA Cup win vs Leyton Orient  Sportskeeda",
          "date": "Sat, 08 Feb 2025 15:33:00 GMT"
        },
        {
          "title": "Manchester City’s new centre-backs showed plenty against Leyton Orient",
          "description": "Manchester City’s new centre-backs showed plenty against Leyton Orient  OneFootball",
          "date": "Sun, 09 Feb 2025 10:51:04 GMT"
        },
        {
          "title": "Transfer news LIVE! Arsenal want £50m wonderkid; Chelsea eye £42m raid",
          "description": "Transfer news LIVE! Arsenal want £50m wonderkid; Chelsea eye £42m raid  Evening Standard",
          "date": "Sun, 09 Feb 2025 11:25:50 GMT"
        },
        {
          "title": "Man City 2-1 Leyton Orient (Feb 8, 2025) Game Analysis",
          "description": "Man City 2-1 Leyton Orient (Feb 8, 2025) Game Analysis  ESPN",
          "date": "Sat, 08 Feb 2025 14:37:30 GMT"
        },
        {
          "title": "Lewis: 'I'm happy Khusanov got the goal!'",
          "description": "Lewis: 'I'm happy Khusanov got the goal!'  Manchester City FC",
          "date": "Sat, 08 Feb 2025 15:15:00 GMT"
        },
        {
          "title": "Man City player ratings vs Leyton Orient with one 4/10 as Nico Gonzalez debut goes wrong",
          "description": "Man City player ratings vs Leyton Orient with one 4/10 as Nico Gonzalez debut goes wrong  Yahoo Eurosport UK",
          "date": "Sat, 08 Feb 2025 14:28:34 GMT"
        },
        {
          "title": "Report: Leyton Orient 1-2 Man City",
          "description": "Report: Leyton Orient 1-2 Man City  sportsmax.tv",
          "date": "Sat, 08 Feb 2025 15:39:46 GMT"
        },
        {
          "title": "Man City player ratings vs Leyton Orient: Kevin De Bruyne's impact avoids FA Cup banana skin as classy Jack Grealish reminds Guardiola he still exists",
          "description": "Man City player ratings vs Leyton Orient: Kevin De Bruyne's impact avoids FA Cup banana skin as classy Jack Grealish reminds Guardiola he still exists  Goal.com",
          "date": "Sat, 08 Feb 2025 14:23:20 GMT"
        },
        {
          "title": "Kevin de Bruyne scores winner as Man City recover from early scare to beat Leyton Orient in FA Cup",
          "description": "Kevin de Bruyne scores winner as Man City recover from early scare to beat Leyton Orient in FA Cup  The National",
          "date": "Sat, 08 Feb 2025 15:23:44 GMT"
        },
        {
          "title": "Man City decision to leave Reis out of Champions League squad explained",
          "description": "Man City decision to leave Reis out of Champions League squad explained  Tribal Football",
          "date": "Sat, 08 Feb 2025 13:54:03 GMT"
        }
      ]
    },
    {
      "player_id": 754,
      "player_name": "Luka Modrić",
      "trending_score": 72.0,
      "trend_summary": "Real Madrid's Luka Modrić has surpassed all foreign players in Madrid derby appearances, setting a new club record. However, tensions have surfaced between Modrić and teammate Vinicius Jr. after the former criticized the latter's defensive efforts in the lead-up to a crucial Champions League clash against Manchester City.",
      "news": [
        {
          "title": "Luka Modric fumes at Vinicius Jr for not defending as Real Madrid enter injury crisis ahead of crucial Man City showdown",
          "description": "Luka Modric fumes at Vinicius Jr for not defending as Real Madrid enter injury crisis ahead of crucial Man City showdown",
          "date": "Sat, 08 Feb 2025 20:24:11 GMT"
        },
        {
          "title": "Carlo Ancelotti reveals his stance on Luka Modric and Vinicius Jr amid viral verbal clash",
          "description": "Carlo Ancelotti reveals his stance on Luka Modric and Vinicius Jr amid viral verbal clash  SportsTak",
          "date": "Sat, 08 Feb 2025 13:49:24 GMT"
        },
        {
          "title": "Ex-Rangers ace Barisic explains key role Modric in transfer deadline day move",
          "description": "Ex-Rangers ace Barisic explains key role Modric in transfer deadline day move  Rangers Review",
          "date": "Sat, 08 Feb 2025 14:10:18 GMT"
        },
        {
          "title": "Modric's Gesture and Fans' Ovation: Real Madrid's Tribute to Marcelo",
          "description": "Modric's Gesture and Fans' Ovation: Real Madrid's Tribute to Marcelo  FootBoom",
          "date": "Sat, 08 Feb 2025 21:06:34 GMT"
        },
        {
          "title": "Real Madrid 1-1 Atletico: Los Blancos' Player Ratings as Kylian Mbappe's second-half strike secures a point from an exciting contest",
          "description": "Real Madrid 1-1 Atletico: Los Blancos' Player Ratings as Kylian Mbappe's second-half strike secures a point from an exciting contest",
          "date": "Sat, 08 Feb 2025 22:22:00 GMT"
        },
        {
          "title": "(PHOTOS) Real Madrid Honors Marcelo Moments Before Madrid Derby",
          "description": "(PHOTOS) Real Madrid Honors Marcelo Moments Before Madrid Derby  beIN SPORTS",
          "date": "Sat, 08 Feb 2025 20:39:50 GMT"
        },
        {
          "title": "Luka Modric sets record for most Madrid derby appearances by a foreign player",
          "description": "Luka Modric sets record for most Madrid derby appearances by a foreign player  Juventus Live ENG",
          "date": "Sun, 09 Feb 2025 11:14:34 GMT"
        },
        {
          "title": "Vinicius Jr is labelled 'a problem' by the Spanish press after Luka Modric clash",
          "description": "Vinicius Jr is labelled 'a problem' by the Spanish press after Luka Modric clash",
          "date": "Sun, 09 Feb 2025 08:25:18 GMT"
        },
        {
          "title": "Marcelo bows to Modrić in emotional tribute at Santiago Bernabéu",
          "description": "Marcelo bows to Modrić in emotional tribute at Santiago Bernabéu  Nogomania",
          "date": "Sun, 09 Feb 2025 09:48:43 GMT"
        },
        {
          "title": "Real Madrid honour retiring club legend Marcelo before derby – WATCH",
          "description": "Real Madrid honour retiring club legend Marcelo before derby – WATCH  News9 LIVE",
          "date": "Sun, 09 Feb 2025 03:40:33 GMT"
        }
      ]
    },
    {
      "player_id": 6420,
      "player_name": "Mateo Retegui",
      "trending_score": 38.0,
      "trend_summary": "Mateo Retegui's remarkable performance for Atalanta against Verona in Serie A has propelled the club into title contention, with the Argentine striker scoring an impressive four goals in their 5-0 victory. Retegui's goalscoring exploits have not only boosted Atalanta's hopes of a first-ever Serie A title but have also solidified his status as one of the most promising young talents in European football.",
      "news": [
        {
          "title": "Mateo Retegui scores four as Atalanta hammer Verona to boost Serie A title hopes",
          "description": "Mateo Retegui scores four as Atalanta hammer Verona to boost Serie A title hopes  Flashscore.com",
          "date": "Sat, 08 Feb 2025 21:04:12 GMT"
        },
        {
          "title": "Report: Verona 0-5 Atalanta",
          "description": "Report: Verona 0-5 Atalanta  sportsmax.tv",
          "date": "Sat, 08 Feb 2025 21:36:09 GMT"
        },
        {
          "title": "Soccer-Atalanta thrash Verona 5-0 with four from Retegui",
          "description": "Soccer-Atalanta thrash Verona 5-0 with four from Retegui  MSN",
          "date": "Sat, 08 Feb 2025 19:00:31 GMT"
        },
        {
          "title": "Serie A: Verona 0-5 Atalanta – Retegui destroys Gialloblu with four goals",
          "description": "Serie A: Verona 0-5 Atalanta – Retegui destroys Gialloblu with four goals  OneFootball",
          "date": "Sat, 08 Feb 2025 15:57:47 GMT"
        },
        {
          "title": "Serie A: Verona 0-5 Atalanta – Retegui destroys Gialloblu with four goals",
          "description": "Serie A: Verona 0-5 Atalanta – Retegui destroys Gialloblu with four goals  Football Italia",
          "date": "Sat, 08 Feb 2025 15:50:34 GMT"
        },
        {
          "title": "Gjimshiti assists in Atalanta's victory, Retegui shines",
          "description": "Gjimshiti assists in Atalanta's victory, Retegui shines  KOHA.net",
          "date": "Sat, 08 Feb 2025 15:51:38 GMT"
        },
        {
          "title": "Champions League form guide: Scores, results, league position, schedule, fixtures",
          "description": "Champions League form guide: Scores, results, league position, schedule, fixtures  UEFA.com",
          "date": "Sun, 09 Feb 2025 10:57:59 GMT"
        },
        {
          "title": "Atalanta thrash Verona 5-0 with four from Retegui",
          "description": "Atalanta thrash Verona 5-0 with four from Retegui  The Straits Times",
          "date": "Sat, 08 Feb 2025 16:37:13 GMT"
        },
        {
          "title": "Soccer-Retegui hits four as Atalanta thrash Verona 5-0",
          "description": "Soccer-Retegui hits four as Atalanta thrash Verona 5-0  MSN",
          "date": "Sat, 08 Feb 2025 16:34:26 GMT"
        },
        {
          "title": "Football Tracker: Retegui nets four for Atalanta as Stuttgart lead Dortmund through own goal",
          "description": "Football Tracker: Retegui nets four for Atalanta as Stuttgart lead Dortmund through own goal  Flashscore.com",
          "date": "Sat, 08 Feb 2025 15:43:30 GMT"
        }
      ]
    }
  ]
}