{
  "updated_at": "2025-01-24T00:04:32.793584+00:00",
  "player_news": [
    {
      "player_id": 81573,
      "player_name": "Omar Khaled Mohamed Abd Elsala Marmoush",
      "trending_score": 100.0,
      "trend_summary": "Egyptian forward Omar Marmoush has joined Manchester City from Eintracht Frankfurt for a reported £59 million. The 23-year-old has impressed with his pace and goal-scoring ability in the Bundesliga, leading to speculation that he could be a potential replacement for Julian Alvarez at the Etihad Stadium. However, some experts believe that City may be taking a risk with the transfer, given Marmoush's lack of experience at the highest level.",
      "news": [
        {
          "title": "Omar Marmoush signs for Manchester City — What can we expect?",
          "description": "Omar Marmoush signs for Manchester City — What can we expect?  NBC Sports",
          "date": "Thu, 23 Jan 2025 21:19:08 GMT"
        },
        {
          "title": "Manchester City complete Omar Marmoush signing from Eintracht Frankfurt",
          "description": "Manchester City complete Omar Marmoush signing from Eintracht Frankfurt",
          "date": "Thu, 23 Jan 2025 18:38:39 GMT"
        },
        {
          "title": "Emotions high as Marmoush leaves Eintracht",
          "description": "Emotions high as Marmoush leaves Eintracht  Bundesliga",
          "date": "Thu, 23 Jan 2025 09:11:03 GMT"
        },
        {
          "title": "Omar Marmoush signs with Man City on transfer from Eintracht Frankfurt",
          "description": "Omar Marmoush signs with Man City on transfer from Eintracht Frankfurt  Al Jazeera English",
          "date": "Thu, 23 Jan 2025 09:45:00 GMT"
        },
        {
          "title": "What Omar Marmoush brings to Manchester City: Lethal on the break, runs behind and a passing option",
          "description": "What Omar Marmoush brings to Manchester City: Lethal on the break, runs behind and a passing option  The Athletic",
          "date": "Thu, 23 Jan 2025 18:16:58 GMT"
        },
        {
          "title": "Omar Marmoush returns from international duty with injury",
          "description": "Omar Marmoush returns from international duty with injury  OneFootball",
          "date": "Thu, 23 Jan 2025 16:37:33 GMT"
        },
        {
          "title": "Why Marmoush can be Man City's perfect Alvarez replacement",
          "description": "Why Marmoush can be Man City's perfect Alvarez replacement  Premier League",
          "date": "Thu, 23 Jan 2025 09:18:08 GMT"
        },
        {
          "title": "Omar Marmoush: How Man City may use Egyptian forward & how he was used at Eintracht Frankfurt",
          "description": "Omar Marmoush: How Man City may use Egyptian forward & how he was used at Eintracht Frankfurt  BBC.com",
          "date": "Thu, 23 Jan 2025 10:02:33 GMT"
        },
        {
          "title": "Omar Marmoush: 10 things you (probably) didn’t know",
          "description": "Omar Marmoush: 10 things you (probably) didn’t know  Manchester City FC",
          "date": "Thu, 23 Jan 2025 09:00:00 GMT"
        },
        {
          "title": "Man City taking a huge risk paying £59m for Omar Marmoush given lack of elite experience or previous form ahead of current purple patch: GOAL grades 2025's biggest January transfers",
          "description": "Man City taking a huge risk paying £59m for Omar Marmoush given lack of elite experience or previous form ahead of current purple patch: GOAL grades 2025's biggest January transfers  Goal.com",
          "date": "Thu, 23 Jan 2025 14:10:00 GMT"
        }
      ]
    },
    {
      "player_id": 1467,
      "player_name": "Alexandre Armand Lacazette",
      "trending_score": 94.0,
      "trend_summary": "In the Europa League clash between Fenerbahce and Lyon, Alexandre Lacazette failed to make a significant impact as his team was held to a disappointing 0-0 draw, leaving Fenerbahce in danger of Europa League elimination. The match was marked by Lyon's missed opportunities, with Lacazette among those who failed to convert their chances.",
      "news": [
        {
          "title": "Fenerbahce 0-0 Lyon: Wasteful Lyon made to rue missed opportunities in goalless draw",
          "description": "Fenerbahce 0-0 Lyon: Wasteful Lyon made to rue missed opportunities in goalless draw  VAVEL",
          "date": "Thu, 23 Jan 2025 20:32:21 GMT"
        },
        {
          "title": "Fenerbahce in danger of Europa League elimination after being held to draw by Lyon",
          "description": "Fenerbahce in danger of Europa League elimination after being held to draw by Lyon  Flashscore.com",
          "date": "Thu, 23 Jan 2025 20:05:43 GMT"
        },
        {
          "title": "Fenerbahce faces Lyon in crucial Europa League clash",
          "description": "Fenerbahce faces Lyon in crucial Europa League clash  Türkiye Today",
          "date": "Thu, 23 Jan 2025 12:31:12 GMT"
        },
        {
          "title": "Europa League: Lyon Held to Goalless Draw by Fenerbahce",
          "description": "Europa League: Lyon Held to Goalless Draw by Fenerbahce  FootBoom",
          "date": "Thu, 23 Jan 2025 21:51:30 GMT"
        },
        {
          "title": "Lyon predicted XI v Fenerbahçe: Ainsley Maitland-Niles ill, Georges Mikautadze to start",
          "description": "Lyon predicted XI v Fenerbahçe: Ainsley Maitland-Niles ill, Georges Mikautadze to start  Get French Football News",
          "date": "Thu, 23 Jan 2025 10:10:29 GMT"
        },
        {
          "title": "Fenerbahce vs Lyon Prediction, lineups, betting tips & odds",
          "description": "Fenerbahce vs Lyon Prediction, lineups, betting tips & odds  Khel Now",
          "date": "Thu, 23 Jan 2025 19:46:35 GMT"
        },
        {
          "title": "Fenerbahçe and Olympique Lyon Settle for Goalless Draw",
          "description": "Fenerbahçe and Olympique Lyon Settle for Goalless Draw  FootBoom",
          "date": "Thu, 23 Jan 2025 22:35:44 GMT"
        }
      ]
    },
    {
      "player_id": 21090,
      "player_name": "Diego Carlos Santos Silva",
      "trending_score": 75.0,
      "trend_summary": "Aston Villa's Diego Carlos has departed the Premier League, joining Turkish giants Fenerbahce on a 3½-year deal. The Brazilian defender, who made 23 appearances for Villa, expressed gratitude for his time in England but is excited for a new chapter in Istanbul.",
      "news": [
        {
          "title": "Aston Villa's Diego Carlos joins Fenerbahce on 3½-year deal",
          "description": "Aston Villa's Diego Carlos joins Fenerbahce on 3½-year deal  ESPN",
          "date": "Thu, 23 Jan 2025 14:25:37 GMT"
        },
        {
          "title": "Brazilian Defender Diego Carlos signs for Fenerbahce",
          "description": "Brazilian Defender Diego Carlos signs for Fenerbahce  Sarajevo Times",
          "date": "Thu, 23 Jan 2025 20:51:03 GMT"
        },
        {
          "title": "Brazilian Diego Carlos moves to Fenerbahce from Aston Villa on three-and-a-half-year deal",
          "description": "Brazilian Diego Carlos moves to Fenerbahce from Aston Villa on three-and-a-half-year deal  Flashscore.com",
          "date": "Thu, 23 Jan 2025 13:46:05 GMT"
        },
        {
          "title": "Villa's Carlos joins Fenerbahce on 3½-year deal",
          "description": "Villa's Carlos joins Fenerbahce on 3½-year deal  ESPN",
          "date": "Thu, 23 Jan 2025 13:52:00 GMT"
        },
        {
          "title": "Fenerbahçe Signs Brazilian Defender Diego Carlos on Three and a Half Year Deal",
          "description": "Fenerbahçe Signs Brazilian Defender Diego Carlos on Three and a Half Year Deal  FootBoom",
          "date": "Thu, 23 Jan 2025 18:34:57 GMT"
        },
        {
          "title": "Fenerbahce announce 'agreement' with Aston Villa for Diego Carlos",
          "description": "Fenerbahce announce 'agreement' with Aston Villa for Diego Carlos  Tribal Football",
          "date": "Thu, 23 Jan 2025 10:23:09 GMT"
        },
        {
          "title": "Aston Villa very close to signing La Liga defender to replace Diego Carlos",
          "description": "Aston Villa very close to signing La Liga defender to replace Diego Carlos  OneFootball",
          "date": "Thu, 23 Jan 2025 13:40:02 GMT"
        },
        {
          "title": "Transfer news :Brazilian Diego Carlos joins Fenerbahce from Aston Villa on three-and-a-half-year deal",
          "description": "Transfer news :Brazilian Diego Carlos joins Fenerbahce from Aston Villa on three-and-a-half-year deal  Asaase Radio",
          "date": "Thu, 23 Jan 2025 13:59:48 GMT"
        },
        {
          "title": "Diego Carlos speaks out after Aston Villa transfer as Fenerbahce deal details revealed",
          "description": "Diego Carlos speaks out after Aston Villa transfer as Fenerbahce deal details revealed  Birmingham Live",
          "date": "Thu, 23 Jan 2025 11:10:00 GMT"
        },
        {
          "title": "Diego Carlos inks 3.5 years contract with Fenerbahce",
          "description": "Diego Carlos inks 3.5 years contract with Fenerbahce  Yeni Şafak English",
          "date": "Thu, 23 Jan 2025 12:11:51 GMT"
        }
      ]
    },
    {
      "player_id": 1485,
      "player_name": "Bruno Miguel Borges Fernandes",
      "trending_score": 68.0,
      "trend_summary": "In a thrilling Europa League clash, Bruno Fernandes scored a dramatic stoppage-time winner to secure a 2-1 victory for Manchester United over Rangers, keeping the Red Devils on course for a place in the last 16. Despite United's struggles throughout the match, Fernandes's late heroics highlighted his importance to the team, silencing critics who have questioned his recent form.",
      "news": [
        {
          "title": "Manchester United 2-1 Rangers: Player Ratings as Bruno Fernandes Wins it at the Death",
          "description": "Manchester United 2-1 Rangers: Player Ratings as Bruno Fernandes Wins it at the Death  Sports Illustrated",
          "date": "Thu, 23 Jan 2025 22:01:41 GMT"
        },
        {
          "title": "Bruno Fernandes says Manchester United aiming to bypass Europa League play-offs: 'We want to get top eight'",
          "description": "Bruno Fernandes says Manchester United aiming to bypass Europa League play-offs: 'We want to get top eight'  dazn.com",
          "date": "Thu, 23 Jan 2025 22:52:15 GMT"
        },
        {
          "title": "Fernandes hopes United fans 'never get used to losing'",
          "description": "Fernandes hopes United fans 'never get used to losing'  Eurosport COM",
          "date": "Thu, 23 Jan 2025 23:19:00 GMT"
        },
        {
          "title": "Bruno Fernandes strikes late to keep Man United on course for Europa League last 16 spot",
          "description": "Bruno Fernandes strikes late to keep Man United on course for Europa League last 16 spot  FOX Sports",
          "date": "Thu, 23 Jan 2025 21:00:07 GMT"
        },
        {
          "title": "Bruno Fernandes scores stoppage-time winner as Manchester United beat Rangers",
          "description": "Bruno Fernandes scores stoppage-time winner as Manchester United beat Rangers  Yahoo Eurosport UK",
          "date": "Thu, 23 Jan 2025 22:17:33 GMT"
        },
        {
          "title": "Manchester United vs Rangers live updates: Butland own goal gives hosts Europa League lead",
          "description": "Manchester United vs Rangers live updates: Butland own goal gives hosts Europa League lead",
          "date": "Thu, 23 Jan 2025 21:32:16 GMT"
        },
        {
          "title": "Manchester United Struggles But is Saved by Bruno Fernandes in Europa League",
          "description": "Manchester United Struggles But is Saved by Bruno Fernandes in Europa League  beIN SPORTS",
          "date": "Thu, 23 Jan 2025 22:59:00 GMT"
        },
        {
          "title": "Rio Ferdinand hits out at Bruno Fernandes' critics as he hails the Man United captain after he saved Red Devil",
          "description": "Rio Ferdinand hits out at Bruno Fernandes' critics as he hails the Man United captain after he saved Red Devil  Daily Mail",
          "date": "Thu, 23 Jan 2025 22:34:23 GMT"
        },
        {
          "title": "Bruno Fernandes settles battle of Britain but late escape fails to mask Manchester United's issues",
          "description": "Bruno Fernandes settles battle of Britain but late escape fails to mask Manchester United's issues  The Independent",
          "date": "Thu, 23 Jan 2025 22:20:00 GMT"
        },
        {
          "title": "Bruno Fernandes's late goal secures Manchester United's victory over Rangers",
          "description": "Bruno Fernandes's late goal secures Manchester United's victory over Rangers  NewsBytes",
          "date": "Thu, 23 Jan 2025 22:24:16 GMT"
        }
      ]
    },
    {
      "player_id": 284324,
      "player_name": "Alejandro Garnacho Ferreyra",
      "trending_score": 53.0,
      "trend_summary": "Amidst speculation of a potential departure from Manchester United, Alejandro Garnacho has reportedly chosen between Chelsea and Napoli as his preferred destination. The 18-year-old winger's impressive performances in the UEFA Europa League have caught the attention of several top clubs, with Chelsea reportedly preparing an opening bid for his services.",
      "news": [
        {
          "title": "Chelsea line up opening Alejandro Garnacho bid with Napoli moving on",
          "description": "Chelsea line up opening Alejandro Garnacho bid with Napoli moving on  The Telegraph",
          "date": "Thu, 23 Jan 2025 16:10:00 GMT"
        },
        {
          "title": "Alejandro Garnacho: Chelsea considering move for Manchester United winger before January transfer window closes",
          "description": "Alejandro Garnacho: Chelsea considering move for Manchester United winger before January transfer window closes  Sky Sports",
          "date": "Thu, 23 Jan 2025 17:26:15 GMT"
        },
        {
          "title": "Football gossip: Garnacho, Cambiaso, Rashford, Chilwell, Zinchenko, Veiga",
          "description": "Football gossip: Garnacho, Cambiaso, Rashford, Chilwell, Zinchenko, Veiga  BBC.com",
          "date": "Thu, 23 Jan 2025 21:34:54 GMT"
        },
        {
          "title": "Chelsea's Alejandro Garnacho transfer stance explained as Man Utd brace for bid",
          "description": "Chelsea's Alejandro Garnacho transfer stance explained as Man Utd brace for bid  Football.London",
          "date": "Thu, 23 Jan 2025 19:21:24 GMT"
        },
        {
          "title": "Chelsea to approach Manchester United over potential deal for Alejandro Garnacho: Reports",
          "description": "Chelsea to approach Manchester United over potential deal for Alejandro Garnacho: Reports  Sportskeeda",
          "date": "Thu, 23 Jan 2025 16:38:00 GMT"
        },
        {
          "title": "Rio Ferdinand offers Alejandro Garnacho transfer theory amid Chelsea links",
          "description": "Rio Ferdinand offers Alejandro Garnacho transfer theory amid Chelsea links  Metro.co.uk",
          "date": "Thu, 23 Jan 2025 23:48:00 GMT"
        },
        {
          "title": "Alejandro Garnacho 'picks between Chelsea and Napoli' as Man Utd exit edges near",
          "description": "Alejandro Garnacho 'picks between Chelsea and Napoli' as Man Utd exit edges near  Express",
          "date": "Thu, 23 Jan 2025 17:16:00 GMT"
        },
        {
          "title": "Chelsea take first step towards Alejandro Garnacho transfer as Man United demand £60m...",
          "description": "Chelsea take first step towards Alejandro Garnacho transfer as Man United demand £60m...  talkSPORT",
          "date": "Thu, 23 Jan 2025 17:06:40 GMT"
        },
        {
          "title": "Manchester United vs Rangers: Will Alejandro Garnacho play amid transfer rumours?",
          "description": "Manchester United vs Rangers: Will Alejandro Garnacho play amid transfer rumours?  NationalWorld",
          "date": "Thu, 23 Jan 2025 17:43:20 GMT"
        },
        {
          "title": "Should Chelsea Sign Alejandro Garnacho From Manchester United?",
          "description": "Should Chelsea Sign Alejandro Garnacho From Manchester United?  OneFootball",
          "date": "Thu, 23 Jan 2025 17:14:14 GMT"
        }
      ]
    }
  ]
}