{
  "updated_at": "2025-03-30T12:23:50.842173+00:00",
  "player_news": [
    {
      "player_id": 278,
      "player_name": "Kylian Mbappé Lottin",
      "trending_score": 100.0,
      "trend_summary": "Kylian Mbappé is firing on all cylinders for Real Madrid, equalling a Cristiano Ronaldo record and scoring a brace against Leganes to save the team's season. However, UEFA is investigating Mbappé, along with other Real Madrid players, for conduct during a match against Atletico.\n",
      "news": [
        {
          "title": "Are France a better team without Kylian Mbappé?",
          "description": "Are France a better team without Kylian Mbappé?  Yahoo Sports",
          "date": "Sat, 29 Mar 2025 22:24:14 GMT"
        },
        {
          "title": "Kylian Mbappe equals Cristiano Ronaldo's legendary Real Madrid record",
          "description": "Kylian Mbappe equals Cristiano Ronaldo's legendary Real Madrid record  Geo News",
          "date": "Sun, 30 Mar 2025 09:24:00 GMT"
        },
        {
          "title": "Real Madrid: UEFA investigating Antonio Rudiger, Kylian Mbappe, Dani Ceballos and Vinicius Jr for conduct vs Atletico",
          "description": "Real Madrid: UEFA investigating Antonio Rudiger, Kylian Mbappe, Dani Ceballos and Vinicius Jr for conduct vs Atletico  Sky Sports",
          "date": "Sun, 30 Mar 2025 09:34:30 GMT"
        },
        {
          "title": "Real Madrid move level with Barcelona as Mbappe wards off Leganes scare",
          "description": "Real Madrid move level with Barcelona as Mbappe wards off Leganes scare  Al Jazeera English",
          "date": "Sat, 29 Mar 2025 23:11:28 GMT"
        },
        {
          "title": "Real Madrid 3–2 Leganes: Player Ratings As Kylian Mbappe's Brace Saves Los Blancos' Season",
          "description": "Real Madrid 3–2 Leganes: Player Ratings As Kylian Mbappe's Brace Saves Los Blancos' Season  Sports Illustrated",
          "date": "Sat, 29 Mar 2025 22:03:30 GMT"
        },
        {
          "title": "Jude Bellingham has set Kylian Mbappe Champions League ban precedent as Arsenal await verdict",
          "description": "Jude Bellingham has set Kylian Mbappe Champions League ban precedent as Arsenal await verdict  Football.London",
          "date": "Sat, 29 Mar 2025 21:29:31 GMT"
        },
        {
          "title": "Kylian Mbappe Fires Real Madrid Level With Barcelona As Atletico Bid Crumbles",
          "description": "Kylian Mbappe Fires Real Madrid Level With Barcelona As Atletico Bid Crumbles  NDTV Sports",
          "date": "Sun, 30 Mar 2025 05:27:47 GMT"
        },
        {
          "title": "Kylian Mbappe ties Cristiano Ronaldo tally in Madrid La Liga win",
          "description": "Kylian Mbappe ties Cristiano Ronaldo tally in Madrid La Liga win  Football365",
          "date": "Sun, 30 Mar 2025 08:56:44 GMT"
        },
        {
          "title": "Kylian Mbappe’s life beyond football – ‘God has a plan for everyone’",
          "description": "Kylian Mbappe’s life beyond football – ‘God has a plan for everyone’  Yahoo Sports",
          "date": "Sun, 30 Mar 2025 02:35:24 GMT"
        },
        {
          "title": "(WATCH) Kylian Mbappe boost Real Madrid’s title charge at Real Valladolid",
          "description": "(WATCH) Kylian Mbappe boost Real Madrid’s title charge at Real Valladolid  Yahoo Sports",
          "date": "Sun, 30 Mar 2025 01:19:13 GMT"
        }
      ]
    },
    {
      "player_id": 521,
      "player_name": "Robert Lewandowski",
      "trending_score": 27.0,
      "trend_summary": "Robert Lewandowski may be offered a new contract by Barcelona after closing the year as La Liga's top scorer for 2024, but his form is reportedly crucial to the club's pursuit of Viktor Gyökeres, while Mbappe is closing in on him in the 2024/25 La Liga Golden Boot race. Hansi Flick's approach has led to more substitutions for Lewandowski.\n",
      "news": [
        {
          "title": "Barcelona set to offer Robert Lewandowski new contract",
          "description": "Barcelona set to offer Robert Lewandowski new contract  Yahoo Sports",
          "date": "Sat, 29 Mar 2025 21:49:53 GMT"
        },
        {
          "title": "Barcelona star closes year as La Liga’s top scorer for 2024",
          "description": "Barcelona star closes year as La Liga’s top scorer for 2024  Yahoo Sports",
          "date": "Sun, 30 Mar 2025 02:15:59 GMT"
        },
        {
          "title": "Official, 2 Barça Players in Exchange for Gyökeres: Deal Closed, It's Crazy",
          "description": "Official, 2 Barça Players in Exchange for Gyökeres: Deal Closed, It's Crazy  Carpetas Blaugranas",
          "date": "Sat, 29 Mar 2025 17:00:00 GMT"
        },
        {
          "title": "La Liga top goal scorers 2024/25: Updated Golden Boot rankings in Spain as Mbappe closes on Lewandowski",
          "description": "La Liga top goal scorers 2024/25: Updated Golden Boot rankings in Spain as Mbappe closes on Lewandowski  Sporting News",
          "date": "Sat, 29 Mar 2025 22:09:00 GMT"
        },
        {
          "title": "Barcelona’s pursuit of Viktor Gyökeres hinges on Robert Lewandowski’s form",
          "description": "Barcelona’s pursuit of Viktor Gyökeres hinges on Robert Lewandowski’s form  Yahoo Sports",
          "date": "Sat, 29 Mar 2025 21:37:16 GMT"
        },
        {
          "title": "Barcelona vs Girona predictions, odds and betting tips...",
          "description": "Barcelona vs Girona predictions, odds and betting tips...  talkSPORT",
          "date": "Sun, 30 Mar 2025 06:00:00 GMT"
        },
        {
          "title": "FC Barcelona vs Girona Projected Starting Lineups for La Liga Game",
          "description": "FC Barcelona vs Girona Projected Starting Lineups for La Liga Game  GIVEMESPORT",
          "date": "Sat, 29 Mar 2025 19:00:00 GMT"
        },
        {
          "title": "Official, Isak Will Play for Barça: Here Is His Arrival Date, Salary, and Conditions",
          "description": "Official, Isak Will Play for Barça: Here Is His Arrival Date, Salary, and Conditions  Carpetas Blaugranas",
          "date": "Sat, 29 Mar 2025 19:00:00 GMT"
        },
        {
          "title": "Robert Lewandowski substitutions are down to change of approach from Hansi Flick",
          "description": "Robert Lewandowski substitutions are down to change of approach from Hansi Flick  Yahoo Sports",
          "date": "Sat, 29 Mar 2025 13:09:00 GMT"
        },
        {
          "title": "Official: Arteta Will Spend €150M to Crush Barça: Flick Loses 2 Stars",
          "description": "Official: Arteta Will Spend €150M to Crush Barça: Flick Loses 2 Stars  Carpetas Blaugranas",
          "date": "Sat, 29 Mar 2025 15:00:00 GMT"
        }
      ]
    },
    {
      "player_id": 3007,
      "player_name": "Przemysław Adam Frankowski",
      "trending_score": 26.0,
      "trend_summary": "The provided news articles do not mention Przemysław Frankowski. They focus on a match between Galatasaray and Beşiktaş, with Victor Osimhen's performance for Galatasaray being a key talking point.\n",
      "news": [
        {
          "title": "Galatasaray's unbeaten streak crumbles in 2-1 loss to Beşiktaş",
          "description": "Galatasaray's unbeaten streak crumbles in 2-1 loss to Beşiktaş",
          "date": "Sun, 30 Mar 2025 11:30:07 GMT"
        },
        {
          "title": "Beşiktaş surprises in the league and slows down Galatasaray",
          "description": "Beşiktaş surprises in the league and slows down Galatasaray  Hispanatolia",
          "date": "Sun, 30 Mar 2025 12:05:16 GMT"
        },
        {
          "title": "Besiktas inflicts first defeat on Galatasaray",
          "description": "Besiktas inflicts first defeat on Galatasaray  KOHA.net",
          "date": "Sat, 29 Mar 2025 19:32:23 GMT"
        },
        {
          "title": "Beşiktaş surprise Galatasaray with victory",
          "description": "Beşiktaş surprise Galatasaray with victory  AZERTAC News",
          "date": "Sun, 30 Mar 2025 09:25:00 GMT"
        },
        {
          "title": "Victor Osimhen takes Super Eagles disappointment to Galatasaray as Turkish kings fall in Istanbul derby",
          "description": "Victor Osimhen takes Super Eagles disappointment to Galatasaray as Turkish kings fall in Istanbul derby",
          "date": "Sat, 29 Mar 2025 22:20:38 GMT"
        },
        {
          "title": "Victor Osimhen Fires Blank As Galatasaray Lose Unbeaten Run to Besiktas",
          "description": "Victor Osimhen Fires Blank As Galatasaray Lose Unbeaten Run to Besiktas  Legit.ng",
          "date": "Sat, 29 Mar 2025 20:42:45 GMT"
        },
        {
          "title": "BeÅŸiktaÅŸ Triumphs Over Galatasaray in Thrilling 2-1 Derby Encounter",
          "description": "BeÅŸiktaÅŸ Triumphs Over Galatasaray in Thrilling 2-1 Derby Encounter  777score",
          "date": "Sat, 29 Mar 2025 20:40:01 GMT"
        },
        {
          "title": "Osimhen: Super Eagles hero fires blanks as Galatasaray suffer first league defeat",
          "description": "Osimhen: Super Eagles hero fires blanks as Galatasaray suffer first league defeat  Afrik-Foot NG",
          "date": "Sat, 29 Mar 2025 19:45:49 GMT"
        }
      ]
    },
    {
      "player_id": 129718,
      "player_name": "Jude Victor William Bellingham",
      "trending_score": 21.0,
      "trend_summary": "Jude Bellingham continues to dominate headlines, from being named Real Madrid's Player of the Month for November to scoring a goal in Real Madrid's 3-2 victory against Leganes. His influence extends beyond the pitch, as he's reportedly playing an active role in Real Madrid's pursuit of a world-class player.\n",
      "news": [
        {
          "title": "Barcelona boss Hansi Flick speaks out on Jude Bellingham’s Real Madrid red card",
          "description": "Barcelona boss Hansi Flick speaks out on Jude Bellingham’s Real Madrid red card  Yahoo Sports",
          "date": "Sun, 30 Mar 2025 02:03:29 GMT"
        },
        {
          "title": "Marco Reus says he always knew Jude Bellingham was ‘special’ and talks about life in LA",
          "description": "Marco Reus says he always knew Jude Bellingham was ‘special’ and talks about life in LA  OneFootball",
          "date": "Sun, 30 Mar 2025 09:24:20 GMT"
        },
        {
          "title": "Jude Bellingham's former team-mate reveals what makes him 'special' as he says he saw Real Madrid star's quali",
          "description": "Jude Bellingham's former team-mate reveals what makes him 'special' as he says he saw Real Madrid star's quali  Daily Mail",
          "date": "Sun, 30 Mar 2025 07:54:43 GMT"
        },
        {
          "title": "Phil Foden: Has Man City and England forward failed to 'grab his chance' like Jude Bellingham and Bukayo Saka?",
          "description": "Phil Foden: Has Man City and England forward failed to 'grab his chance' like Jude Bellingham and Bukayo Saka?  Sky Sports",
          "date": "Sun, 30 Mar 2025 12:22:04 GMT"
        },
        {
          "title": "Jude Bellingham surpasses England legends with astonishing LaLiga feat in 101 games fewer...",
          "description": "Jude Bellingham surpasses England legends with astonishing LaLiga feat in 101 games fewer...  talkSPORT",
          "date": "Sat, 29 Mar 2025 22:19:44 GMT"
        },
        {
          "title": "Jude Bellingham's 'special' quality revealed as Marco Reus shares inside knowledge",
          "description": "Jude Bellingham's 'special' quality revealed as Marco Reus shares inside knowledge  The Mirror",
          "date": "Sat, 29 Mar 2025 21:23:00 GMT"
        },
        {
          "title": "Jude Bellingham named Real Madrid player of the month for November",
          "description": "Jude Bellingham named Real Madrid player of the month for November  Yahoo Sports",
          "date": "Sun, 30 Mar 2025 00:12:14 GMT"
        },
        {
          "title": "Jude Bellingham has set Kylian Mbappe Champions League ban precedent as Arsenal await verdict",
          "description": "Jude Bellingham has set Kylian Mbappe Champions League ban precedent as Arsenal await verdict  Football.London",
          "date": "Sat, 29 Mar 2025 21:29:31 GMT"
        },
        {
          "title": "Real Madrid 3-2 Leganes result",
          "description": "Real Madrid 3-2 Leganes result",
          "date": "Sun, 30 Mar 2025 04:52:30 GMT"
        },
        {
          "title": "Jude Bellingham playing active role in Real Madrid deal for world class player",
          "description": "Jude Bellingham playing active role in Real Madrid deal for world class player  Yahoo Sports",
          "date": "Sat, 29 Mar 2025 15:35:39 GMT"
        }
      ]
    },
    {
      "player_id": 446249,
      "player_name": "Ibrahim Mbaye",
      "trending_score": 20.0,
      "trend_summary": "Ibrahim Mbaye is not mentioned in any of the provided news articles. The articles focus on PSG's dominant 6-1 victory over Saint-Etienne in Ligue 1, bringing them closer to their 13th league title, and Presnel Kimpembe's return to Ligue 1 action after over two years.\n",
      "news": [
        {
          "title": "PSG’s Presnel Kimpembe makes first Ligue 1 appearance in over 2 years",
          "description": "PSG’s Presnel Kimpembe makes first Ligue 1 appearance in over 2 years  Yahoo Sports",
          "date": "Sun, 30 Mar 2025 09:59:00 GMT"
        },
        {
          "title": "Paris Saint-Germain routs Saint-Etienne to move to brink of 13th Ligue 1 title",
          "description": "Paris Saint-Germain routs Saint-Etienne to move to brink of 13th Ligue 1 title  FOX Sports",
          "date": "Sat, 29 Mar 2025 18:23:02 GMT"
        },
        {
          "title": "PSG on verge of Ligue 1 title with 6-1 rout of Saint-Etienne",
          "description": "PSG on verge of Ligue 1 title with 6-1 rout of Saint-Etienne  TUOI TRE NEWS",
          "date": "Sun, 30 Mar 2025 02:17:00 GMT"
        },
        {
          "title": "Luis Enrique: \"The second half was sensational\"",
          "description": "Luis Enrique: \"The second half was sensational\"  Paris Saint-Germain",
          "date": "Sat, 29 Mar 2025 20:00:00 GMT"
        },
        {
          "title": "France Soccer League One",
          "description": "France Soccer League One  Idaho State Journal",
          "date": "Sat, 29 Mar 2025 20:15:28 GMT"
        },
        {
          "title": "Doue Shines as PSG Crush Saint-Etienne 6-1, Edge Closer to Ligue 1 Title",
          "description": "Doue Shines as PSG Crush Saint-Etienne 6-1, Edge Closer to Ligue 1 Title  Live India TV",
          "date": "Sun, 30 Mar 2025 04:15:30 GMT"
        },
        {
          "title": "St-Etienne 1-6 PSG: Player Ratings As Parisians Deliver Emphatic Second Half Show",
          "description": "St-Etienne 1-6 PSG: Player Ratings As Parisians Deliver Emphatic Second Half Show  Sports Illustrated",
          "date": "Sat, 29 Mar 2025 22:08:15 GMT"
        },
        {
          "title": "PSG on verge of Ligue 1 title with 6-1 rout of Saint-Etienne",
          "description": "PSG on verge of Ligue 1 title with 6-1 rout of Saint-Etienne  The Straits Times",
          "date": "Sat, 29 Mar 2025 23:06:16 GMT"
        },
        {
          "title": "PLAYER RATINGS",
          "description": "PLAYER RATINGS",
          "date": "Sat, 29 Mar 2025 20:10:00 GMT"
        },
        {
          "title": "PSG move to verge of Ligue 1 crown",
          "description": "PSG move to verge of Ligue 1 crown  New Straits Times",
          "date": "Sun, 30 Mar 2025 05:01:17 GMT"
        }
      ]
    }
  ]
}