{
  "updated_at": "2025-01-18T23:52:33.344451+00:00",
  "player_news": [
    {
      "player_id": 792,
      "player_name": "Justin Dean Kluivert",
      "trending_score": 100.0,
      "trend_summary": "Justin Kluivert emerged from his father's shadow with a stunning hat-trick for Bournemouth in their 4-1 Premier League victory over Newcastle, eclipsing his father Patrick's record at St James' Park in just 44 minutes. The Dutch winger's performance has propelled Bournemouth into the race for European qualification.",
      "news": [
        {
          "title": "Newcastle 1-4 Bournemouth: Justin Kluivert emerging from dad’s shadow as Bournemouth dream of Europe",
          "description": "Newcastle 1-4 Bournemouth: Justin Kluivert emerging from dad’s shadow as Bournemouth dream of Europe  BBC.com",
          "date": "Sat, 18 Jan 2025 19:35:34 GMT"
        },
        {
          "title": "Justin Kluivert gives ‘lovely’ reaction to stunning Bournemouth hat-trick vs Newcastle",
          "description": "Justin Kluivert gives ‘lovely’ reaction to stunning Bournemouth hat-trick vs Newcastle  Yahoo Canada Sports",
          "date": "Sat, 18 Jan 2025 15:22:00 GMT"
        },
        {
          "title": "Kluivert Says Bournemouth Aiming To Impress In Premier League After Win Over Newcastle United",
          "description": "Kluivert Says Bournemouth Aiming To Impress In Premier League After Win Over Newcastle United  Outlook India",
          "date": "Sat, 18 Jan 2025 17:24:12 GMT"
        },
        {
          "title": "Premier League: Justin Kluivert praises Bournemouth after impressive 4-1 win at Newcastle",
          "description": "Premier League: Justin Kluivert praises Bournemouth after impressive 4-1 win at Newcastle  Flashscore.com",
          "date": "Sat, 18 Jan 2025 17:36:27 GMT"
        },
        {
          "title": "Justin Kluivert lauded as he eclipses famous father Patrick at Newcastle",
          "description": "Justin Kluivert lauded as he eclipses famous father Patrick at Newcastle  The Independent",
          "date": "Sat, 18 Jan 2025 16:04:00 GMT"
        },
        {
          "title": "Justin Kluivert revels in overtaking his father Patrick's St James' Park record after stunning hat-trick leads",
          "description": "Justin Kluivert revels in overtaking his father Patrick's St James' Park record after stunning hat-trick leads  Daily Mail",
          "date": "Sat, 18 Jan 2025 16:05:01 GMT"
        },
        {
          "title": "Fans left stunned after seeing what TNT Sports displayed on the screen after Bournemouth beat Newcastle",
          "description": "Fans left stunned after seeing what TNT Sports displayed on the screen after Bournemouth beat Newcastle  SPORTbible",
          "date": "Sat, 18 Jan 2025 15:35:47 GMT"
        },
        {
          "title": "Newcastle v Bournemouth live",
          "description": "Newcastle v Bournemouth live",
          "date": "Sat, 18 Jan 2025 12:30:00 GMT"
        },
        {
          "title": "Newcastle 1-4 Bournemouth: Justin Kluivert hat-trick powers Cherries win as Andoni Iraola's side enter race for Europe",
          "description": "Newcastle 1-4 Bournemouth: Justin Kluivert hat-trick powers Cherries win as Andoni Iraola's side enter race for Europe  Sky Sports",
          "date": "Sat, 18 Jan 2025 14:49:15 GMT"
        },
        {
          "title": "Justin Kluivert beats dad Patrick’s St James’ Park record in just 44 minutes in Newcastle vs Bournemouth cl...",
          "description": "Justin Kluivert beats dad Patrick’s St James’ Park record in just 44 minutes in Newcastle vs Bournemouth cl...  The Sun",
          "date": "Sat, 18 Jan 2025 13:26:55 GMT"
        }
      ]
    },
    {
      "player_id": 47499,
      "player_name": "Enes Ünal",
      "trending_score": 78.0,
      "trend_summary": "In a stunning upset, Bournemouth crushed Newcastle 4-1, with Justin Kluivert emerging as a force to be reckoned with, scoring a goal and assisting another. Meanwhile, transfer rumors continue to swirl around Enes Ünal, with Arsenal reportedly interested in acquiring the striker.",
      "news": [
        {
          "title": "Newcastle 1-4 Bournemouth: Justin Kluivert emerging from dad’s shadow as Bournemouth dream of Europe",
          "description": "Newcastle 1-4 Bournemouth: Justin Kluivert emerging from dad’s shadow as Bournemouth dream of Europe  BBC.com",
          "date": "Sat, 18 Jan 2025 19:35:34 GMT"
        },
        {
          "title": "Transfer news LIVE! Gyokeres to Arsenal, Sesko talks; Chelsea want Garnacho",
          "description": "Transfer news LIVE! Gyokeres to Arsenal, Sesko talks; Chelsea want Garnacho  Evening Standard",
          "date": "Sat, 18 Jan 2025 10:45:08 GMT"
        },
        {
          "title": "Newcastle United vs Bournemouth prediction, odds and betting offer",
          "description": "Newcastle United vs Bournemouth prediction, odds and betting offer  The Mirror",
          "date": "Sat, 18 Jan 2025 05:00:00 GMT"
        },
        {
          "title": "EPL GW-22 Pre deadline Team News & Live Chat",
          "description": "EPL GW-22 Pre deadline Team News & Live Chat  Never Manage Alone",
          "date": "Sat, 18 Jan 2025 06:00:00 GMT"
        },
        {
          "title": "Latest. How can I watch Newcastle United v AFC Bournemouth?",
          "description": "Latest. How can I watch Newcastle United v AFC Bournemouth?  Newcastle United",
          "date": "Sat, 18 Jan 2025 09:10:24 GMT"
        },
        {
          "title": "Premier League LIVE SCORES: Latest updates from around the grounds",
          "description": "Premier League LIVE SCORES: Latest updates from around the grounds  The Sun",
          "date": "Sat, 18 Jan 2025 13:55:33 GMT"
        },
        {
          "title": "Newcastle United vs Bournemouth predictions, odds and betting tips...",
          "description": "Newcastle United vs Bournemouth predictions, odds and betting tips...  talkSPORT",
          "date": "Sat, 18 Jan 2025 07:00:00 GMT"
        },
        {
          "title": "Newcastle vs Bournemouth Preview, Team News, Confirmed Lineups, and Prediction",
          "description": "Newcastle vs Bournemouth Preview, Team News, Confirmed Lineups, and Prediction  Sportscasting",
          "date": "Sat, 18 Jan 2025 11:22:30 GMT"
        }
      ]
    },
    {
      "player_id": 51617,
      "player_name": "Darwin Gabriel Núñez Ribeiro",
      "trending_score": 70.0,
      "trend_summary": "Darwin Núñez's late double rescued a 2-0 victory for Liverpool at Brentford, keeping the Reds in the Premier League title race. The Uruguayan striker's heroics came after reports emerged of Saudi Pro League clubs expressing interest in signing him in January.",
      "news": [
        {
          "title": "Brentford 0 Liverpool 2: Has Darwin Nunez just given the title race a decisive turn?",
          "description": "Brentford 0 Liverpool 2: Has Darwin Nunez just given the title race a decisive turn?",
          "date": "Sat, 18 Jan 2025 21:47:11 GMT"
        },
        {
          "title": "Darwin Nunez late double rescues win for Liverpool in Premier League",
          "description": "Darwin Nunez late double rescues win for Liverpool in Premier League  Newsday",
          "date": "Sat, 18 Jan 2025 17:51:42 GMT"
        },
        {
          "title": "Nunez late show extends Liverpool's lead, Arsenal held by Aston Villa",
          "description": "Nunez late show extends Liverpool's lead, Arsenal held by Aston Villa  NBC Right Now",
          "date": "Sat, 18 Jan 2025 20:31:48 GMT"
        },
        {
          "title": "Darwin Nunez late double rescues win for Liverpool in Premier League",
          "description": "Darwin Nunez late double rescues win for Liverpool in Premier League  KSL.com",
          "date": "Sat, 18 Jan 2025 17:15:00 GMT"
        },
        {
          "title": "Darwin Núñez’s injury-time double at Brentford keeps Liverpool on title track",
          "description": "Darwin Núñez’s injury-time double at Brentford keeps Liverpool on title track  The Guardian",
          "date": "Sat, 18 Jan 2025 21:41:00 GMT"
        },
        {
          "title": "PL round-up: Nunez strikes late for Liverpool at Brentford, wins for Palace and Fulham",
          "description": "PL round-up: Nunez strikes late for Liverpool at Brentford, wins for Palace and Fulham  Eurosport COM",
          "date": "Sat, 18 Jan 2025 17:52:00 GMT"
        },
        {
          "title": "Darwin Nunez Rides To Liverpool's Rescue, Newcastle Thrashed By Bournemouth",
          "description": "Darwin Nunez Rides To Liverpool's Rescue, Newcastle Thrashed By Bournemouth  NDTV Sports",
          "date": "Sat, 18 Jan 2025 17:24:12 GMT"
        },
        {
          "title": "Saudi Pro League Shows 'Genuine' Interest In Struggling Liverpool Striker Darwin Nunez This January",
          "description": "Saudi Pro League Shows 'Genuine' Interest In Struggling Liverpool Striker Darwin Nunez This January  Sports Illustrated",
          "date": "Sat, 18 Jan 2025 11:22:45 GMT"
        },
        {
          "title": "Darwin Nunez late double rescues win for Liverpool in Premier League",
          "description": "Darwin Nunez late double rescues win for Liverpool in Premier League  The Killeen Daily Herald",
          "date": "Sat, 18 Jan 2025 17:51:15 GMT"
        },
        {
          "title": "'Moments like this win titles'",
          "description": "'Moments like this win titles'",
          "date": "Sat, 18 Jan 2025 21:28:52 GMT"
        }
      ]
    },
    {
      "player_id": 645,
      "player_name": "Raheem Shaquille Sterling",
      "trending_score": 37.0,
      "trend_summary": "Raheem Sterling's future remains uncertain as a new Premier League club reportedly enters the race to sign him, while Chelsea opens talks with the player amid rumors of a potential transfer. Additionally, Arsenal manager Mikel Arteta has provided an optimistic update on Sterling's fitness, indicating that he may return to action sooner than expected.",
      "news": [
        {
          "title": "What's going on with Raheem Sterling? Arsenal insiders reveal all",
          "description": "What's going on with Raheem Sterling? Arsenal insiders reveal all  Daily Mail",
          "date": "Sat, 18 Jan 2025 10:45:46 GMT"
        },
        {
          "title": "‘I’m positive he might be back quite early’ – Mikel Arteta on Ben White, Kai Havertz and Raheem Sterling fitness",
          "description": "‘I’m positive he might be back quite early’ – Mikel Arteta on Ben White, Kai Havertz and Raheem Sterling fitness  OneFootball",
          "date": "Sat, 18 Jan 2025 18:06:54 GMT"
        },
        {
          "title": "Arteta claims Arsenal do not have squad depth to compete with Liverpool",
          "description": "Arteta claims Arsenal do not have squad depth to compete with Liverpool  The Guardian",
          "date": "Sat, 18 Jan 2025 21:38:00 GMT"
        },
        {
          "title": "Newcastle 1-4 Bournemouth: Did you know?",
          "description": "Newcastle 1-4 Bournemouth: Did you know?  BBC.com",
          "date": "Sat, 18 Jan 2025 14:57:09 GMT"
        },
        {
          "title": "Transfer Centre LIVE! Football transfers, news, updates and rumours",
          "description": "Transfer Centre LIVE! Football transfers, news, updates and rumours  Sky Sports",
          "date": "Sat, 18 Jan 2025 21:35:36 GMT"
        },
        {
          "title": "Every Premier League player to score two hat-tricks away in a season",
          "description": "Every Premier League player to score two hat-tricks away in a season  The Football Faithful",
          "date": "Sat, 18 Jan 2025 19:27:40 GMT"
        },
        {
          "title": "Dele Alli new club confirmed with former Tottenham Hotspur star set to sign 18-month contract",
          "description": "Dele Alli new club confirmed with former Tottenham Hotspur star set to sign 18-month contract  Football.London",
          "date": "Sat, 18 Jan 2025 16:53:05 GMT"
        },
        {
          "title": "New Premier League club enter race to sign Raheem Sterling as Chelsea open talks",
          "description": "New Premier League club enter race to sign Raheem Sterling as Chelsea open talks  MSN",
          "date": "Sat, 18 Jan 2025 04:47:18 GMT"
        },
        {
          "title": "Mikel Arteta makes feelings clear in pointed message to Arsenal chiefs after Aston Villa blow",
          "description": "Mikel Arteta makes feelings clear in pointed message to Arsenal chiefs after Aston Villa blow  The Mirror",
          "date": "Sat, 18 Jan 2025 22:08:00 GMT"
        },
        {
          "title": "Arsenal vs Aston Villa preview: Storylines, odds, prediction as Gunners try to keep rolling",
          "description": "Arsenal vs Aston Villa preview: Storylines, odds, prediction as Gunners try to keep rolling",
          "date": "Sat, 18 Jan 2025 05:03:41 GMT"
        }
      ]
    },
    {
      "player_id": 1257,
      "player_name": "Jules Olivier Koundé",
      "trending_score": 33.0,
      "trend_summary": "Jules Koundé's impressive form continued with a crucial early goal for Barcelona at Getafe, but the Blaugrana were held to a disappointing 1-1 draw. Despite his on-field contributions, Koundé's frustration mounted as reports emerged that Bayern Munich's Hansi Flick had confirmed a player would be leaving in January, potentially affecting Koundé's future at Camp Nou.",
      "news": [
        {
          "title": "(WATCH) Jules Kounde hands Barcelona early lead at Getafe",
          "description": "(WATCH) Jules Kounde hands Barcelona early lead at Getafe  Yahoo Sports",
          "date": "Sat, 18 Jan 2025 20:22:00 GMT"
        },
        {
          "title": "GOOOAL IN GETAFE! Barcelona had gone 4 consecutive leagues without scoring at the Coliseum",
          "description": "GOOOAL IN GETAFE! Barcelona had gone 4 consecutive leagues without scoring at the Coliseum  FC Barcelona Noticias",
          "date": "Sat, 18 Jan 2025 22:13:00 GMT"
        },
        {
          "title": "Koundé: The Versatile Defender Making Waves in Attack",
          "description": "Koundé: The Versatile Defender Making Waves in Attack  FootBoom",
          "date": "Sat, 18 Jan 2025 23:48:37 GMT"
        },
        {
          "title": "Wasteful Barcelona let more points slip away in draw with gritty Getafe",
          "description": "Wasteful Barcelona let more points slip away in draw with gritty Getafe  Flashscore.com",
          "date": "Sat, 18 Jan 2025 22:03:16 GMT"
        },
        {
          "title": "ANOTHER 'THEFT' FROM BARÇA: The penalty on Koundé that could have given the victory in Getafe",
          "description": "ANOTHER 'THEFT' FROM BARÇA: The penalty on Koundé that could have given the victory in Getafe  FC Barcelona Noticias",
          "date": "Sat, 18 Jan 2025 22:58:00 GMT"
        },
        {
          "title": "Lacklustre Barcelona held to 1-1 draw by Getafe",
          "description": "Lacklustre Barcelona held to 1-1 draw by Getafe  The Straits Times",
          "date": "Sat, 18 Jan 2025 23:10:00 GMT"
        },
        {
          "title": "Hansi Flick Confirms a Player is Leaving in January and Jules Koundé is not Pleased",
          "description": "Hansi Flick Confirms a Player is Leaving in January and Jules Koundé is not Pleased  Madrid-Barcelona.com",
          "date": "Sat, 18 Jan 2025 07:55:00 GMT"
        },
        {
          "title": "Football Tracker: Lookman strikes Atalanta level vs Napoli, Barca level against Getafe",
          "description": "Football Tracker: Lookman strikes Atalanta level vs Napoli, Barca level against Getafe  Flashscore.com",
          "date": "Sat, 18 Jan 2025 11:03:10 GMT"
        },
        {
          "title": "Getafe 1-1 FC Barcelona: The Coliseum resists again",
          "description": "Getafe 1-1 FC Barcelona: The Coliseum resists again  FC Barcelona",
          "date": "Sat, 18 Jan 2025 22:16:17 GMT"
        },
        {
          "title": "Getafe CF",
          "description": "Getafe CF",
          "date": "Sat, 18 Jan 2025 22:30:00 GMT"
        }
      ]
    }
  ]
}