{
  "updated_at": "2025-04-12T23:54:30.663447+00:00",
  "player_news": [
    {
      "player_id": 158697,
      "player_name": "James John McAtee",
      "trending_score": 100.0,
      "trend_summary": "James McAtee started for Manchester City in their 5-2 Premier League victory over Crystal Palace, a match where City recovered from a poor start. Amidst transfer speculation, Pep Guardiola has issued an update on McAtee's future at the club, as Premier League rivals express interest in a potential January move.\n",
      "news": [
        {
          "title": "James McAtee attracts interest from Premier League rivals amid potential Manchester City exit in January",
          "description": "James McAtee attracts interest from Premier League rivals amid potential Manchester City exit in January  Yahoo Sports",
          "date": "Sat, 12 Apr 2025 22:09:53 GMT"
        },
        {
          "title": "Post-Match Reaction – Manchester City 5–2 Crystal Palace, James McAtee on the Goal, De Bruyne Heroics and More",
          "description": "Post-Match Reaction – Manchester City 5–2 Crystal Palace, James McAtee on the Goal, De Bruyne Heroics and More  The Playoffs",
          "date": "Sat, 12 Apr 2025 14:42:53 GMT"
        },
        {
          "title": "Pep Guardiola issues significant update on James McAtee’s Manchester City future amid transfer speculation",
          "description": "Pep Guardiola issues significant update on James McAtee’s Manchester City future amid transfer speculation  Yahoo Sports",
          "date": "Sat, 12 Apr 2025 13:32:47 GMT"
        },
        {
          "title": "McAtee starts as City make three changes for Palace visit",
          "description": "McAtee starts as City make three changes for Palace visit  mancity.com",
          "date": "Sat, 12 Apr 2025 10:15:00 GMT"
        },
        {
          "title": "Man City recover from nightmare start to beat Crystal Palace 5-2",
          "description": "Man City recover from nightmare start to beat Crystal Palace 5-2  MSN",
          "date": "Sat, 12 Apr 2025 14:10:15 GMT"
        },
        {
          "title": "Man City firm up Florian Wirtz transfer interest as Leverkusen eye two players in exchange",
          "description": "Man City firm up Florian Wirtz transfer interest as Leverkusen eye two players in exchange  The Mirror",
          "date": "Sat, 12 Apr 2025 23:00:00 GMT"
        },
        {
          "title": "Manchester City 5-2 Crystal Palace: Kevin de Bruyne leads comeback win",
          "description": "Manchester City 5-2 Crystal Palace: Kevin de Bruyne leads comeback win  BBC",
          "date": "Sat, 12 Apr 2025 23:41:05 GMT"
        },
        {
          "title": "Manchester City 5-2 Crystal Palace: Premier League – as it happened",
          "description": "Manchester City 5-2 Crystal Palace: Premier League – as it happened  The Guardian",
          "date": "Sat, 12 Apr 2025 10:18:00 GMT"
        },
        {
          "title": "Manchester City vs Crystal Palace",
          "description": "Manchester City vs Crystal Palace",
          "date": "Sat, 12 Apr 2025 14:15:15 GMT"
        },
        {
          "title": "Premier League: Manchester City Rally To Beat Crystal Palace 5-2",
          "description": "Premier League: Manchester City Rally To Beat Crystal Palace 5-2  News18",
          "date": "Sat, 12 Apr 2025 14:03:05 GMT"
        }
      ]
    },
    {
      "player_id": 522,
      "player_name": "Thomas Müller",
      "trending_score": 96.0,
      "trend_summary": "Despite being named Man of the Match in the Bundesliga Klassiker against Borussia Dortmund, which ended in a 2-2 draw where he lamented missed chances, reports suggest Thomas Müller's long tenure with Bayern Munich may be coming to an end. He also recently completed 60,000 official match minutes for the club.\n",
      "news": [
        {
          "title": "End of 'Bavarian fairytale': Müller and Bayern part ways",
          "description": "End of 'Bavarian fairytale': Müller and Bayern part ways  Yahoo Sports",
          "date": "Sat, 12 Apr 2025 23:31:15 GMT"
        },
        {
          "title": "Thomas Müller laments lack of \"efficiency\" during 2-2 draw between Bayern Munich and Borussia Dortmund",
          "description": "Thomas Müller laments lack of \"efficiency\" during 2-2 draw between Bayern Munich and Borussia Dortmund  Bavarian Football Works",
          "date": "Sat, 12 Apr 2025 21:30:00 GMT"
        },
        {
          "title": "Müller named Klassiker Man of the Match!",
          "description": "Müller named Klassiker Man of the Match!  bundesliga.com",
          "date": "Sat, 12 Apr 2025 18:53:50 GMT"
        },
        {
          "title": "Reaction: FC Bayern vs. Borussia Dortmund, Bundesliga",
          "description": "Reaction: FC Bayern vs. Borussia Dortmund, Bundesliga  FC Bayern",
          "date": "Sat, 12 Apr 2025 20:20:00 GMT"
        },
        {
          "title": "Müller rues missed chances after Bayern's draw against Dortmund",
          "description": "Müller rues missed chances after Bayern's draw against Dortmund  OneFootball",
          "date": "Sat, 12 Apr 2025 19:55:17 GMT"
        },
        {
          "title": "Transcript: Kompany, Muller, And Kane’s Post-Match Press Conference After Bayern Munich vs Borussia Dortmund",
          "description": "Transcript: Kompany, Muller, And Kane’s Post-Match Press Conference After Bayern Munich vs Borussia Dortmund  Sports Illustrated",
          "date": "Sat, 12 Apr 2025 22:50:29 GMT"
        },
        {
          "title": "🚨🔴 Thomas Müller has now completed 60,000 official match minutes for FC Bayern. Legend. 🇩🇪",
          "description": "🚨🔴 Thomas Müller has now completed 60,000 official match minutes for FC Bayern. Legend. 🇩🇪  x.com",
          "date": "Sat, 12 Apr 2025 17:01:18 GMT"
        },
        {
          "title": "Bayern Munich 2-2 Borussia Dortmund: summary, score, goals, highlights",
          "description": "Bayern Munich 2-2 Borussia Dortmund: summary, score, goals, highlights",
          "date": "Sat, 12 Apr 2025 18:35:17 GMT"
        },
        {
          "title": "Thomas Müller achieves immense milestone against Dortmund ⏰",
          "description": "Thomas Müller achieves immense milestone against Dortmund ⏰  Yahoo Sports",
          "date": "Sat, 12 Apr 2025 17:52:51 GMT"
        },
        {
          "title": "Dortmund and Bayern share spoils in Klassiker classic",
          "description": "Dortmund and Bayern share spoils in Klassiker classic  bundesliga.com",
          "date": "Sat, 12 Apr 2025 22:30:00 GMT"
        }
      ]
    },
    {
      "player_id": 386828,
      "player_name": "Lamine Yamal Nasraoui Ebana",
      "trending_score": 93.0,
      "trend_summary": "Lamine Yamal's stellar season continues as he rounds off a spectacular performance with a goal in Barcelona's 5-0 victory, while a transfer expert offers updates on his contract. However, Barcelona has also learned the extent of an injury to the young star.\n",
      "news": [
        {
          "title": "Barcelona learn extent of Lamine Yamal injury",
          "description": "Barcelona learn extent of Lamine Yamal injury  Yahoo Sports",
          "date": "Sat, 12 Apr 2025 22:15:52 GMT"
        },
        {
          "title": "Steve McManaman names Barcelona star who is 'better' than Lamine Yamal",
          "description": "Steve McManaman names Barcelona star who is 'better' than Lamine Yamal  MSN",
          "date": "Sat, 12 Apr 2025 18:24:28 GMT"
        },
        {
          "title": "WATCH: Lamine Yamal rounds off spectacular performance with goal as Barcelona make it 5-0",
          "description": "WATCH: Lamine Yamal rounds off spectacular performance with goal as Barcelona make it 5-0  Yahoo Sports",
          "date": "Sat, 12 Apr 2025 16:41:13 GMT"
        },
        {
          "title": "Barcelona extend LaLiga lead with 1-0 win at battling Leganes",
          "description": "Barcelona extend LaLiga lead with 1-0 win at battling Leganes  The Straits Times",
          "date": "Sat, 12 Apr 2025 22:11:27 GMT"
        },
        {
          "title": "Leganes 0-1 FC Barcelona Highlights, La Liga: Barca Eke Out A Narrow Victory To Go Seven Points Clear In Title Race",
          "description": "Leganes 0-1 FC Barcelona Highlights, La Liga: Barca Eke Out A Narrow Victory To Go Seven Points Clear In Title Race  Outlook India",
          "date": "Sat, 12 Apr 2025 21:17:37 GMT"
        },
        {
          "title": "Transfer expert offers Lamine Yamal contract update",
          "description": "Transfer expert offers Lamine Yamal contract update  Yahoo Sports",
          "date": "Sat, 12 Apr 2025 15:46:23 GMT"
        },
        {
          "title": "Lamine Yamal pays tribute to Barcelona past and present in Globe Soccer awards",
          "description": "Lamine Yamal pays tribute to Barcelona past and present in Globe Soccer awards  Yahoo Sports",
          "date": "Sat, 12 Apr 2025 16:41:13 GMT"
        },
        {
          "title": "Barcelona extend LaLiga lead with 1-0 win at lowly Leganes",
          "description": "Barcelona extend LaLiga lead with 1-0 win at lowly Leganes  The Straits Times",
          "date": "Sat, 12 Apr 2025 21:06:32 GMT"
        },
        {
          "title": "💫 Lamine Yamal is going from strength to strength this season",
          "description": "💫 Lamine Yamal is going from strength to strength this season  Yahoo Sports",
          "date": "Sat, 12 Apr 2025 17:23:05 GMT"
        },
        {
          "title": "Lamine Yamal’s Kopa trophy win and the margin that left Real Madrid prodigy behind",
          "description": "Lamine Yamal’s Kopa trophy win and the margin that left Real Madrid prodigy behind  Yahoo Sports",
          "date": "Sat, 12 Apr 2025 16:42:26 GMT"
        }
      ]
    },
    {
      "player_id": 81573,
      "player_name": "Omar Khaled Mohamed Abd Elsala Marmoush",
      "trending_score": 79.0,
      "trend_summary": "Omar Marmoush's stellar Bundesliga form earned him Player of the Month honors, but transfer rumors swirl as Manchester City reportedly chases the Eintracht Frankfurt star. Marmoush recently equalized for Manchester City against Crystal Palace in a Premier League match that ended 5-2, after arriving in Manchester for a medical.\n",
      "news": [
        {
          "title": "Omar Marmoush named Bundesliga Player of the Month",
          "description": "Omar Marmoush named Bundesliga Player of the Month  Yahoo Sports",
          "date": "Sat, 12 Apr 2025 20:03:53 GMT"
        },
        {
          "title": "Eintracht Frankfurt manager issues update on Omar Marmoush amid Manchester City transfer chase",
          "description": "Eintracht Frankfurt manager issues update on Omar Marmoush amid Manchester City transfer chase  Yahoo Sports",
          "date": "Sat, 12 Apr 2025 20:29:49 GMT"
        },
        {
          "title": "Man City 5-2 C Palace (Apr 12, 2025) Game Analysis",
          "description": "Man City 5-2 C Palace (Apr 12, 2025) Game Analysis  ESPN",
          "date": "Sat, 12 Apr 2025 14:26:15 GMT"
        },
        {
          "title": "Omar Marmoush stands tall as Manchester City find their groove",
          "description": "Omar Marmoush stands tall as Manchester City find their groove  thenationalnews.com",
          "date": "Sat, 12 Apr 2025 16:54:14 GMT"
        },
        {
          "title": "Pep Guardiola goads Man City fans after Omar Marmoush's equaliser against Crystal Palace",
          "description": "Pep Guardiola goads Man City fans after Omar Marmoush's equaliser against Crystal Palace  Sky Sports",
          "date": "Sat, 12 Apr 2025 23:00:45 GMT"
        },
        {
          "title": "Crystal Palace boss analyzes Omar Marmoush’s Bundesliga rise",
          "description": "Crystal Palace boss analyzes Omar Marmoush’s Bundesliga rise  Pan-Africa Football",
          "date": "Sat, 12 Apr 2025 09:00:24 GMT"
        },
        {
          "title": "Revealed: Omar Marmoush arrives in Manchester with City medical scheduled for Tuesday",
          "description": "Revealed: Omar Marmoush arrives in Manchester with City medical scheduled for Tuesday  Yahoo Sports",
          "date": "Sat, 12 Apr 2025 13:22:00 GMT"
        },
        {
          "title": "Manchester City vs Crystal Palace 5-2: Premier League – as it happened",
          "description": "Manchester City vs Crystal Palace 5-2: Premier League – as it happened  Al Jazeera",
          "date": "Sat, 12 Apr 2025 11:09:53 GMT"
        },
        {
          "title": "De Bruyne inspires stunning five-star City fightback",
          "description": "De Bruyne inspires stunning five-star City fightback  mancity.com",
          "date": "Sat, 12 Apr 2025 13:25:00 GMT"
        },
        {
          "title": "Egyptian players abroad: Marmoush on target as Manchester City rout Crystal Palace",
          "description": "Egyptian players abroad: Marmoush on target as Manchester City rout Crystal Palace",
          "date": "Sat, 12 Apr 2025 20:29:06 GMT"
        }
      ]
    },
    {
      "player_id": 629,
      "player_name": "Kevin De Bruyne",
      "trending_score": 69.0,
      "trend_summary": "Kevin De Bruyne sparked a Manchester City comeback win against Crystal Palace in the Premier League, contributing to their 5-2 thrashing of the Eagles. Despite speculation about his future, with some reports suggesting he will leave Man City this summer, De Bruyne is determined to leave a Champions League legacy.\n",
      "news": [
        {
          "title": "De Bruyne sparks Man City comeback win as Arsenal and Forest stumble in Premier League",
          "description": "De Bruyne sparks Man City comeback win as Arsenal and Forest stumble in Premier League  AP News",
          "date": "Sat, 12 Apr 2025 18:55:00 GMT"
        },
        {
          "title": "Pep hails departing KDB after rout: 'Incredible'",
          "description": "Pep hails departing KDB after rout: 'Incredible'  ESPN",
          "date": "Sat, 12 Apr 2025 15:01:00 GMT"
        },
        {
          "title": "Kevin De Bruyne makes shock admission about his future after confirming he will leave Man City this summer",
          "description": "Kevin De Bruyne makes shock admission about his future after confirming he will leave Man City this summer  Daily Mail",
          "date": "Sat, 12 Apr 2025 20:02:23 GMT"
        },
        {
          "title": "'No-one can do what Kevin has'",
          "description": "'No-one can do what Kevin has'",
          "date": "Sat, 12 Apr 2025 15:44:19 GMT"
        },
        {
          "title": "De Bruyne leads Manchester City to comeback thrashing of Crystal Palace",
          "description": "De Bruyne leads Manchester City to comeback thrashing of Crystal Palace  The Guardian",
          "date": "Sat, 12 Apr 2025 18:54:00 GMT"
        },
        {
          "title": "Kevin De Bruyne determined to leave Champions League legacy for Man City",
          "description": "Kevin De Bruyne determined to leave Champions League legacy for Man City  MSN",
          "date": "Sat, 12 Apr 2025 16:31:09 GMT"
        },
        {
          "title": "De Bruyne targets Champions League place before Man City farewell",
          "description": "De Bruyne targets Champions League place before Man City farewell  Yahoo Sports",
          "date": "Sat, 12 Apr 2025 15:29:13 GMT"
        },
        {
          "title": "De Bruyne sparks Man City comeback in 5-2 win over Palace in Premier League",
          "description": "De Bruyne sparks Man City comeback in 5-2 win over Palace in Premier League  ABC News",
          "date": "Sat, 12 Apr 2025 13:47:14 GMT"
        },
        {
          "title": "Man City survive Crystal Palace scare to climb into Premier League top four",
          "description": "Man City survive Crystal Palace scare to climb into Premier League top four  Al Jazeera",
          "date": "Sat, 12 Apr 2025 14:38:32 GMT"
        },
        {
          "title": "De Bruyne eyes Champions League legacy for City after comeback win",
          "description": "De Bruyne eyes Champions League legacy for City after comeback win",
          "date": "Sat, 12 Apr 2025 17:40:01 GMT"
        }
      ]
    }
  ]
}