{
  "updated_at": "2025-02-17T12:42:24.861651+00:00",
  "player_news": [
    {
      "player_id": 9971,
      "player_name": "Antony Matheus dos Santos",
      "trending_score": 100.0,
      "trend_summary": "Manchester United loanee Antony continues to impress in La Liga, scoring a stunning goal for Real Betis in their 3-0 win over Real Sociedad. Amidst speculation about a potential return to Old Trafford, Antony's agent has hinted at his desire to stay in Spain, while his impressive form has reportedly caught the attention of European giants.",
      "news": [
        {
          "title": "Real Betis 3-0 Real Sociedad: Manchester United loannee Antony scores in win",
          "description": "Real Betis 3-0 Real Sociedad: Manchester United loannee Antony scores in win  BBC.com",
          "date": "Mon, 17 Feb 2025 11:36:16 GMT"
        },
        {
          "title": "The 6 Premier League transfers who cost more than Antony – & how they fared",
          "description": "The 6 Premier League transfers who cost more than Antony – & how they fared  Planet Football",
          "date": "Mon, 17 Feb 2025 08:01:13 GMT"
        },
        {
          "title": "Antony recall option explored after wonder goal for Real Betis as his agent drops hint over Man Utd return",
          "description": "Antony recall option explored after wonder goal for Real Betis as his agent drops hint over Man Utd return  SPORTbible",
          "date": "Mon, 17 Feb 2025 10:48:47 GMT"
        },
        {
          "title": "Antony scores another goal for Betis",
          "description": "Antony scores another goal for Betis  KOHA.net",
          "date": "Sun, 16 Feb 2025 21:56:01 GMT"
        },
        {
          "title": "Antony completes INCREDIBLE hat-trick at Real Betis",
          "description": "Antony completes INCREDIBLE hat-trick at Real Betis  FootballTransfers",
          "date": "Mon, 17 Feb 2025 07:45:00 GMT"
        },
        {
          "title": "Antony nets stunner as hot Betis form continues",
          "description": "Antony nets stunner as hot Betis form continues  ESPN Australia",
          "date": "Mon, 17 Feb 2025 00:14:23 GMT"
        },
        {
          "title": "Manchester United getting dream Antony scenario as Erik ten Hag signing overlooked",
          "description": "Manchester United getting dream Antony scenario as Erik ten Hag signing overlooked  Manchester Evening News",
          "date": "Mon, 17 Feb 2025 11:21:00 GMT"
        },
        {
          "title": "Antony's true opinion of Ruben Amorim revealed after Real Betis switch",
          "description": "Antony's true opinion of Ruben Amorim revealed after Real Betis switch  The Mirror",
          "date": "Mon, 17 Feb 2025 01:00:00 GMT"
        },
        {
          "title": "Antony stat embarrasses Man Utd as winger responds to possible Old Trafford return",
          "description": "Antony stat embarrasses Man Utd as winger responds to possible Old Trafford return  Metro.co.uk",
          "date": "Mon, 17 Feb 2025 08:09:00 GMT"
        },
        {
          "title": "Man Utd flop Antony could be playing for a European giant next season",
          "description": "Man Utd flop Antony could be playing for a European giant next season  Football365",
          "date": "Sun, 16 Feb 2025 13:06:19 GMT"
        }
      ]
    },
    {
      "player_id": 306,
      "player_name": "Mohamed Salah Hamed Mahrous Ghaly",
      "trending_score": 92.0,
      "trend_summary": "Mohamed Salah's resurgence continues as the Liverpool star's goals and assists propel him towards a potential record-breaking Premier League season. Despite contract speculation, Salah has reaffirmed his commitment to the Reds, while his recent strike against Wolves saw him equal Wayne Rooney's Premier League feat and close in on Sergio Aguero's goalscoring tally.",
      "news": [
        {
          "title": "Mohamed Salah: Liverpool star's goals and assists put him on track for greatest Premier League season – The Radar",
          "description": "Mohamed Salah: Liverpool star's goals and assists put him on track for greatest Premier League season – The Radar  Sky Sports",
          "date": "Mon, 17 Feb 2025 10:23:23 GMT"
        },
        {
          "title": "Mohamed Salah forces U-turn after Liverpool star puts contract theory to bed",
          "description": "Mohamed Salah forces U-turn after Liverpool star puts contract theory to bed  The Mirror",
          "date": "Mon, 17 Feb 2025 09:47:00 GMT"
        },
        {
          "title": "Liverpool all-time top scorers: Where does Mohamed Salah rank among Reds players with most goals?",
          "description": "Liverpool all-time top scorers: Where does Mohamed Salah rank among Reds players with most goals?  Sporting News",
          "date": "Sun, 16 Feb 2025 14:38:00 GMT"
        },
        {
          "title": "Ange Postecoglou makes superb Son Heung-Min, Mohamed Salah claim",
          "description": "Ange Postecoglou makes superb Son Heung-Min, Mohamed Salah claim  OneFootball",
          "date": "Mon, 17 Feb 2025 06:35:22 GMT"
        },
        {
          "title": "Mohamed Salah on spot as Liverpool hold off Wolves fightback to reopen gap",
          "description": "Mohamed Salah on spot as Liverpool hold off Wolves fightback to reopen gap  The Guardian",
          "date": "Sun, 16 Feb 2025 19:22:00 GMT"
        },
        {
          "title": "Micah Richards explains why Mohamed Salah had him 'throwing stuff at the TV' during Liverpool 2-1 Wolves",
          "description": "Micah Richards explains why Mohamed Salah had him 'throwing stuff at the TV' during Liverpool 2-1 Wolves  Rousing The Kop",
          "date": "Mon, 17 Feb 2025 12:00:00 GMT"
        },
        {
          "title": "Mohamed Salah on target again as Liverpool edge out Wolves to maintain grip on Premier League title race",
          "description": "Mohamed Salah on target again as Liverpool edge out Wolves to maintain grip on Premier League title race  The National",
          "date": "Sun, 16 Feb 2025 17:17:00 GMT"
        },
        {
          "title": "Liverpool Vs Wolves: Reds Snatch All Three Points Against Wolves At Anfield",
          "description": "Liverpool Vs Wolves: Reds Snatch All Three Points Against Wolves At Anfield  Outlook India",
          "date": "Mon, 17 Feb 2025 06:38:04 GMT"
        },
        {
          "title": "Mohamed Salah proves Alan Shearer wrong after 'defying human nature' for Liverpool",
          "description": "Mohamed Salah proves Alan Shearer wrong after 'defying human nature' for Liverpool  Liverpool Echo",
          "date": "Mon, 17 Feb 2025 09:06:00 GMT"
        },
        {
          "title": "Mohamed Salah equals Wayne Rooney’s Premier League feat, closes in on Sergio Aguero",
          "description": "Mohamed Salah equals Wayne Rooney’s Premier League feat, closes in on Sergio Aguero  Flashscore.com",
          "date": "Sun, 16 Feb 2025 17:20:42 GMT"
        }
      ]
    },
    {
      "player_id": 18784,
      "player_name": "James Daniel Maddison",
      "trending_score": 82.0,
      "trend_summary": "James Maddison silenced his critic Roy Keane with a cheeky TikTok celebration after scoring the winning goal for Tottenham against Manchester United in the Premier League. The midfielder's goal was a pointed response to Keane's recent criticism of his performances.",
      "news": [
        {
          "title": "James Maddison hits back at Roy Keane with cheeky TikTok clip after scoring against Manchester United to silence criticism",
          "description": "James Maddison hits back at Roy Keane with cheeky TikTok clip after scoring against Manchester United to silence criticism  Sportskeeda",
          "date": "Mon, 17 Feb 2025 09:48:00 GMT"
        },
        {
          "title": "How Tottenham beat Manchester United in the Premier League thanks to James Maddison's early goal",
          "description": "How Tottenham beat Manchester United in the Premier League thanks to James Maddison's early goal",
          "date": "Sun, 16 Feb 2025 21:06:42 GMT"
        },
        {
          "title": "What James Maddison has done for Ange Postecoglou and Tottenham amid Roy Keane verdict",
          "description": "What James Maddison has done for Ange Postecoglou and Tottenham amid Roy Keane verdict  Football.London",
          "date": "Mon, 17 Feb 2025 12:00:00 GMT"
        },
        {
          "title": "James Maddison: Was Tottenham midfielder's celebration a dig at Roy Keane?",
          "description": "James Maddison: Was Tottenham midfielder's celebration a dig at Roy Keane?  BBC.com",
          "date": "Sun, 16 Feb 2025 21:21:47 GMT"
        },
        {
          "title": "Premier League LIVE: Maddison hits back at Keane, Amorim claims Man United job is so hard, Liverpool...",
          "description": "Premier League LIVE: Maddison hits back at Keane, Amorim claims Man United job is so hard, Liverpool...  talkSPORT",
          "date": "Mon, 17 Feb 2025 11:01:49 GMT"
        },
        {
          "title": "James Maddison Gives Pointed Goal Celebration vs Man Utd Days After Roy Keane Criticism",
          "description": "James Maddison Gives Pointed Goal Celebration vs Man Utd Days After Roy Keane Criticism  GIVEMESPORT",
          "date": "Sun, 16 Feb 2025 17:15:00 GMT"
        },
        {
          "title": "James Maddison gives Spurs the lead against Man Utd!",
          "description": "James Maddison gives Spurs the lead against Man Utd!  Sky Sports",
          "date": "Sun, 16 Feb 2025 16:54:54 GMT"
        },
        {
          "title": "Tottenham Hotspur 1-0 Manchester United: James Maddison condemns Red Devils to yet another defeat",
          "description": "Tottenham Hotspur 1-0 Manchester United: James Maddison condemns Red Devils to yet another defeat  OneFootball",
          "date": "Sun, 16 Feb 2025 18:44:45 GMT"
        },
        {
          "title": "James Maddison fires back at Roy Keane with gesture against Man United",
          "description": "James Maddison fires back at Roy Keane with gesture against Man United  Extra.ie",
          "date": "Mon, 17 Feb 2025 10:25:33 GMT"
        },
        {
          "title": "Spurs 1-0 Man United, PL: James Maddison Relishes Match-Winning Return Against Red Devils",
          "description": "Spurs 1-0 Man United, PL: James Maddison Relishes Match-Winning Return Against Red Devils  Outlook India",
          "date": "Mon, 17 Feb 2025 02:09:26 GMT"
        }
      ]
    },
    {
      "player_id": 161585,
      "player_name": "Francisco Fernandes da Conceição",
      "trending_score": 76.0,
      "trend_summary": "Francisco Conceição's late strike propelled Juventus to a crucial 1-0 victory over Inter Milan in the Derby d'Italia, boosting Napoli's Serie A title hopes. Conceição's goal secured Juventus' first win over Inter since 2018 and ended the Nerazzurri's chance to go top of the standings.",
      "news": [
        {
          "title": "Juventus v Inter Milan live – Serie A latest as Francisco Conceicao gives hosts lead after rivals hit post twice",
          "description": "Juventus v Inter Milan live – Serie A latest as Francisco Conceicao gives hosts lead after rivals hit post twice  Eurosport COM",
          "date": "Mon, 17 Feb 2025 00:56:15 GMT"
        },
        {
          "title": "Juventus vs. Inter score, highlights: Francisco Conceicao grabs deciding goal, boost Napoli's Serie A chances",
          "description": "Juventus vs. Inter score, highlights: Francisco Conceicao grabs deciding goal, boost Napoli's Serie A chances  CBS Sports",
          "date": "Sun, 16 Feb 2025 22:14:00 GMT"
        },
        {
          "title": "Francisco Conceicao helps Juventus to Derby d’Italia victory over Inter Milan",
          "description": "Francisco Conceicao helps Juventus to Derby d’Italia victory over Inter Milan  The Independent",
          "date": "Sun, 16 Feb 2025 22:55:00 GMT"
        },
        {
          "title": "Juventus 1-0 Inter Milan: Champions miss chance to go top of Serie A",
          "description": "Juventus 1-0 Inter Milan: Champions miss chance to go top of Serie A  BBC.com",
          "date": "Mon, 17 Feb 2025 10:40:20 GMT"
        },
        {
          "title": "Juventus vs. Inter score, highlights: Francisco Conceicao grabs deciding goal, boost Napoli's Serie A chances",
          "description": "Juventus vs. Inter score, highlights: Francisco Conceicao grabs deciding goal, boost Napoli's Serie A chances  thepress.net",
          "date": "Sun, 16 Feb 2025 22:14:09 GMT"
        },
        {
          "title": "European football: Inter miss chance while racist chants halt La Liga game",
          "description": "European football: Inter miss chance while racist chants halt La Liga game  The Guardian",
          "date": "Sun, 16 Feb 2025 22:37:00 GMT"
        },
        {
          "title": "Francisco Conceicao's Late Strike Secures Vital Derby d'Italia Win for Juventus Against Inter Milan",
          "description": "Francisco Conceicao's Late Strike Secures Vital Derby d'Italia Win for Juventus Against Inter Milan  FootBoom",
          "date": "Mon, 17 Feb 2025 08:16:58 GMT"
        },
        {
          "title": "Soccer-Title-chasing Inter suffer 1-0 defeat at Juve",
          "description": "Soccer-Title-chasing Inter suffer 1-0 defeat at Juve  MSN",
          "date": "Sun, 16 Feb 2025 23:40:15 GMT"
        },
        {
          "title": "Serie A 2024-25: Title-chasing Inter fail to go top after 1-0 defeat at Juve",
          "description": "Serie A 2024-25: Title-chasing Inter fail to go top after 1-0 defeat at Juve  Sportstar",
          "date": "Mon, 17 Feb 2025 04:08:04 GMT"
        },
        {
          "title": "Serie A",
          "description": "Serie A",
          "date": "Sun, 16 Feb 2025 21:39:36 GMT"
        }
      ]
    },
    {
      "player_id": 747,
      "player_name": "Carlos Henrique Casimiro",
      "trending_score": 63.0,
      "trend_summary": "Casemiro has expressed his contentment at Manchester United and intends to fulfill his contract, while also offering guidance to former Real Madrid teammate Vinicius Junior. Despite United's recent loss to Tottenham, Casemiro has warned his ex-Real Madrid colleagues about Manchester City's enduring prowess ahead of their Champions League clash.",
      "news": [
        {
          "title": "Casemiro wants to see out contract at Manchester United: ‘I am happy’",
          "description": "Casemiro wants to see out contract at Manchester United: ‘I am happy’  The New York Times",
          "date": "Mon, 17 Feb 2025 11:59:54 GMT"
        },
        {
          "title": "Former Real Madrid teammate Casemiro tells Vinicius Junior to ‘focus on football’",
          "description": "Former Real Madrid teammate Casemiro tells Vinicius Junior to ‘focus on football’  Football Espana",
          "date": "Mon, 17 Feb 2025 12:27:08 GMT"
        },
        {
          "title": "“City aren’t at their best, but they’re City”",
          "description": "“City aren’t at their best, but they’re City”",
          "date": "Mon, 17 Feb 2025 10:42:00 GMT"
        },
        {
          "title": "Casemiro Names His Top Three Coaches, Including Ancelotti and a Frenchman",
          "description": "Casemiro Names His Top Three Coaches, Including Ancelotti and a Frenchman  FootBoom",
          "date": "Mon, 17 Feb 2025 12:37:39 GMT"
        },
        {
          "title": "Casemiro returns! Man United name team to face Tottenham",
          "description": "Casemiro returns! Man United name team to face Tottenham  Yahoo Canada Sports",
          "date": "Sun, 16 Feb 2025 15:31:00 GMT"
        },
        {
          "title": "Tottenham 1 Man Utd 0 – Maddison wins it, Garnacho’s profligacy and Casemiro creaks",
          "description": "Tottenham 1 Man Utd 0 – Maddison wins it, Garnacho’s profligacy and Casemiro creaks  The Athletic",
          "date": "Mon, 17 Feb 2025 03:51:22 GMT"
        },
        {
          "title": "“I’m going to tell you something I’ve never said in any interview”",
          "description": "“I’m going to tell you something I’ve never said in any interview”",
          "date": "Mon, 17 Feb 2025 11:31:00 GMT"
        },
        {
          "title": "Real Madrid news: Kylian Mbappe transfer SECRET revealed as Casemiro backs ace to hit 40 goals a season",
          "description": "Real Madrid news: Kylian Mbappe transfer SECRET revealed as Casemiro backs ace to hit 40 goals a season  FootballTransfers",
          "date": "Mon, 17 Feb 2025 11:00:00 GMT"
        },
        {
          "title": "'Wouldn't see these tactics in under-9s!'",
          "description": "'Wouldn't see these tactics in under-9s!'",
          "date": "Sun, 16 Feb 2025 20:07:11 GMT"
        },
        {
          "title": "Real Madrid: Casemiro's Strong Advice for Vinicius Jr to Reach New Heights",
          "description": "Real Madrid: Casemiro's Strong Advice for Vinicius Jr to Reach New Heights  FootBoom",
          "date": "Mon, 17 Feb 2025 12:03:41 GMT"
        }
      ]
    }
  ]
}