{
  "updated_at": "2025-01-13T12:19:26.960443+00:00",
  "player_news": [
    {
      "player_id": 386828,
      "player_name": "Lamine Yamal Nasraoui Ebana",
      "trending_score": 100.0,
      "trend_summary": "In the Spanish Super Cup final, 16-year-old Lamine Yamal stunned with a \"Messianic\" goal for Barcelona, equalizing against Real Madrid just moments after their opening strike. Despite his heroics, Barcelona ultimately triumphed 5-2, securing the Super Cup title and extending their dominance over their arch-rivals.",
      "news": [
        {
          "title": "Lamine Yamal, the father of Real Madrid and his 'BMV'",
          "description": "Lamine Yamal, the father of Real Madrid and his 'BMV'  FC Barcelona Noticias",
          "date": "Mon, 13 Jan 2025 03:43:00 GMT"
        },
        {
          "title": "Real Madrid vs Barcelona 2-5: Supercopa final – as it happened",
          "description": "Real Madrid vs Barcelona 2-5: Supercopa final – as it happened  Al Jazeera English",
          "date": "Sun, 12 Jan 2025 22:29:06 GMT"
        },
        {
          "title": "Lamine Yamal Channels His Inner Messi",
          "description": "Lamine Yamal Channels His Inner Messi  FootBoom",
          "date": "Sun, 12 Jan 2025 20:05:43 GMT"
        },
        {
          "title": "(WATCH) Lamine Yamal fires instant Barcelona Supercup equaliser",
          "description": "(WATCH) Lamine Yamal fires instant Barcelona Supercup equaliser  Football Espana",
          "date": "Sun, 12 Jan 2025 19:35:16 GMT"
        },
        {
          "title": "Defeat in Spanish Super Cup final",
          "description": "Defeat in Spanish Super Cup final  Real Madrid CF",
          "date": "Sun, 12 Jan 2025 21:00:00 GMT"
        },
        {
          "title": "Alan Shearer hails 'outrageous' Lamine Yamal after 16-year-old's wondergoal for Spain in Euro 2024 semi-final win over France",
          "description": "Alan Shearer hails 'outrageous' Lamine Yamal after 16-year-old's wondergoal for Spain in Euro 2024 semi-final win over France",
          "date": "Sun, 12 Jan 2025 16:59:21 GMT"
        },
        {
          "title": "Real Madrid vs. Barcelona final score: Spanish Super Cup final result, stats 10-man Barca win astonishing Clasico Supercopa final",
          "description": "Real Madrid vs. Barcelona final score: Spanish Super Cup final result, stats 10-man Barca win astonishing Clasico Supercopa final  Sporting News",
          "date": "Sun, 12 Jan 2025 21:04:03 GMT"
        },
        {
          "title": "Barcelona make history as they thump Real Madrid to break 62-year record in Spanish Super Cup El Clasico...",
          "description": "Barcelona make history as they thump Real Madrid to break 62-year record in Spanish Super Cup El Clasico...  talkSPORT",
          "date": "Sun, 12 Jan 2025 21:09:20 GMT"
        },
        {
          "title": "SUPERCUP: Spectacular 'Messianic' goal by Lamine Yamal to equalize the final",
          "description": "SUPERCUP: Spectacular 'Messianic' goal by Lamine Yamal to equalize the final  FC Barcelona Noticias",
          "date": "Sun, 12 Jan 2025 20:29:00 GMT"
        },
        {
          "title": "Barcelona thump Clasico rivals Real Madrid to win Spanish Super Cup",
          "description": "Barcelona thump Clasico rivals Real Madrid to win Spanish Super Cup  VnExpress International",
          "date": "Mon, 13 Jan 2025 06:08:47 GMT"
        }
      ]
    },
    {
      "player_id": 851,
      "player_name": "Wojciech Tomasz Szczęsny",
      "trending_score": 87.0,
      "trend_summary": "In a chaotic El Clásico, Barcelona triumphed 5-2 over Real Madrid in the Spanish Super Cup final, with goalkeeper Wojciech Szczęsny's red card proving pivotal. Szczęsny's dismissal for a reckless challenge on Robert Lewandowski sparked debate about his suitability for Barcelona, with manager Hansi Flick indicating that he may consider other options for future matches.",
      "news": [
        {
          "title": "Real Madrid vs Barcelona 2-5: Supercopa final – as it happened",
          "description": "Real Madrid vs Barcelona 2-5: Supercopa final – as it happened  Al Jazeera English",
          "date": "Sun, 12 Jan 2025 22:29:06 GMT"
        },
        {
          "title": "Wojciech Szczęsny joins Barca: A new challenge for fans' tongues",
          "description": "Wojciech Szczęsny joins Barca: A new challenge for fans' tongues  MSN",
          "date": "Mon, 13 Jan 2025 03:08:50 GMT"
        },
        {
          "title": "Szczesny's red card against Real Madrid 'resolves' the Barça debate",
          "description": "Szczesny's red card against Real Madrid 'resolves' the Barça debate  FC Barcelona Noticias",
          "date": "Sun, 12 Jan 2025 22:09:00 GMT"
        },
        {
          "title": "Hansi Flick makes Wojciech Szczesny starting point over Supercup selection",
          "description": "Hansi Flick makes Wojciech Szczesny starting point over Supercup selection  Football Espana",
          "date": "Sun, 12 Jan 2025 18:54:35 GMT"
        },
        {
          "title": "Five-star Barca smash Real Madrid to win Spanish Super Cup",
          "description": "Five-star Barca smash Real Madrid to win Spanish Super Cup  The Wellsboro Gazette",
          "date": "Mon, 13 Jan 2025 01:25:08 GMT"
        },
        {
          "title": "Real Madrid vs. Barcelona final score: Spanish Super Cup final result, stats 10-man Barca win astonishing Clasico Supercopa final",
          "description": "Real Madrid vs. Barcelona final score: Spanish Super Cup final result, stats 10-man Barca win astonishing Clasico Supercopa final  Sporting News",
          "date": "Sun, 12 Jan 2025 21:04:03 GMT"
        },
        {
          "title": "Barcelona thrash Real Madrid in chaotic clásico Spanish Super Cup final",
          "description": "Barcelona thrash Real Madrid in chaotic clásico Spanish Super Cup final  The Guardian",
          "date": "Sun, 12 Jan 2025 22:33:35 GMT"
        },
        {
          "title": "Real Madrid 2-5 FC Barcelona: summary, score, goals, highlights",
          "description": "Real Madrid 2-5 FC Barcelona: summary, score, goals, highlights",
          "date": "Sun, 12 Jan 2025 21:42:14 GMT"
        },
        {
          "title": "Szczesny implicates Barcelona in El Clásico",
          "description": "Szczesny implicates Barcelona in El Clásico  Yalla Shoot",
          "date": "Sun, 12 Jan 2025 20:42:15 GMT"
        },
        {
          "title": "Barcelona smash Real Madrid 5-2 to win Spanish Super Cup",
          "description": "Barcelona smash Real Madrid 5-2 to win Spanish Super Cup  The Straits Times",
          "date": "Mon, 13 Jan 2025 10:22:00 GMT"
        }
      ]
    },
    {
      "player_id": 521,
      "player_name": "Robert Lewandowski",
      "trending_score": 69.0,
      "trend_summary": "Robert Lewandowski's stellar performance in Barcelona's Super Cup triumph over Real Madrid, where he scored twice, has solidified his status as a key player for the Catalans. Amid transfer rumors linking Marcus Rashford to Barcelona, Lewandowski's future remains uncertain, with reports suggesting Alexander Isak could be his potential replacement.",
      "news": [
        {
          "title": "(WATCH) Robert Lewandowski and Raphinha put Barcelona in Supercup control",
          "description": "(WATCH) Robert Lewandowski and Raphinha put Barcelona in Supercup control  Yahoo Sports",
          "date": "Sun, 12 Jan 2025 19:49:00 GMT"
        },
        {
          "title": "Marcus Rashford to Barcelona until Alexander Isak could be Robert Lewandowski's replacement: Report",
          "description": "Marcus Rashford to Barcelona until Alexander Isak could be Robert Lewandowski's replacement: Report  The Week",
          "date": "Mon, 13 Jan 2025 10:32:43 GMT"
        },
        {
          "title": "Barcelona thump Clasico rivals Real Madrid to win Spanish Super Cup",
          "description": "Barcelona thump Clasico rivals Real Madrid to win Spanish Super Cup  FRANCE 24 English",
          "date": "Sun, 12 Jan 2025 21:17:11 GMT"
        },
        {
          "title": "Real Madrid vs Barcelona 2-5: Supercopa final – as it happened",
          "description": "Real Madrid vs Barcelona 2-5: Supercopa final – as it happened  Al Jazeera English",
          "date": "Sun, 12 Jan 2025 22:29:06 GMT"
        },
        {
          "title": "Bayern Munich star didn't hesitate when asked who's 'easier' to play with between Harry Kane and Robert Lewandowski",
          "description": "Bayern Munich star didn't hesitate when asked who's 'easier' to play with between Harry Kane and Robert Lewandowski  SPORTbible",
          "date": "Sun, 12 Jan 2025 13:39:42 GMT"
        },
        {
          "title": "Unexpected Twist — Lewandowski Finds out the Latest News at Barça: Surprise Departure",
          "description": "Unexpected Twist — Lewandowski Finds out the Latest News at Barça: Surprise Departure  Madrid-Barcelona.com",
          "date": "Sun, 12 Jan 2025 15:00:00 GMT"
        },
        {
          "title": "We can beat any team in the world with this kind of game. Lewandowski",
          "description": "We can beat any team in the world with this kind of game. Lewandowski  Tert.am",
          "date": "Mon, 13 Jan 2025 07:36:54 GMT"
        },
        {
          "title": "Bayern star Kingsley Coman reveals difference between playing with Harry Kane & Robert Lewandowski",
          "description": "Bayern star Kingsley Coman reveals difference between playing with Harry Kane & Robert Lewandowski  Khel Now",
          "date": "Sun, 12 Jan 2025 15:00:25 GMT"
        },
        {
          "title": "LIVE: Real Madrid vs Barcelona – Ancelotti interview, Mbappe, reaction",
          "description": "LIVE: Real Madrid vs Barcelona – Ancelotti interview, Mbappe, reaction  Al Jazeera English",
          "date": "Sun, 12 Jan 2025 17:02:48 GMT"
        },
        {
          "title": "La Liga top goal scorers 2024/25: Updated Golden Boot rankings in Spain as Lewandowski leads Pichichi chase",
          "description": "La Liga top goal scorers 2024/25: Updated Golden Boot rankings in Spain as Lewandowski leads Pichichi chase  Sporting News",
          "date": "Sun, 12 Jan 2025 17:00:00 GMT"
        }
      ]
    },
    {
      "player_id": 50132,
      "player_name": "Altay Bayındır",
      "trending_score": 54.0,
      "trend_summary": "In a thrilling FA Cup third-round clash, Manchester United's Altay Bayındır emerged as the hero, saving a crucial penalty in the shootout against Arsenal, securing a 3-5 victory for the Red Devils. The Turkish goalkeeper's heroics came after he had already impressed with a string of saves during the match, helping his team overcome a one-man deficit.",
      "news": [
        {
          "title": "Manchester United hero against Arsenal Altay Bayindir reaches FA Cup milestone after 10 years",
          "description": "Manchester United hero against Arsenal Altay Bayindir reaches FA Cup milestone after 10 years  World Soccer Talk",
          "date": "Sun, 12 Jan 2025 18:52:44 GMT"
        },
        {
          "title": "Manchester United legend Edwin van der Sar has 4-word message for Altay Bayindir after his heroics in FA Cup win against Arsenal",
          "description": "Manchester United legend Edwin van der Sar has 4-word message for Altay Bayindir after his heroics in FA Cup win against Arsenal  Sportskeeda",
          "date": "Mon, 13 Jan 2025 09:14:00 GMT"
        },
        {
          "title": "Man Utd news: Altay Bayindir after FA Cup victory",
          "description": "Man Utd news: Altay Bayindir after FA Cup victory  BBC.com",
          "date": "Sun, 12 Jan 2025 18:12:32 GMT"
        },
        {
          "title": "Altay Bayindir’s heroic performance leads Man United to FA Cup victory over Arsenal",
          "description": "Altay Bayindir’s heroic performance leads Man United to FA Cup victory over Arsenal  Türkiye Today",
          "date": "Mon, 13 Jan 2025 09:08:28 GMT"
        },
        {
          "title": "Altay Bayindir shines as 10-man Manchester United knock Arsenal out of FA Cup",
          "description": "Altay Bayindir shines as 10-man Manchester United knock Arsenal out of FA Cup  The Times of India",
          "date": "Mon, 13 Jan 2025 01:52:00 GMT"
        },
        {
          "title": "Arsenal 1-1 Man Utd (3-5 pens): Altay Bayindir saves from Kai Havertz in penalty shoot-out as 10-player FA Cup holders progress",
          "description": "Arsenal 1-1 Man Utd (3-5 pens): Altay Bayindir saves from Kai Havertz in penalty shoot-out as 10-player FA Cup holders progress  Sky Sports",
          "date": "Mon, 13 Jan 2025 09:56:22 GMT"
        },
        {
          "title": "Manchester United's Ruben Amorim on Altay Bayindir, Marcus Rashford, FA Cup win at Arsenal",
          "description": "Manchester United's Ruben Amorim on Altay Bayindir, Marcus Rashford, FA Cup win at Arsenal  NBC Sports",
          "date": "Sun, 12 Jan 2025 19:07:30 GMT"
        },
        {
          "title": "MUTV pundit hails decisive moment Manchester United star saved the game vs Arsenal, and it wasn't Altay Bayindir",
          "description": "MUTV pundit hails decisive moment Manchester United star saved the game vs Arsenal, and it wasn't Altay Bayindir  United In Focus",
          "date": "Mon, 13 Jan 2025 07:15:00 GMT"
        },
        {
          "title": "Altay Bayindir is penalty shoot-out hero as Man United beat Arsenal in FA Cup",
          "description": "Altay Bayindir is penalty shoot-out hero as Man United beat Arsenal in FA Cup  The National",
          "date": "Sun, 12 Jan 2025 19:18:45 GMT"
        },
        {
          "title": "Altay Bayindir the hero as 10-man Manchester United see off Arsenal in FA Cup third round",
          "description": "Altay Bayindir the hero as 10-man Manchester United see off Arsenal in FA Cup third round  OneFootball",
          "date": "Sun, 12 Jan 2025 23:07:19 GMT"
        }
      ]
    },
    {
      "player_id": 278,
      "player_name": "Kylian Mbappé Lottin",
      "trending_score": 49.0,
      "trend_summary": "Kylian Mbappé's impressive performance in Real Madrid's 5-2 defeat to Barcelona in the Spanish Super Cup final earned him praise from manager Carlo Ancelotti, who singled him out as the team's only standout player. Despite the loss, Mbappé's goal in the match marked his first for Real Madrid since his highly publicized transfer from Paris Saint-Germain.",
      "news": [
        {
          "title": "‘Kylian Mbappe probably the only one who played well’: Carlo Ancelotti disappointed after Real Madrid get thrashed 5-2 by Barcelona in Spanish Super Cup final",
          "description": "‘Kylian Mbappe probably the only one who played well’: Carlo Ancelotti disappointed after Real Madrid get thrashed 5-2 by Barcelona in Spanish Super Cup final  The Indian Express",
          "date": "Mon, 13 Jan 2025 12:01:35 GMT"
        },
        {
          "title": "The Mbappé Project Sinks",
          "description": "The Mbappé Project Sinks  FootBoom",
          "date": "Mon, 13 Jan 2025 10:07:00 GMT"
        },
        {
          "title": "Ancelotti says Real Madrid 'didn't work hard' in Clasico defeat but singles out Mbappe for praise",
          "description": "Ancelotti says Real Madrid 'didn't work hard' in Clasico defeat but singles out Mbappe for praise  TNT Sports",
          "date": "Mon, 13 Jan 2025 08:48:00 GMT"
        },
        {
          "title": "Barcelona star sparks anger of Real Madrid players with actions during Kylian Mbappé injury treatment",
          "description": "Barcelona star sparks anger of Real Madrid players with actions during Kylian Mbappé injury treatment  Yahoo Canada Sports",
          "date": "Sun, 12 Jan 2025 19:32:00 GMT"
        },
        {
          "title": "Kylian Mbappe is unveiled in front of 80,000 Real Madrid fans at the Santiago Bernabeu and hails move to the 'club of my dreams' after leaving PSG",
          "description": "Kylian Mbappe is unveiled in front of 80,000 Real Madrid fans at the Santiago Bernabeu and hails move to the 'club of my dreams' after leaving PSG  MSN",
          "date": "Sun, 12 Jan 2025 19:20:07 GMT"
        },
        {
          "title": "Carlo Ancelotti singles out Kylian Mbappe as Real Madrid’s only performer in Supercup disaster",
          "description": "Carlo Ancelotti singles out Kylian Mbappe as Real Madrid’s only performer in Supercup disaster  Football Espana",
          "date": "Sun, 12 Jan 2025 22:09:29 GMT"
        },
        {
          "title": "Raphinha prevents Kylian Mbappe from receiving treatment in bizarre incident before goal...",
          "description": "Raphinha prevents Kylian Mbappe from receiving treatment in bizarre incident before goal...  talkSPORT",
          "date": "Sun, 12 Jan 2025 20:28:54 GMT"
        },
        {
          "title": "Real Madrid vs Barcelona 2-5: Supercopa final – as it happened",
          "description": "Real Madrid vs Barcelona 2-5: Supercopa final – as it happened  Al Jazeera English",
          "date": "Sun, 12 Jan 2025 22:29:06 GMT"
        },
        {
          "title": "Alexander Isak deal done, Kylian Mbappe signs – Liverpool's dream transfers under Elon Musk",
          "description": "Alexander Isak deal done, Kylian Mbappe signs – Liverpool's dream transfers under Elon Musk  The Mirror",
          "date": "Mon, 13 Jan 2025 11:34:21 GMT"
        },
        {
          "title": "Kylian Mbappe opens El Clasico",
          "description": "Kylian Mbappe opens El Clasico",
          "date": "Sun, 12 Jan 2025 19:13:22 GMT"
        }
      ]
    }
  ]
}