{
  "updated_at": "2025-01-09T23:58:48.133789+00:00",
  "player_news": [
    {
      "player_id": 129718,
      "player_name": "Jude Victor William Bellingham",
      "trending_score": 100.0,
      "trend_summary": "In the Spanish Super Cup, Jude Bellingham opened the scoring for Real Madrid against Mallorca, earning the team a victory that sets up a Superclasico clash with Barcelona. The 19-year-old midfielder's performance has drawn comparisons to David Beckham, as he becomes the latest in a line of iconic players to grace the cover of adidas football boots.",
      "news": [
        {
          "title": "Jude Bellingham sets up Superclasico as Real Madrid see off Mallorca in Spanish Supercup",
          "description": "Jude Bellingham sets up Superclasico as Real Madrid see off Mallorca in Spanish Supercup  Football Espana",
          "date": "Thu, 09 Jan 2025 20:56:07 GMT"
        },
        {
          "title": "Jude Bellingham joins exclusive club with David Beckham during Real Madrid win...",
          "description": "Jude Bellingham joins exclusive club with David Beckham during Real Madrid win...  talkSPORT",
          "date": "Thu, 09 Jan 2025 21:46:27 GMT"
        },
        {
          "title": "Jude Bellingham poses as cover star for relaunch of 'iconic' adidas football boots with Real Madrid midfielder following in the footsteps of England and Los Blancos legend David Beckham",
          "description": "Jude Bellingham poses as cover star for relaunch of 'iconic' adidas football boots with Real Madrid midfielder following in the footsteps of England and Los Blancos legend David Beckham  GOAL English",
          "date": "Thu, 09 Jan 2025 16:16:00 GMT"
        },
        {
          "title": "LIVE: Real Madrid vs Mallorca 3-0: Spanish Supercopa – as it happened",
          "description": "LIVE: Real Madrid vs Mallorca 3-0: Spanish Supercopa – as it happened  Al Jazeera English",
          "date": "Thu, 09 Jan 2025 21:56:13 GMT"
        },
        {
          "title": "WATCH: Jude Bellingham fires Real Madrid ahead in Spanish Supercup",
          "description": "WATCH: Jude Bellingham fires Real Madrid ahead in Spanish Supercup  Football Espana",
          "date": "Thu, 09 Jan 2025 20:26:23 GMT"
        }
      ]
    },
    {
      "player_id": 10009,
      "player_name": "Rodrygo Silva de Goes",
      "trending_score": 94.0,
      "trend_summary": "Rodrygo starred for Real Madrid in their 3-0 victory over Mallorca, scoring a goal and assisting Jude Bellingham in the other two. The win secured Real Madrid's place in the Supercopa de España final, where they will face arch-rivals Barcelona.",
      "news": [
        {
          "title": "Real Madrid defeats Mallorca to set up Supercopa final against Barcelona",
          "description": "Real Madrid defeats Mallorca to set up Supercopa final against Barcelona  Al Jazeera English",
          "date": "Thu, 09 Jan 2025 22:09:46 GMT"
        },
        {
          "title": "Bellingham and Rodrygo sink Mallorca as Real Madrid reach Super Cup final",
          "description": "Bellingham and Rodrygo sink Mallorca as Real Madrid reach Super Cup final  The Guardian",
          "date": "Thu, 09 Jan 2025 22:06:00 GMT"
        },
        {
          "title": "Real Madrid 3-0 Mallorca: Bellingham and Rodrygo set up Barca battle in Supercopa final",
          "description": "Real Madrid 3-0 Mallorca: Bellingham and Rodrygo set up Barca battle in Supercopa final  FotMob",
          "date": "Thu, 09 Jan 2025 21:47:30 GMT"
        },
        {
          "title": "Rodrygo turns 24",
          "description": "Rodrygo turns 24  Real Madrid CF",
          "date": "Thu, 09 Jan 2025 17:05:00 GMT"
        },
        {
          "title": "Soccer-Real outclass Mallorca to set up Super Cup final v Barca",
          "description": "Soccer-Real outclass Mallorca to set up Super Cup final v Barca  MSN",
          "date": "Thu, 09 Jan 2025 22:16:01 GMT"
        }
      ]
    },
    {
      "player_id": 26302,
      "player_name": "Pablo Carmine Maffeo Becerra",
      "trending_score": 69.0,
      "trend_summary": "Pablo Maffeo, who has recently been praised by Lionel Messi as the \"toughest defender\" he has faced, was involved in a heated on-field incident with Real Madrid's Jude Bellingham during the Spanish Supercopa clash, where Bellingham allegedly touched Maffeo's head, leading to a verbal altercation between Maffeo and Marco Asensio. Additionally, Maffeo has made headlines for his bold claim that he would knock out Vinicius Jr. in a boxing match, following his impressive performance against the Real Madrid star in the Supercopa match.",
      "news": [
        {
          "title": "‘Every game’ – Real Madrid star takes aim at Mallorca’s Pablo Maffeo after Super Cup clash",
          "description": "‘Every game’ – Real Madrid star takes aim at Mallorca’s Pablo Maffeo after Super Cup clash  Yahoo Canada Sports",
          "date": "Thu, 09 Jan 2025 22:34:00 GMT"
        },
        {
          "title": "Pablo Maffeo, the hardest defender Messi’s ever faced: ‘It’s the best recognition’",
          "description": "Pablo Maffeo, the hardest defender Messi’s ever faced: ‘It’s the best recognition’",
          "date": "Thu, 09 Jan 2025 05:10:37 GMT"
        },
        {
          "title": "LIVE: Real Madrid vs Mallorca 3-0: Spanish Supercopa – as it happened",
          "description": "LIVE: Real Madrid vs Mallorca 3-0: Spanish Supercopa – as it happened  Al Jazeera English",
          "date": "Thu, 09 Jan 2025 21:56:13 GMT"
        },
        {
          "title": "Bellingham 'touched' Maffeo's head after the 3-0, who took it out on Asencio: \"Go spread videos, you idiot\"",
          "description": "Bellingham 'touched' Maffeo's head after the 3-0, who took it out on Asencio: \"Go spread videos, you idiot\"  FootBoom",
          "date": "Thu, 09 Jan 2025 22:15:20 GMT"
        },
        {
          "title": "Days after claiming he will knock Vinicius out in boxing match, Pablo Maffeo reacts to Lionel Messi once naming him as ‘toughest defender’ to face",
          "description": "Days after claiming he will knock Vinicius out in boxing match, Pablo Maffeo reacts to Lionel Messi once naming him as ‘toughest defender’ to face  Sportskeeda",
          "date": "Thu, 09 Jan 2025 07:50:00 GMT"
        }
      ]
    },
    {
      "player_id": 46738,
      "player_name": "Martin Valjent",
      "trending_score": 61.0,
      "trend_summary": "In Real Madrid's 3-0 triumph over Mallorca in the Spanish Supercopa, Martin Valjent showcased his defensive prowess, effectively containing the formidable Karim Benzema and contributing to his team's clean sheet.",
      "news": [
        {
          "title": "Real Madrid 3-0 Mallorca (9 Jan, 2025) Game Analysis",
          "description": "Real Madrid 3-0 Mallorca (9 Jan, 2025) Game Analysis",
          "date": "Thu, 09 Jan 2025 21:14:45 GMT"
        },
        {
          "title": "LIVE: Real Madrid vs Mallorca 3-0: Spanish Supercopa – as it happened",
          "description": "LIVE: Real Madrid vs Mallorca 3-0: Spanish Supercopa – as it happened  Al Jazeera English",
          "date": "Thu, 09 Jan 2025 21:56:13 GMT"
        },
        {
          "title": "Real Madrid 3–0 Mallorca: Player Ratings as Jude Bellingham Sends Los Blancos to the Spanish Super Cup Final",
          "description": "Real Madrid 3–0 Mallorca: Player Ratings as Jude Bellingham Sends Los Blancos to the Spanish Super Cup Final  Sports Illustrated",
          "date": "Thu, 09 Jan 2025 21:04:02 GMT"
        },
        {
          "title": "Bellingham and Rodrygo sink Mallorca as Real Madrid reach Super Cup final",
          "description": "Bellingham and Rodrygo sink Mallorca as Real Madrid reach Super Cup final  The Guardian",
          "date": "Thu, 09 Jan 2025 22:06:00 GMT"
        },
        {
          "title": "Real Madrid thrashes Mallorca and will face Barça in the Supercopa final (3-0)",
          "description": "Real Madrid thrashes Mallorca and will face Barça in the Supercopa final (3-0)  FC Barcelona Noticias",
          "date": "Thu, 09 Jan 2025 20:58:00 GMT"
        }
      ]
    },
    {
      "player_id": 762,
      "player_name": "Vinícius José Paixão de Oliveira Júnior",
      "trending_score": 47.0,
      "trend_summary": "Real Madrid star Vinicius Junior faces transfer speculation ahead of a potential Saudi Arabian mega-deal, despite his suspension not affecting his availability for the Spanish Super Cup semi-final against Mallorca. The Brazilian winger has set a date for contract talks with Real Madrid amid growing optimism from Saudi Arabia about his potential departure.",
      "news": [
        {
          "title": "LIVE: Real Madrid vs Mallorca 3-0: Spanish Supercopa – as it happened",
          "description": "LIVE: Real Madrid vs Mallorca 3-0: Spanish Supercopa – as it happened  Al Jazeera English",
          "date": "Thu, 09 Jan 2025 21:56:13 GMT"
        },
        {
          "title": "Real Madrid set to face ANOTHER huge transfer from Saudi Arabia for Vinicius Junior",
          "description": "Real Madrid set to face ANOTHER huge transfer from Saudi Arabia for Vinicius Junior  FootballTransfers",
          "date": "Thu, 09 Jan 2025 20:30:00 GMT"
        },
        {
          "title": "Will Vinicius Junior play for Real Madrid in Spanish Super Cup semi-final vs Mallorca?",
          "description": "Will Vinicius Junior play for Real Madrid in Spanish Super Cup semi-final vs Mallorca?  Firstpost",
          "date": "Thu, 09 Jan 2025 13:56:41 GMT"
        },
        {
          "title": "Real Madrid set date for Vinicius Junior contract talks amid Saudi Arabian optimism",
          "description": "Real Madrid set date for Vinicius Junior contract talks amid Saudi Arabian optimism  Football Espana",
          "date": "Thu, 09 Jan 2025 15:27:31 GMT"
        },
        {
          "title": "Vinicius Junior to Feature for Real Madrid in Spanish Super Cup Despite Suspension",
          "description": "Vinicius Junior to Feature for Real Madrid in Spanish Super Cup Despite Suspension  FootBoom",
          "date": "Thu, 09 Jan 2025 12:03:23 GMT"
        }
      ]
    }
  ]
}