{
  "updated_at": "2025-01-24T23:58:48.382599+00:00",
  "player_news": [
    {
      "player_id": 627,
      "player_name": "Kyle Andrew Walker",
      "trending_score": 100.0,
      "trend_summary": "Kyle Walker has departed Manchester City on a loan deal until the end of the season, joining Italian giants AC Milan. The experienced defender, who has been a key player for Pep Guardiola's side since 2017, has expressed gratitude for his time at the Etihad Stadium while acknowledging the need for a new challenge.",
      "news": [
        {
          "title": "Kyle Walker: AC Milan complete loan deal for Man City captain",
          "description": "Kyle Walker: AC Milan complete loan deal for Man City captain  BBC.com",
          "date": "Fri, 24 Jan 2025 19:33:04 GMT"
        },
        {
          "title": "Kyle Walker transfer: Man City defender is one of Pep Guardiola's most trusted players",
          "description": "Kyle Walker transfer: Man City defender is one of Pep Guardiola's most trusted players",
          "date": "Fri, 24 Jan 2025 23:18:04 GMT"
        },
        {
          "title": "Walker leaves Man City to join Milan on loan deal until end of season",
          "description": "Walker leaves Man City to join Milan on loan deal until end of season  Eurosport COM",
          "date": "Fri, 24 Jan 2025 19:38:00 GMT"
        },
        {
          "title": "Kyle Walker completes loan move to AC Milan",
          "description": "Kyle Walker completes loan move to AC Milan  OneFootball",
          "date": "Fri, 24 Jan 2025 20:34:58 GMT"
        },
        {
          "title": "Kyle Walker grateful for Manchester City 'dream' after sealing AC Milan loan move",
          "description": "Kyle Walker grateful for Manchester City 'dream' after sealing AC Milan loan move  The Independent",
          "date": "Fri, 24 Jan 2025 19:41:00 GMT"
        },
        {
          "title": "Kyle Walker says farewell to Man City: Star sends touching message to wife Annie Kilner and his family in 253-",
          "description": "Kyle Walker says farewell to Man City: Star sends touching message to wife Annie Kilner and his family in 253-  Daily Mail",
          "date": "Fri, 24 Jan 2025 19:32:41 GMT"
        },
        {
          "title": "Official: Milan sign Kyle Walker from Manchester City",
          "description": "Official: Milan sign Kyle Walker from Manchester City  Football Italia",
          "date": "Fri, 24 Jan 2025 19:41:15 GMT"
        },
        {
          "title": "Guardiola pays heartfelt thank you to Kyle Walker as defender joins AC Milan",
          "description": "Guardiola pays heartfelt thank you to Kyle Walker as defender joins AC Milan  Hayters",
          "date": "Fri, 24 Jan 2025 22:30:00 GMT"
        },
        {
          "title": "Kyle Walker Set to Depart Manchester City on Loan to AC Milan",
          "description": "Kyle Walker Set to Depart Manchester City on Loan to AC Milan  FootBoom",
          "date": "Fri, 24 Jan 2025 23:50:18 GMT"
        },
        {
          "title": "Pep Guardiola's four-word parting message to Kyle Walker says it all about Man City future",
          "description": "Pep Guardiola's four-word parting message to Kyle Walker says it all about Man City future  The Mirror",
          "date": "Fri, 24 Jan 2025 22:30:00 GMT"
        }
      ]
    },
    {
      "player_id": 30488,
      "player_name": "Riccardo Orsolini",
      "trending_score": 50.0,
      "trend_summary": "AC Milan is reportedly eyeing a swap deal with Bologna to acquire Riccardo Orsolini, following the club's recent signing of Kyle Walker. Orsolini, who has been a key player for Bologna, has been linked with a move to Milan for some time, and this latest news suggests that a deal could be close.",
      "news": [
        {
          "title": "Milan targeting Orsolini swap deal with Bologna after Walker",
          "description": "Milan targeting Orsolini swap deal with Bologna after Walker  Football Italia",
          "date": "Fri, 24 Jan 2025 22:40:48 GMT"
        }
      ]
    },
    {
      "player_id": 323936,
      "player_name": "Matías Soulé Malvano",
      "trending_score": 49.0,
      "trend_summary": "Amidst rumors of a potential loan move to Galatasaray, Matías Soulé has sparked interest from the Turkish giants. The Argentine winger, who has been capped at youth level for his country, has impressed with his performances for Juventus' youth teams and is now reportedly on the radar of several clubs across Europe.",
      "news": [
        {
          "title": "Galatasaray inquire about Matias Soulé",
          "description": "Galatasaray inquire about Matias Soulé  OneFootball",
          "date": "Fri, 24 Jan 2025 20:46:49 GMT"
        },
        {
          "title": "Galatasaray inquire about Matias Soulé",
          "description": "Galatasaray inquire about Matias Soulé  Yahoo Sports",
          "date": "Fri, 24 Jan 2025 20:33:00 GMT"
        }
      ]
    },
    {
      "player_id": 629,
      "player_name": "Kevin De Bruyne",
      "trending_score": 36.0,
      "trend_summary": "Kevin De Bruyne's fitness has improved, and he has issued a warning to Arsenal and Liverpool ahead of crucial Premier League matches. Despite ongoing contract talks being disrupted by an injury, De Bruyne has been praised for his key role in Manchester City's recent resurgence.",
      "news": [
        {
          "title": "Pep Guardiola issues major triple injury update on Kevin De Bruyne, Kyle Walker, and Oscar Bobb",
          "description": "Pep Guardiola issues major triple injury update on Kevin De Bruyne, Kyle Walker, and Oscar Bobb  OneFootball",
          "date": "Fri, 24 Jan 2025 20:59:44 GMT"
        },
        {
          "title": "Manchester City boss Pep Guardiola says opponents no longer scared of his side",
          "description": "Manchester City boss Pep Guardiola says opponents no longer scared of his side  BBC.com",
          "date": "Fri, 24 Jan 2025 22:30:10 GMT"
        },
        {
          "title": "Injury disrupts De Bruyne’s contract talks with City",
          "description": "Injury disrupts De Bruyne’s contract talks with City  OneFootball",
          "date": "Fri, 24 Jan 2025 17:36:52 GMT"
        },
        {
          "title": "Premier League player stats: Palmer most key passes, Salah leads goals and assists",
          "description": "Premier League player stats: Palmer most key passes, Salah leads goals and assists  Football365",
          "date": "Fri, 24 Jan 2025 21:58:14 GMT"
        },
        {
          "title": "Premier League: Erling Haaland, Kevin de Bruyne, Son Heung-min",
          "description": "Premier League: Erling Haaland, Kevin de Bruyne, Son Heung-min",
          "date": "Fri, 24 Jan 2025 13:32:53 GMT"
        },
        {
          "title": "This is the beginning of the end for four Man City legends",
          "description": "This is the beginning of the end for four Man City legends  inews",
          "date": "Fri, 24 Jan 2025 10:33:32 GMT"
        },
        {
          "title": "New Belgium coach Garcia hopes for Courtois return",
          "description": "New Belgium coach Garcia hopes for Courtois return  The Straits Times",
          "date": "Fri, 24 Jan 2025 12:57:17 GMT"
        },
        {
          "title": "“I feel like I’m back” – Kevin De Bruyne’s fitness admission is a stern warning to Arsenal and Liverpool",
          "description": "“I feel like I’m back” – Kevin De Bruyne’s fitness admission is a stern warning to Arsenal and Liverpool  OneFootball",
          "date": "Fri, 24 Jan 2025 12:28:35 GMT"
        },
        {
          "title": "Man City's upturn in form has given them emphatic answer to major contract dilemma",
          "description": "Man City's upturn in form has given them emphatic answer to major contract dilemma  MSN",
          "date": "Fri, 24 Jan 2025 06:31:52 GMT"
        },
        {
          "title": "Will the new driver finally be able to drive the expensive Belgian limousine?",
          "description": "Will the new driver finally be able to drive the expensive Belgian limousine?  Mozzart Sport",
          "date": "Fri, 24 Jan 2025 10:28:47 GMT"
        }
      ]
    },
    {
      "player_id": 284324,
      "player_name": "Alejandro Garnacho Ferreyra",
      "trending_score": 36.0,
      "trend_summary": "Manchester United's Alejandro Garnacho has sparked transfer speculation with Chelsea reportedly preparing a bid for the 18-year-old winger, who has recently impressed with his performances for the Red Devils. Amidst the rumors, United has reportedly identified 18-year-old Premier League sensation Christopher Nkunku as a potential replacement for Garnacho if he departs.",
      "news": [
        {
          "title": "Kobbie Mainoo: Alejandro Garnacho didn't prepare me for favourite Manchester United celebration",
          "description": "Kobbie Mainoo: Alejandro Garnacho didn't prepare me for favourite Manchester United celebration  Eurosport COM",
          "date": "Fri, 24 Jan 2025 12:19:25 GMT"
        },
        {
          "title": "Alejandro Garnacho sends seven-word Man Utd message as Chelsea transfer links grow",
          "description": "Alejandro Garnacho sends seven-word Man Utd message as Chelsea transfer links grow  Football.London",
          "date": "Fri, 24 Jan 2025 11:46:48 GMT"
        },
        {
          "title": "Man Utd may raid Chelsea in retaliation to Blues eyeing £70m Alejandro Garnacho",
          "description": "Man Utd may raid Chelsea in retaliation to Blues eyeing £70m Alejandro Garnacho  Express",
          "date": "Fri, 24 Jan 2025 22:28:00 GMT"
        },
        {
          "title": "‘More than embarrassing!’ – talkSPORT host left disgusted by Man United’s decision to sell Alejandro Garnac...",
          "description": "‘More than embarrassing!’ – talkSPORT host left disgusted by Man United’s decision to sell Alejandro Garnac...  talkSPORT",
          "date": "Fri, 24 Jan 2025 22:24:54 GMT"
        },
        {
          "title": "Manchester United earmark Christopher Nkunku as potential transfer target as Chelsea ponder Alejandro Garnacho move",
          "description": "Manchester United earmark Christopher Nkunku as potential transfer target as Chelsea ponder Alejandro Garnacho move  Sky Sports",
          "date": "Fri, 24 Jan 2025 19:17:26 GMT"
        },
        {
          "title": "Manchester United could consider signing 18-year-old Premier League sensation to replace Chelsea-linked Alejandro Garnacho: Reports",
          "description": "Manchester United could consider signing 18-year-old Premier League sensation to replace Chelsea-linked Alejandro Garnacho: Reports  Sportskeeda",
          "date": "Fri, 24 Jan 2025 12:28:00 GMT"
        },
        {
          "title": "Transfer news LIVE! Chelsea prepare Garnacho bid and Arsenal latest",
          "description": "Transfer news LIVE! Chelsea prepare Garnacho bid and Arsenal latest  The Independent",
          "date": "Fri, 24 Jan 2025 23:55:54 GMT"
        },
        {
          "title": "Enzo Maresca cools speculation regarding Chelsea's potential move for Alejandro Garnacho",
          "description": "Enzo Maresca cools speculation regarding Chelsea's potential move for Alejandro Garnacho  Flashscore.com",
          "date": "Fri, 24 Jan 2025 14:51:57 GMT"
        },
        {
          "title": "Alejandro Garnacho signs, Dusan Vlahovic transfer sealed",
          "description": "Alejandro Garnacho signs, Dusan Vlahovic transfer sealed",
          "date": "Fri, 24 Jan 2025 07:50:39 GMT"
        },
        {
          "title": "Man Utd reveal interest in signing Chelsea star during Alejandro Garnacho talks",
          "description": "Man Utd reveal interest in signing Chelsea star during Alejandro Garnacho talks  Metro.co.uk",
          "date": "Fri, 24 Jan 2025 16:45:00 GMT"
        }
      ]
    }
  ]
}