{
  "updated_at": "2025-02-15T12:17:19.252723+00:00",
  "player_news": [
    {
      "player_id": 106835,
      "player_name": "Kaoru Mitoma",
      "trending_score": 100.0,
      "trend_summary": "Kaoru Mitoma's sensational solo goal steered Brighton to a resounding 3-0 victory over Chelsea in the Premier League, leaving Jamie Carragher stunned and drawing comparisons to Lionel Messi's brilliance. The Japanese winger's \"impeccable touch\" and \"Messi-like\" strike have propelled Brighton to a second win over Chelsea in a week, further cementing their status as a formidable force in English football.",
      "news": [
        {
          "title": "Football: Kaoru Mitoma wonder goal steers Brighton past Chelsea",
          "description": "Football: Kaoru Mitoma wonder goal steers Brighton past Chelsea  Kyodo News Plus",
          "date": "Sat, 15 Feb 2025 06:45:46 GMT"
        },
        {
          "title": "'Impeccable touch'",
          "description": "'Impeccable touch'",
          "date": "Fri, 14 Feb 2025 23:40:00 GMT"
        },
        {
          "title": "Kaoru Mitoma drills Brighton 1-0 in front of Chelsea",
          "description": "Kaoru Mitoma drills Brighton 1-0 in front of Chelsea  NBC Sports",
          "date": "Fri, 14 Feb 2025 20:56:11 GMT"
        },
        {
          "title": "How Minteh double and superb Mitoma strike saw Brighton defeat dire Chelsea for the second time in a week",
          "description": "How Minteh double and superb Mitoma strike saw Brighton defeat dire Chelsea for the second time in a week  The Athletic",
          "date": "Fri, 14 Feb 2025 17:29:17 GMT"
        },
        {
          "title": "'That's Messi-like!'",
          "description": "'That's Messi-like!'",
          "date": "Fri, 14 Feb 2025 20:37:48 GMT"
        },
        {
          "title": "Kaoru Mitoma scores incredible solo goal for Brighton after ‘greatest first touch of all-time’ as Jamie Carragher left speechless",
          "description": "Kaoru Mitoma scores incredible solo goal for Brighton after ‘greatest first touch of all-time’ as Jamie Carragher left speechless  SPORTbible",
          "date": "Fri, 14 Feb 2025 20:51:18 GMT"
        },
        {
          "title": "Brighton 3-0 Chelsea: Kaoru Mitoma and Yankuba Minteh stun Enzo Maresca's side in Premier League win",
          "description": "Brighton 3-0 Chelsea: Kaoru Mitoma and Yankuba Minteh stun Enzo Maresca's side in Premier League win  Sky Sports",
          "date": "Fri, 14 Feb 2025 22:06:35 GMT"
        },
        {
          "title": "‘Worst performance’: Chelsea’s season could ‘unravel’ after dismal defeat to Brighton",
          "description": "‘Worst performance’: Chelsea’s season could ‘unravel’ after dismal defeat to Brighton  Fox Sports",
          "date": "Fri, 14 Feb 2025 23:58:51 GMT"
        },
        {
          "title": "Watch: Kaoru Mitoma's stunning strike against Chelsea",
          "description": "Watch: Kaoru Mitoma's stunning strike against Chelsea",
          "date": "Fri, 14 Feb 2025 20:43:00 GMT"
        },
        {
          "title": "Jamie Carragher criticises three Chelsea stars over Kaoru Mitoma goal for Brighton",
          "description": "Jamie Carragher criticises three Chelsea stars over Kaoru Mitoma goal for Brighton  Metro.co.uk",
          "date": "Fri, 14 Feb 2025 20:59:00 GMT"
        }
      ]
    },
    {
      "player_id": 153407,
      "player_name": "Nathan Jerome Chatoyer Butler-Oyedeji",
      "trending_score": 47.0,
      "trend_summary": "Despite Arsenal's injury crisis, young forward Nathan Butler-Oyedeji has been called up to the first team and named on the bench for the match against Leicester, suggesting he could get a chance to impress manager Mikel Arteta. Butler-Oyedeji has been training with the first team alongside fellow academy player Ismeal Kabia, as Arsenal looks for options to fill the void left by Kai Havertz's hamstring injury.",
      "news": [
        {
          "title": "Arteta suggests young Arsenal forwards will get a chance to impress amid injury nightmare",
          "description": "Arteta suggests young Arsenal forwards will get a chance to impress amid injury nightmare  Hayters",
          "date": "Fri, 14 Feb 2025 22:30:00 GMT"
        },
        {
          "title": "Ismeal Kabia and Nathan Butler-Oyedeji train with Arsenal first-team ahead of Leicester game",
          "description": "Ismeal Kabia and Nathan Butler-Oyedeji train with Arsenal first-team ahead of Leicester game  Jeorge Bird's Arsenal Youth",
          "date": "Fri, 14 Feb 2025 16:14:52 GMT"
        },
        {
          "title": "Nathan Butler-Oyedeji named on bench as Arsenal face Leicester",
          "description": "Nathan Butler-Oyedeji named on bench as Arsenal face Leicester  Jeorge Bird's Arsenal Youth",
          "date": "Sat, 15 Feb 2025 11:15:50 GMT"
        },
        {
          "title": "Kai Havertz: Arsenal forward's hamstring injury deepens crisis, so what does Mikel Arteta do in attack now?",
          "description": "Kai Havertz: Arsenal forward's hamstring injury deepens crisis, so what does Mikel Arteta do in attack now?  Sky Sports",
          "date": "Sat, 15 Feb 2025 10:35:12 GMT"
        },
        {
          "title": "'It's an option'",
          "description": "'It's an option'",
          "date": "Sat, 15 Feb 2025 12:05:00 GMT"
        },
        {
          "title": "Arsenal's Myles Lewis-Skelly out to break Gael Clichy record in Leicester Premier League clash",
          "description": "Arsenal's Myles Lewis-Skelly out to break Gael Clichy record in Leicester Premier League clash  Sports Mole",
          "date": "Fri, 14 Feb 2025 23:40:00 GMT"
        },
        {
          "title": "3 players who can take up Kai Havertz’s striking role at Arsenal",
          "description": "3 players who can take up Kai Havertz’s striking role at Arsenal  FirstSportz",
          "date": "Fri, 14 Feb 2025 13:26:00 GMT"
        }
      ]
    },
    {
      "player_id": 181812,
      "player_name": "Jamal Musiala",
      "trending_score": 41.0,
      "trend_summary": "Jamal Musiala has penned a historic contract extension with Bayern Munich, tying him to the club until 2030. The new deal reportedly includes an intriguing release clause, while also opening the door for Chelsea to potentially re-sign the German international in the future.",
      "news": [
        {
          "title": "Jamal Musiala’s release clause at Bayern Munich revealed...and there’s an interesting twist",
          "description": "Jamal Musiala’s release clause at Bayern Munich revealed...and there’s an interesting twist  Bavarian Football Works",
          "date": "Sat, 15 Feb 2025 11:00:00 GMT"
        },
        {
          "title": "Bayern Munich Extends Jamal Musiala's Contract Until 2030",
          "description": "Bayern Munich Extends Jamal Musiala's Contract Until 2030  FootBoom",
          "date": "Sat, 15 Feb 2025 09:50:58 GMT"
        },
        {
          "title": "Jamal Musiala: Germany international signs historic lucrative contract extension at Bayern Munich",
          "description": "Jamal Musiala: Germany international signs historic lucrative contract extension at Bayern Munich  BBC.com",
          "date": "Fri, 14 Feb 2025 17:52:22 GMT"
        },
        {
          "title": "Goodbye to the 'soap opera' Musiala! Bayern Munich renews Jamal until 2030",
          "description": "Goodbye to the 'soap opera' Musiala! Bayern Munich renews Jamal until 2030  FC Barcelona Noticias",
          "date": "Fri, 14 Feb 2025 14:03:00 GMT"
        },
        {
          "title": "How new Bayern Munich contract of Jamal Musiala has given a chance to Chelsea to re-sign him",
          "description": "How new Bayern Munich contract of Jamal Musiala has given a chance to Chelsea to re-sign him  Sporting News",
          "date": "Fri, 14 Feb 2025 14:06:41 GMT"
        },
        {
          "title": "Official",
          "description": "Official",
          "date": "Fri, 14 Feb 2025 14:46:37 GMT"
        },
        {
          "title": "Bayern Munich ties star player Jamal Musiala to contract until 2030",
          "description": "Bayern Munich ties star player Jamal Musiala to contract until 2030  India Today",
          "date": "Fri, 14 Feb 2025 17:04:06 GMT"
        },
        {
          "title": "Bayern Munich Extends Jamal Musiala with Mega Contract",
          "description": "Bayern Munich Extends Jamal Musiala with Mega Contract  MSN",
          "date": "Fri, 14 Feb 2025 15:50:15 GMT"
        },
        {
          "title": "Germany star Jamal Musiala signs new five-year deal with Bayern Munich",
          "description": "Germany star Jamal Musiala signs new five-year deal with Bayern Munich  Flashscore.com",
          "date": "Fri, 14 Feb 2025 13:28:35 GMT"
        },
        {
          "title": "Jamal Musiala Signs Contract Extension With Bayern Until 2030",
          "description": "Jamal Musiala Signs Contract Extension With Bayern Until 2030  Evrim Ağacı",
          "date": "Fri, 14 Feb 2025 13:02:17 GMT"
        }
      ]
    },
    {
      "player_id": 47380,
      "player_name": "Marc Cucurella Saseta",
      "trending_score": 41.0,
      "trend_summary": "Marc Cucurella endured a dismal performance in Chelsea's humiliating 3-0 defeat to Brighton, earning a meager 5/10 rating from OneFootball Indonesia. The left-back's struggles have drawn criticism from pundits like Jamie Carragher, who labeled him \"awful\" after Chelsea's recent poor defensive displays.",
      "news": [
        {
          "title": "Pedro Neto furious reaction to Marc Cucurella moment speaks volumes for Chelsea and Enzo Maresca",
          "description": "Pedro Neto furious reaction to Marc Cucurella moment speaks volumes for Chelsea and Enzo Maresca  Football.London",
          "date": "Sat, 15 Feb 2025 12:06:44 GMT"
        },
        {
          "title": "Chelsea player ratings vs Brighton: Marc Cucurella and Filip Jorgensen flop in humiliating loss as Cole Palmer and Christopher Nkunku are kept silent by sublime Seagulls",
          "description": "Chelsea player ratings vs Brighton: Marc Cucurella and Filip Jorgensen flop in humiliating loss as Cole Palmer and Christopher Nkunku are kept silent by sublime Seagulls  Goal.com",
          "date": "Fri, 14 Feb 2025 22:01:00 GMT"
        },
        {
          "title": "Chelsea player ratings: 2/10 in defence as Palmer fails to deliver again",
          "description": "Chelsea player ratings: 2/10 in defence as Palmer fails to deliver again  Evening Standard",
          "date": "Sat, 15 Feb 2025 09:30:43 GMT"
        },
        {
          "title": "Minteh Emerges as Premier League Sensation Amid Chelsea’s Struggles",
          "description": "Minteh Emerges as Premier League Sensation Amid Chelsea’s Struggles  FootBoom",
          "date": "Sat, 15 Feb 2025 09:35:02 GMT"
        },
        {
          "title": "Not just Jorgensen: Chelsea must axe 4/10 star who Carragher called \"awful\"",
          "description": "Not just Jorgensen: Chelsea must axe 4/10 star who Carragher called \"awful\"  FootballFanCast.com",
          "date": "Sat, 15 Feb 2025 06:45:00 GMT"
        },
        {
          "title": "Mitoma shines as Brighton beat shot-shy Chelsea 3-0",
          "description": "Mitoma shines as Brighton beat shot-shy Chelsea 3-0  The Straits Times",
          "date": "Fri, 14 Feb 2025 23:20:00 GMT"
        },
        {
          "title": "Chelsea thrashed by Brighton, Iga Swiatek’s Qatar KO, scoreless rugby clash",
          "description": "Chelsea thrashed by Brighton, Iga Swiatek’s Qatar KO, scoreless rugby clash  South China Morning Post",
          "date": "Sat, 15 Feb 2025 00:30:07 GMT"
        },
        {
          "title": "How Minteh double and superb Mitoma strike saw Brighton defeat dire Chelsea for the second time in a week",
          "description": "How Minteh double and superb Mitoma strike saw Brighton defeat dire Chelsea for the second time in a week  The Athletic",
          "date": "Fri, 14 Feb 2025 17:29:17 GMT"
        },
        {
          "title": "Cucurella Gets 5, Chalobah With 4.5",
          "description": "Cucurella Gets 5, Chalobah With 4.5",
          "date": "Fri, 14 Feb 2025 22:43:49 GMT"
        },
        {
          "title": "Brighton v Chelsea",
          "description": "Brighton v Chelsea",
          "date": "Fri, 14 Feb 2025 21:56:18 GMT"
        }
      ]
    },
    {
      "player_id": 152982,
      "player_name": "Cole Jermaine Palmer",
      "trending_score": 35.0,
      "trend_summary": "Chelsea's Cole Palmer is set to play in the Champions League next season, with rumors swirling that he could join Chelsea's rivals if they fail to secure a top-four finish in the Premier League. Despite his impressive performances, Palmer has expressed frustration with his playing time, leading to speculation that he may leave the club if the situation doesn't improve.",
      "news": [
        {
          "title": "Cole Palmer will play Champions League football next season – whether he’s at Chelsea or not...",
          "description": "Cole Palmer will play Champions League football next season – whether he’s at Chelsea or not...  talkSPORT",
          "date": "Sat, 15 Feb 2025 09:36:50 GMT"
        },
        {
          "title": "Chelsea could lose Cole Palmer without Champions League football",
          "description": "Chelsea could lose Cole Palmer without Champions League football  GIVEMESPORT",
          "date": "Sat, 15 Feb 2025 10:00:37 GMT"
        },
        {
          "title": "Cole Palmer Set for Champions League Football Next Season",
          "description": "Cole Palmer Set for Champions League Football Next Season  FootBoom",
          "date": "Sat, 15 Feb 2025 05:03:05 GMT"
        },
        {
          "title": "Why Cole Palmer shouted at Noni Madueke twice as worrying Chelsea reality can't be ignored again",
          "description": "Why Cole Palmer shouted at Noni Madueke twice as worrying Chelsea reality can't be ignored again  Football.London",
          "date": "Sat, 15 Feb 2025 07:00:00 GMT"
        },
        {
          "title": "(Image) Cole Palmer ranks ahead of Kane, Haaland and Lewandowski in incredible stat",
          "description": "(Image) Cole Palmer ranks ahead of Kane, Haaland and Lewandowski in incredible stat  OneFootball",
          "date": "Fri, 14 Feb 2025 20:38:21 GMT"
        },
        {
          "title": "Jamie Carragher: Chelsea could lose Cole Palmer without Champions League football",
          "description": "Jamie Carragher: Chelsea could lose Cole Palmer without Champions League football  Sky Sports",
          "date": "Fri, 14 Feb 2025 22:57:51 GMT"
        },
        {
          "title": "Jamie Carragher questions whether Chelsea can keep Cole Palmer happy if they miss out on Champions League spot",
          "description": "Jamie Carragher questions whether Chelsea can keep Cole Palmer happy if they miss out on Champions League spot  Daily Mail",
          "date": "Fri, 14 Feb 2025 23:45:25 GMT"
        },
        {
          "title": "Every word Enzo Maresca said on Chelsea loss, Cole Palmer body language, fan chants",
          "description": "Every word Enzo Maresca said on Chelsea loss, Cole Palmer body language, fan chants  Yahoo Eurosport UK",
          "date": "Fri, 14 Feb 2025 23:08:37 GMT"
        },
        {
          "title": "Cole Palmer tipped to LEAVE Chelsea after Brighton disaster",
          "description": "Cole Palmer tipped to LEAVE Chelsea after Brighton disaster  FootballTransfers",
          "date": "Sat, 15 Feb 2025 09:15:00 GMT"
        },
        {
          "title": "Chelsea news: Has Cole Palmer become lukewarm?",
          "description": "Chelsea news: Has Cole Palmer become lukewarm?  BBC.com",
          "date": "Fri, 14 Feb 2025 12:57:07 GMT"
        }
      ]
    }
  ]
}