{
  "updated_at": "2025-03-23T23:57:32.540440+00:00",
  "player_news": [
    {
      "player_id": 386828,
      "player_name": "Lamine Yamal Nasraoui Ebana",
      "trending_score": 100.0,
      "trend_summary": "Lamine Yamal scored a clutch goal in extra time against the Netherlands in the UEFA Nations League Quarterfinals. Spain ultimately advanced to the semi-finals after a dramatic penalty shootout victory, where they will face France.\n",
      "news": [
        {
          "title": "Video: Lamine Yamal scores clutch goal for Spain against Netherlands in extra time",
          "description": "Video: Lamine Yamal scores clutch goal for Spain against Netherlands in extra time  Bolavip US",
          "date": "Sun, 23 Mar 2025 22:07:33 GMT"
        },
        {
          "title": "WATCH: Lamine Yamal fires Spain in front in extra time against The Netherlands",
          "description": "WATCH: Lamine Yamal fires Spain in front in extra time against The Netherlands  Football Espana",
          "date": "Sun, 23 Mar 2025 21:59:23 GMT"
        },
        {
          "title": "Spain 3-3 Netherlands: La Roja advances to the 'final four' of the Nations League on penalties",
          "description": "Spain 3-3 Netherlands: La Roja advances to the 'final four' of the Nations League on penalties  FC Barcelona Noticias",
          "date": "Sun, 23 Mar 2025 22:39:00 GMT"
        },
        {
          "title": "Spain 3-3 Netherlands: Player Ratings and Match Highlights",
          "description": "Spain 3-3 Netherlands: Player Ratings and Match Highlights  GIVEMESPORT",
          "date": "Sun, 23 Mar 2025 22:31:00 GMT"
        },
        {
          "title": "Spain 3-3 Netherlands (agg: 5-5, 5-4 on pens): Hosts edge dramatic tie to reach semi-finals",
          "description": "Spain 3-3 Netherlands (agg: 5-5, 5-4 on pens): Hosts edge dramatic tie to reach semi-finals  BBC",
          "date": "Sun, 23 Mar 2025 22:50:00 GMT"
        },
        {
          "title": "Spain vs Netherlands Highlights, UEFA Nations League Quarterfinals second leg: ESP 5-4 NED (pen); La Roja enter semifinals",
          "description": "Spain vs Netherlands Highlights, UEFA Nations League Quarterfinals second leg: ESP 5-4 NED (pen); La Roja enter semifinals  Sportstar",
          "date": "Sun, 23 Mar 2025 22:18:45 GMT"
        },
        {
          "title": "Nations League 'semis' defined: Spain will face France again",
          "description": "Nations League 'semis' defined: Spain will face France again  FC Barcelona Noticias",
          "date": "Sun, 23 Mar 2025 23:09:35 GMT"
        },
        {
          "title": "Scotland 0-3 Greece, Spain squeeze past Netherlands, Germany beat Italy, and more: Nations League – live",
          "description": "Scotland 0-3 Greece, Spain squeeze past Netherlands, Germany beat Italy, and more: Nations League – live  The Guardian",
          "date": "Sun, 23 Mar 2025 16:34:00 GMT"
        },
        {
          "title": "Lamine Yamal: Barcelona Prodigy Wins Kopa Trophy at Ballon d’Or Ceremony",
          "description": "Lamine Yamal: Barcelona Prodigy Wins Kopa Trophy at Ballon d’Or Ceremony  MSN",
          "date": "Sun, 23 Mar 2025 05:50:04 GMT"
        },
        {
          "title": "Harry Kane release clause, Liverpool transfer interest and stance on Premier League return",
          "description": "Harry Kane release clause, Liverpool transfer interest and stance on Premier League return  The Mirror",
          "date": "Sun, 23 Mar 2025 17:46:00 GMT"
        }
      ]
    },
    {
      "player_id": 24953,
      "player_name": "Yann Aurel Ludger Bisseck",
      "trending_score": 63.0,
      "trend_summary": "Inter Milan's Yann Aurel Bisseck has earned his first call-up to the German national team, a testament to his perseverance. While team news suggests Kleindienst may feature in the second leg of the UEFA Nations League quarterfinal against Italy, Bisseck's specific role remains unconfirmed.\n",
      "news": [
        {
          "title": "Inter Milan Defender Yann Bisseck After First Germany Call-Up: “I Never Gave Up”",
          "description": "Inter Milan Defender Yann Bisseck After First Germany Call-Up: “I Never Gave Up”  SempreInter.com",
          "date": "Sun, 23 Mar 2025 12:29:07 GMT"
        },
        {
          "title": "Germany vs. Italy lineups, confirmed starting 11, confirmed team news, injuries: Kleindienst a 2nd-leg option for UEFA Nations League quarterfinal",
          "description": "Germany vs. Italy lineups, confirmed starting 11, confirmed team news, injuries: Kleindienst a 2nd-leg option for UEFA Nations League quarterfinal  Sporting News",
          "date": "Sun, 23 Mar 2025 18:57:00 GMT"
        }
      ]
    },
    {
      "player_id": 19617,
      "player_name": "Michael Akpovie Olise",
      "trending_score": 60.0,
      "trend_summary": "Michael Olise is making waves for France in the Nations League, even inspiring them to a final four spot after a dramatic quarter-final victory over Croatia, decided on penalties. Furthermore, Franck Ribéry sees Olise as his successor, though a language barrier reportedly hinders Didier Deschamps from forming a close bond with the young player.\n",
      "news": [
        {
          "title": "PLAYER RATINGS",
          "description": "PLAYER RATINGS",
          "date": "Sun, 23 Mar 2025 22:50:11 GMT"
        },
        {
          "title": "Language barrier no issue for Michael Olise as he becomes key man in national team...",
          "description": "Language barrier no issue for Michael Olise as he becomes key man in national team...  talkSPORT",
          "date": "Sun, 23 Mar 2025 15:13:42 GMT"
        },
        {
          "title": "Michael Olise seen as the second coming of Franck Ribéry by…Ribéry himself",
          "description": "Michael Olise seen as the second coming of Franck Ribéry by…Ribéry himself  Bavarian Football Works",
          "date": "Sun, 23 Mar 2025 11:30:00 GMT"
        },
        {
          "title": "(VIDEO) All Goals from France vs Croatia in the Nations League",
          "description": "(VIDEO) All Goals from France vs Croatia in the Nations League  beIN SPORTS",
          "date": "Sun, 23 Mar 2025 21:57:06 GMT"
        },
        {
          "title": "France, Spain, Germany & Portugal reach Nations League last four after epic quarter-finals",
          "description": "France, Spain, Germany & Portugal reach Nations League last four after epic quarter-finals  BBC.com",
          "date": "Sun, 23 Mar 2025 22:30:00 GMT"
        },
        {
          "title": "Franck Ribéry speaks on his successors at Bayern Munich in Michael Olise and Jamal Musiala",
          "description": "Franck Ribéry speaks on his successors at Bayern Munich in Michael Olise and Jamal Musiala  Bavarian Football Works",
          "date": "Sun, 23 Mar 2025 14:30:00 GMT"
        },
        {
          "title": "France 2-0 Croatia (a.e.t, 5-4 pens): Highlights, man of the match, stats from dramatic Nations League quarter-final",
          "description": "France 2-0 Croatia (a.e.t, 5-4 pens): Highlights, man of the match, stats from dramatic Nations League quarter-final  Sports Mole",
          "date": "Sun, 23 Mar 2025 22:46:00 GMT"
        },
        {
          "title": "France see off Croatia on penalties to reach Nations League Final Four",
          "description": "France see off Croatia on penalties to reach Nations League Final Four  The Straits Times",
          "date": "Sun, 23 Mar 2025 23:28:15 GMT"
        },
        {
          "title": "France 2-0 Croatia (2-2 agg, 5-4 on pens): France scrape through into Nations League semi-finals",
          "description": "France 2-0 Croatia (2-2 agg, 5-4 on pens): France scrape through into Nations League semi-finals  BBC",
          "date": "Sun, 23 Mar 2025 22:50:00 GMT"
        },
        {
          "title": "Language barrier preventing Didier Deschamps from forming close bond with Michael Olise",
          "description": "Language barrier preventing Didier Deschamps from forming close bond with Michael Olise  Get French Football News",
          "date": "Sun, 23 Mar 2025 11:41:09 GMT"
        }
      ]
    },
    {
      "player_id": 47270,
      "player_name": "Unai Simón Mendibil",
      "trending_score": 29.0,
      "trend_summary": "Unai Simón and Spain edged out the Netherlands in a dramatic UEFA Nations League quarter-final, advancing to the semi-finals after a penalty shootout following a 3-3 draw. La Roja will now face France in the semi-finals.\n",
      "news": [
        {
          "title": "Highlights and Goals of Spain 3 (5)-(4) 3 Netherlands in UEFA Nations League 2024-25",
          "description": "Highlights and Goals of Spain 3 (5)-(4) 3 Netherlands in UEFA Nations League 2024-25  VAVEL.com",
          "date": "Sun, 23 Mar 2025 23:14:45 GMT"
        },
        {
          "title": "Spain 3-3 Netherlands: La Roja advances to the 'final four' of the Nations League on penalties",
          "description": "Spain 3-3 Netherlands: La Roja advances to the 'final four' of the Nations League on penalties  FC Barcelona Noticias",
          "date": "Sun, 23 Mar 2025 22:39:00 GMT"
        },
        {
          "title": "Spain edge Netherlands in penalty shootout to reach Nations League semis",
          "description": "Spain edge Netherlands in penalty shootout to reach Nations League semis  The Straits Times",
          "date": "Sun, 23 Mar 2025 22:53:17 GMT"
        },
        {
          "title": "Spain Triumphs Over Netherlands In Nations League Quarter-Finals After Penalty Shootout Drama",
          "description": "Spain Triumphs Over Netherlands In Nations League Quarter-Finals After Penalty Shootout Drama  myKhel",
          "date": "Sun, 23 Mar 2025 23:32:44 GMT"
        },
        {
          "title": "Spain 3-3 Netherlands (agg: 5-5, 5-4 on pens): Hosts edge dramatic tie to reach semi-finals",
          "description": "Spain 3-3 Netherlands (agg: 5-5, 5-4 on pens): Hosts edge dramatic tie to reach semi-finals  BBC",
          "date": "Sun, 23 Mar 2025 22:50:00 GMT"
        },
        {
          "title": "Nations League: Spain, France to meet in semis after shootout thrillers",
          "description": "Nations League: Spain, France to meet in semis after shootout thrillers  theScore",
          "date": "Sun, 23 Mar 2025 23:25:24 GMT"
        },
        {
          "title": "Spain into UEFA Nations League semi-final with penalty shoot-out victory over The Netherlands",
          "description": "Spain into UEFA Nations League semi-final with penalty shoot-out victory over The Netherlands  Football Espana",
          "date": "Sun, 23 Mar 2025 22:33:10 GMT"
        },
        {
          "title": "Spain 3-3 Netherlands: Player Ratings and Match Highlights",
          "description": "Spain 3-3 Netherlands: Player Ratings and Match Highlights  GIVEMESPORT",
          "date": "Sun, 23 Mar 2025 22:31:00 GMT"
        },
        {
          "title": "Spain Eliminates Netherlands In Nations League Quarterfinals",
          "description": "Spain Eliminates Netherlands In Nations League Quarterfinals  Evrim Ağacı",
          "date": "Sun, 23 Mar 2025 20:42:06 GMT"
        },
        {
          "title": "Spain vs Netherlands Highlights, UEFA Nations League Quarterfinals second leg: ESP 5-4 NED (pen); La Roja enter semifinals",
          "description": "Spain vs Netherlands Highlights, UEFA Nations League Quarterfinals second leg: ESP 5-4 NED (pen); La Roja enter semifinals  Sportstar",
          "date": "Sun, 23 Mar 2025 22:18:45 GMT"
        }
      ]
    },
    {
      "player_id": 47519,
      "player_name": "Pedro Antonio Porro Sauceda",
      "trending_score": 23.0,
      "trend_summary": "Pedro Porro features in reports of a potential Tottenham dream XI amid transfer rumors, while also being linked with Barcelona as they look to bolster their right-back options for the 2025/26 season. He is also mentioned in the context of Spain's UEFA Nations League Quarterfinal against the Netherlands.\n",
      "news": [
        {
          "title": "France, Spain, Germany & Portugal reach Nations League last four after epic quarter-finals",
          "description": "France, Spain, Germany & Portugal reach Nations League last four after epic quarter-finals  BBC.com",
          "date": "Sun, 23 Mar 2025 22:30:00 GMT"
        },
        {
          "title": "Tottenham sign £50m defender, ex-Man Utd prodigy and wonderkid gem in dream XI",
          "description": "Tottenham sign £50m defender, ex-Man Utd prodigy and wonderkid gem in dream XI",
          "date": "Sun, 23 Mar 2025 19:00:00 GMT"
        },
        {
          "title": "Spain Predicted Lineup vs. Netherlands: UEFA Nations League Quarterfinals (Leg 2)",
          "description": "Spain Predicted Lineup vs. Netherlands: UEFA Nations League Quarterfinals (Leg 2)  Sports Illustrated",
          "date": "Sun, 23 Mar 2025 05:00:00 GMT"
        },
        {
          "title": "Tottenham star takes swipe at club staff amid exit links",
          "description": "Tottenham star takes swipe at club staff amid exit links  LondonWorld",
          "date": "Sun, 23 Mar 2025 18:00:00 GMT"
        },
        {
          "title": "‘Targets identified’ as Barcelona look to bolster at right back for 2025/26",
          "description": "‘Targets identified’ as Barcelona look to bolster at right back for 2025/26  Football Espana",
          "date": "Sun, 23 Mar 2025 12:23:49 GMT"
        },
        {
          "title": "Anthony Gordon out of England squad, Thomas Tuchel prepares for Lativa clash",
          "description": "Anthony Gordon out of England squad, Thomas Tuchel prepares for Lativa clash  talkSPORT",
          "date": "Sun, 23 Mar 2025 16:20:12 GMT"
        },
        {
          "title": "Spain vs Netherlands LIVE streaming info, UEFA Nations League Quarterfinal: When, where to watch ESP v NED second leg; Squads",
          "description": "Spain vs Netherlands LIVE streaming info, UEFA Nations League Quarterfinal: When, where to watch ESP v NED second leg; Squads  Sportstar",
          "date": "Sun, 23 Mar 2025 04:04:01 GMT"
        }
      ]
    }
  ]
}