{
  "updated_at": "2025-02-16T12:38:00.955637+00:00",
  "player_news": [
    {
      "player_id": 286475,
      "player_name": "Edoardo Bove",
      "trending_score": 100.0,
      "trend_summary": "Edoardo Bove has opened up about his life after suffering a heart attack, admitting that he feels incomplete without football. The Roma midfielder, who collapsed during a pre-season friendly in July, has been sidelined since but is determined to return to action.",
      "news": [
        {
          "title": "Edoardo Bove details life after heart attack: “Without football, I feel like a part of me is missing.”",
          "description": "Edoardo Bove details life after heart attack: “Without football, I feel like a part of me is missing.”  RomaPress.net",
          "date": "Sun, 16 Feb 2025 06:52:39 GMT"
        },
        {
          "title": "Bove: ‘I understand how thin the line between life and death is’",
          "description": "Bove: ‘I understand how thin the line between life and death is’  Football Italia",
          "date": "Sun, 16 Feb 2025 09:41:15 GMT"
        }
      ]
    },
    {
      "player_id": 81573,
      "player_name": "Omar Khaled Mohamed Abd Elsala Marmoush",
      "trending_score": 29.0,
      "trend_summary": "Omar Marmoush etched his name into Manchester City history with a remarkable 14-minute hat-trick against Newcastle, becoming the first City player to score three goals in a Premier League match since Erling Haaland. The Egyptian striker's impressive performance has raised expectations, with Pep Guardiola praising Marmoush's ability to create scoring opportunities and warning Real Madrid ahead of their upcoming Champions League clash.",
      "news": [
        {
          "title": "Man City 4-0 Newcastle: Pep Guardiola hopes Omar Marmoush 'can handle the biggest compliments' after hat-trick",
          "description": "Man City 4-0 Newcastle: Pep Guardiola hopes Omar Marmoush 'can handle the biggest compliments' after hat-trick  Eurosport COM",
          "date": "Sun, 16 Feb 2025 09:48:58 GMT"
        },
        {
          "title": "Manchester City’s Omar Marmoush: Inside the Cairo club that formed him",
          "description": "Manchester City’s Omar Marmoush: Inside the Cairo club that formed him  The Athletic",
          "date": "Sat, 15 Feb 2025 17:34:21 GMT"
        },
        {
          "title": "Omar Marmoush's hat-trick doesn't surprise Manchester City boss Pep Guardiola",
          "description": "Omar Marmoush's hat-trick doesn't surprise Manchester City boss Pep Guardiola  India Today",
          "date": "Sun, 16 Feb 2025 04:19:17 GMT"
        },
        {
          "title": "Omar Marmoush promises more goals after hat-trick in Man City's thrashing of Newcastle",
          "description": "Omar Marmoush promises more goals after hat-trick in Man City's thrashing of Newcastle  The National",
          "date": "Sun, 16 Feb 2025 06:46:34 GMT"
        },
        {
          "title": "Omar Marmoush warns Real Madrid with his first ‘hat-trick’ with City",
          "description": "Omar Marmoush warns Real Madrid with his first ‘hat-trick’ with City  FC Barcelona Noticias",
          "date": "Sat, 15 Feb 2025 22:59:00 GMT"
        },
        {
          "title": "Man City v Newcastle LIVE: Result as Erling Haaland injury blots win after Omar Marmoush hat-trick",
          "description": "Man City v Newcastle LIVE: Result as Erling Haaland injury blots win after Omar Marmoush hat-trick  Yahoo Sports",
          "date": "Sat, 15 Feb 2025 17:28:09 GMT"
        },
        {
          "title": "Omar Marmoush: How Egyptian striker can pick up Man City's goalscoring slack",
          "description": "Omar Marmoush: How Egyptian striker can pick up Man City's goalscoring slack  BBC.com",
          "date": "Sat, 15 Feb 2025 20:20:04 GMT"
        },
        {
          "title": "Man City 4-0 Newcastle: Omar Marmoush scores 14-minute first-half hat-trick as slick City hammer Magpies",
          "description": "Man City 4-0 Newcastle: Omar Marmoush scores 14-minute first-half hat-trick as slick City hammer Magpies  Sky Sports",
          "date": "Sun, 16 Feb 2025 07:08:35 GMT"
        },
        {
          "title": "Man City 4-0 Newcastle: Omar Marmoush opens his Premier League account with stunning first-half hat-trick as P",
          "description": "Man City 4-0 Newcastle: Omar Marmoush opens his Premier League account with stunning first-half hat-trick as P  Daily Mail",
          "date": "Sun, 16 Feb 2025 08:39:34 GMT"
        },
        {
          "title": "\"He is a player we have missed\"",
          "description": "\"He is a player we have missed\"",
          "date": "Sun, 16 Feb 2025 00:55:00 GMT"
        }
      ]
    },
    {
      "player_id": 47311,
      "player_name": "Mikel Merino Zazón",
      "trending_score": 13.0,
      "trend_summary": "Mikel Merino's unlikely heroics as an emergency striker propelled Arsenal to a crucial 2-0 victory over Leicester City, keeping their Premier League title hopes alive. The midfielder's brace, a rare occurrence in his career, proved decisive as Arsenal secured a vital three points to maintain their title challenge.",
      "news": [
        {
          "title": "Mikel Merino brings Arsenal back down to earth with admission on emergency striker role",
          "description": "Mikel Merino brings Arsenal back down to earth with admission on emergency striker role  The Mirror",
          "date": "Sun, 16 Feb 2025 10:45:00 GMT"
        },
        {
          "title": "Mikel Arteta’s ‘crazy’ decision pays off as Mikel Merino proves worth as a striker",
          "description": "Mikel Arteta’s ‘crazy’ decision pays off as Mikel Merino proves worth as a striker  The Independent",
          "date": "Sun, 16 Feb 2025 10:20:00 GMT"
        },
        {
          "title": "'He placed himself beautifully'",
          "description": "'He placed himself beautifully'",
          "date": "Sat, 15 Feb 2025 16:03:00 GMT"
        },
        {
          "title": "Leicester City vs Arsenal: Premier League preview, team news, stats & head-to-head",
          "description": "Leicester City vs Arsenal: Premier League preview, team news, stats & head-to-head  BBC.com",
          "date": "Sun, 16 Feb 2025 10:16:57 GMT"
        },
        {
          "title": "Merino: I don't think I will play up front again!",
          "description": "Merino: I don't think I will play up front again!  Premier League",
          "date": "Sat, 15 Feb 2025 18:00:55 GMT"
        },
        {
          "title": "Unlikely Arsenal hero hits back at Premier League title critics as Mikel Arteta gamble pays off",
          "description": "Unlikely Arsenal hero hits back at Premier League title critics as Mikel Arteta gamble pays off  Football.London",
          "date": "Sun, 16 Feb 2025 06:22:30 GMT"
        },
        {
          "title": "Super sub Mikel Merino’s double keeps Arsenal in the title chase",
          "description": "Super sub Mikel Merino’s double keeps Arsenal in the title chase  MSN",
          "date": "Sun, 16 Feb 2025 03:56:47 GMT"
        },
        {
          "title": "Mikel Merino scores twice to keep Arsenal’s Premier League title hopes alive",
          "description": "Mikel Merino scores twice to keep Arsenal’s Premier League title hopes alive  The National",
          "date": "Sat, 15 Feb 2025 15:34:14 GMT"
        },
        {
          "title": "Arsenal 2-0 Leicester (Feb 15, 2025) Game Analysis",
          "description": "Arsenal 2-0 Leicester (Feb 15, 2025) Game Analysis  ESPN",
          "date": "Sat, 15 Feb 2025 14:48:45 GMT"
        },
        {
          "title": "Leicester City Vs Arsenal: Merino's Brace Rescues Gunners Against The Foxes",
          "description": "Leicester City Vs Arsenal: Merino's Brace Rescues Gunners Against The Foxes  Outlook India",
          "date": "Sun, 16 Feb 2025 06:45:21 GMT"
        }
      ]
    },
    {
      "player_id": 278,
      "player_name": "Kylian Mbappé Lottin",
      "trending_score": 4.0,
      "trend_summary": "Kylian Mbappé scored an early goal for Real Madrid against Osasuna in La Liga, helping his team secure a draw. Despite being omitted from the French squad, Mbappé is set to return in March, according to manager Didier Deschamps.",
      "news": [
        {
          "title": "Kylian Mbappé Reportedly Considered Drastic Decision After France Omission",
          "description": "Kylian Mbappé Reportedly Considered Drastic Decision After France Omission  OneFootball",
          "date": "Sat, 15 Feb 2025 21:41:49 GMT"
        },
        {
          "title": "Soccer-Mbappe to return to France squad in March, Deschamps says",
          "description": "Soccer-Mbappe to return to France squad in March, Deschamps says  MSN",
          "date": "Sun, 16 Feb 2025 03:07:17 GMT"
        },
        {
          "title": "WATCH: Real Madrid strike early against Osasuna courtesy of Kylian Mbappe",
          "description": "WATCH: Real Madrid strike early against Osasuna courtesy of Kylian Mbappe  Football Espana",
          "date": "Sat, 15 Feb 2025 15:35:00 GMT"
        },
        {
          "title": "Real Madrid plans for life without Vinicius: Milan star and Premier League target top the list to join Kyli...",
          "description": "Real Madrid plans for life without Vinicius: Milan star and Premier League target top the list to join Kyli...  World Soccer Talk",
          "date": "Sat, 15 Feb 2025 17:50:57 GMT"
        },
        {
          "title": "Who are the top scorers of 2025? Ousmane’s on fire…",
          "description": "Who are the top scorers of 2025? Ousmane’s on fire…  Football365",
          "date": "Sun, 16 Feb 2025 08:10:17 GMT"
        },
        {
          "title": "Kylian Mbappe feeling confident after finding his feet at Real Madrid",
          "description": "Kylian Mbappe feeling confident after finding his feet at Real Madrid  Flashscore.com",
          "date": "Sat, 15 Feb 2025 13:53:29 GMT"
        },
        {
          "title": "La Liga: Real Madrid Draw At Osasuna With Bellingham Receiving Red",
          "description": "La Liga: Real Madrid Draw At Osasuna With Bellingham Receiving Red  Outlook India",
          "date": "Sun, 16 Feb 2025 07:13:28 GMT"
        },
        {
          "title": "Top 10 Highest Paid Athletes 2024: From Cristiano Ronaldo to Kylian Mbappe; Who earns the most?",
          "description": "Top 10 Highest Paid Athletes 2024: From Cristiano Ronaldo to Kylian Mbappe; Who earns the most?",
          "date": "Sun, 16 Feb 2025 12:05:53 GMT"
        },
        {
          "title": "LIVE: Osasuna vs Real Madrid – LaLiga",
          "description": "LIVE: Osasuna vs Real Madrid – LaLiga  Al Jazeera English",
          "date": "Sat, 15 Feb 2025 13:37:31 GMT"
        },
        {
          "title": "Kylian Mbappe Shines Bright as Real Madrid’s Meteoric January Star",
          "description": "Kylian Mbappe Shines Bright as Real Madrid’s Meteoric January Star  Bober Tea",
          "date": "Sat, 15 Feb 2025 16:45:32 GMT"
        }
      ]
    },
    {
      "player_id": 1100,
      "player_name": "Erling Braut Haaland",
      "trending_score": 2.0,
      "trend_summary": "Manchester City's Erling Haaland suffered a knock in the Newcastle clash, leaving manager Pep Guardiola concerned about the severity of the injury ahead of the crucial Champions League showdown with Real Madrid. Despite the scare, Guardiola has provided a mixed update, suggesting the injury may not be as serious as initially feared.",
      "news": [
        {
          "title": "Guardiola 'scared' by Haaland injury, hopes 'it's not as bad as it could be'",
          "description": "Guardiola 'scared' by Haaland injury, hopes 'it's not as bad as it could be'  Eurosport COM",
          "date": "Sat, 15 Feb 2025 23:00:00 GMT"
        },
        {
          "title": "Man City boss Guardiola provides Erling Haaland injury update before Real Madrid showdown",
          "description": "Man City boss Guardiola provides Erling Haaland injury update before Real Madrid showdown  Yahoo Canada Sports",
          "date": "Sat, 15 Feb 2025 22:19:00 GMT"
        },
        {
          "title": "Pep Guardiola provides Erling Haaland update after he was subbed out after picking up knock in Manchester City vs Newcastle clash",
          "description": "Pep Guardiola provides Erling Haaland update after he was subbed out after picking up knock in Manchester City vs Newcastle clash  Sportskeeda",
          "date": "Sun, 16 Feb 2025 00:05:00 GMT"
        },
        {
          "title": "How Marmoush led Manchester City to a convincing win against Newcastle with a brilliant first-half hat-trick",
          "description": "How Marmoush led Manchester City to a convincing win against Newcastle with a brilliant first-half hat-trick  The Athletic",
          "date": "Sat, 15 Feb 2025 19:47:41 GMT"
        },
        {
          "title": "Man City boss Pep Guardiola provides injury update on Erling Haaland",
          "description": "Man City boss Pep Guardiola provides injury update on Erling Haaland  The Independent",
          "date": "Sat, 15 Feb 2025 20:54:00 GMT"
        },
        {
          "title": "Pep Guardiola offers mixed Erling Haaland injury update ahead of Real Madrid clash",
          "description": "Pep Guardiola offers mixed Erling Haaland injury update ahead of Real Madrid clash  Football Espana",
          "date": "Sat, 15 Feb 2025 19:53:11 GMT"
        },
        {
          "title": "Pep Guardiola gives Erling Haaland update after Man City forward picks up injury that left 'everyone scared'",
          "description": "Pep Guardiola gives Erling Haaland update after Man City forward picks up injury that left 'everyone scared'",
          "date": "Sat, 15 Feb 2025 21:23:53 GMT"
        },
        {
          "title": "Pep Guardiola delivers update on Erling Haaland following injury scare after Man City's star striker limped of",
          "description": "Pep Guardiola delivers update on Erling Haaland following injury scare after Man City's star striker limped of  Daily Mail",
          "date": "Sat, 15 Feb 2025 18:01:56 GMT"
        },
        {
          "title": "Erling Haaland: Man City's Pep Guardiola addresses injury scare before Real Madrid clash",
          "description": "Erling Haaland: Man City's Pep Guardiola addresses injury scare before Real Madrid clash  Sports Mole",
          "date": "Sat, 15 Feb 2025 18:20:00 GMT"
        },
        {
          "title": "Huge Erling Haaland decision leaves ex-Premier League star surprised...",
          "description": "Huge Erling Haaland decision leaves ex-Premier League star surprised...  talkSPORT",
          "date": "Sat, 15 Feb 2025 18:21:55 GMT"
        }
      ]
    }
  ]
}