{
  "updated_at": "2025-02-16T23:56:32.165882+00:00",
  "player_news": [
    {
      "player_id": 9971,
      "player_name": "Antony Matheus dos Santos",
      "trending_score": 100.0,
      "trend_summary": "Manchester United loanee Antony continues to impress at Real Betis, scoring in their 3-0 victory over Real Sociedad. Amidst transfer rumors linking him with a €50 million move to Bayern Munich, Antony's agent has revealed that the player's future at United remains uncertain, with no long-term plans currently in place.",
      "news": [
        {
          "title": "Real Betis 3-0 Real Sociedad: Manchester United loannee Antony scores in win",
          "description": "Real Betis 3-0 Real Sociedad: Manchester United loannee Antony scores in win  BBC.com",
          "date": "Sun, 16 Feb 2025 22:01:31 GMT"
        },
        {
          "title": "📸 Antony pours salt in Man Utd's wounds with another Betis goal",
          "description": "📸 Antony pours salt in Man Utd's wounds with another Betis goal  OneFootball",
          "date": "Sun, 16 Feb 2025 21:32:33 GMT"
        },
        {
          "title": "Antony could leave Manchester United for good after impressive start to Real Betis loan",
          "description": "Antony could leave Manchester United for good after impressive start to Real Betis loan  NationalWorld",
          "date": "Sun, 16 Feb 2025 20:47:18 GMT"
        },
        {
          "title": "Football transfer rumours: Man Utd receive €50m Antony bid; Liverpool eye Van de Ven",
          "description": "Football transfer rumours: Man Utd receive €50m Antony bid; Liverpool eye Van de Ven  MSN",
          "date": "Sun, 16 Feb 2025 08:41:54 GMT"
        },
        {
          "title": "Man Utd flop Antony could be playing for a European giant next season",
          "description": "Man Utd flop Antony could be playing for a European giant next season  Football365",
          "date": "Sun, 16 Feb 2025 13:06:19 GMT"
        },
        {
          "title": "Revealed: Antony's honest opinion of Ruben Amorim as Man United outcast's agent shares fresh detail on £85mill",
          "description": "Revealed: Antony's honest opinion of Ruben Amorim as Man United outcast's agent shares fresh detail on £85mill  Daily Mail",
          "date": "Sun, 16 Feb 2025 10:57:45 GMT"
        },
        {
          "title": "7 Premier League flops we can't believe thrived in La Liga: Antony, Pique...",
          "description": "7 Premier League flops we can't believe thrived in La Liga: Antony, Pique...  Planet Football",
          "date": "Sun, 16 Feb 2025 12:08:53 GMT"
        },
        {
          "title": "‘No long-term plans’ – Antony’s agent opens up forward’s Manchester United future as recall clause is expla...",
          "description": "‘No long-term plans’ – Antony’s agent opens up forward’s Manchester United future as recall clause is expla...  talkSPORT",
          "date": "Sun, 16 Feb 2025 15:24:47 GMT"
        },
        {
          "title": "Antony Poised for €50 Million Move as Bayern Munich Engage in Talks with Manchester United",
          "description": "Antony Poised for €50 Million Move as Bayern Munich Engage in Talks with Manchester United  FootBoom",
          "date": "Sun, 16 Feb 2025 13:19:22 GMT"
        },
        {
          "title": "‘Open story’ – Antony’s agent reveals how ace feels about Ruben Amorim & Man Utd return after stunning Real...",
          "description": "‘Open story’ – Antony’s agent reveals how ace feels about Ruben Amorim & Man Utd return after stunning Real...  The Sun",
          "date": "Sun, 16 Feb 2025 13:23:20 GMT"
        }
      ]
    },
    {
      "player_id": 306,
      "player_name": "Mohamed Salah Hamed Mahrous Ghaly",
      "trending_score": 95.0,
      "trend_summary": "Mohamed Salah's penalty against Wolverhampton Wanderers extended Liverpool's lead atop the Premier League table, while also equaling Wayne Rooney's feat of scoring in 15 consecutive Premier League away games. The Egyptian forward is now just one goal shy of Sergio Aguero's record of 120 Premier League goals for a non-\"big six\" club.",
      "news": [
        {
          "title": "Liverpool all-time top scorers: Where does Mohamed Salah rank among Reds players with most goals?",
          "description": "Liverpool all-time top scorers: Where does Mohamed Salah rank among Reds players with most goals?  Sporting News",
          "date": "Sun, 16 Feb 2025 14:38:00 GMT"
        },
        {
          "title": "Mohamed Salah on spot as Liverpool hold off Wolves fightback to reopen gap",
          "description": "Mohamed Salah on spot as Liverpool hold off Wolves fightback to reopen gap  The Guardian",
          "date": "Sun, 16 Feb 2025 19:22:00 GMT"
        },
        {
          "title": "Mohamed Salah on target again as Liverpool edge out Wolves to maintain grip on Premier League title race",
          "description": "Mohamed Salah on target again as Liverpool edge out Wolves to maintain grip on Premier League title race  The National",
          "date": "Sun, 16 Feb 2025 17:17:00 GMT"
        },
        {
          "title": "Mohamed Salah equals Wayne Rooney’s Premier League feat, closes in on Sergio Aguero",
          "description": "Mohamed Salah equals Wayne Rooney’s Premier League feat, closes in on Sergio Aguero  Flashscore.com",
          "date": "Sun, 16 Feb 2025 17:14:47 GMT"
        },
        {
          "title": "Mohamed Salah penalty seals victory for Premier League leader Liverpool against Wolverhampton",
          "description": "Mohamed Salah penalty seals victory for Premier League leader Liverpool against Wolverhampton  Hindustan Times",
          "date": "Sun, 16 Feb 2025 16:32:00 GMT"
        },
        {
          "title": "Arne Slot compares Mohamed Salah to Man United legend as Liverpool boss reveals the secret power that has given Anfield hero the edge over Premier League defences",
          "description": "Arne Slot compares Mohamed Salah to Man United legend as Liverpool boss reveals the secret power that has given Anfield hero the edge over Premier League defences  MSN",
          "date": "Sun, 16 Feb 2025 11:05:36 GMT"
        },
        {
          "title": "Mohamed Salah on Track to Be Football’s Top Earner Worldwide",
          "description": "Mohamed Salah on Track to Be Football’s Top Earner Worldwide  OneFootball",
          "date": "Sun, 16 Feb 2025 05:46:26 GMT"
        },
        {
          "title": "Liverpool vs Wolves: Mohamed Salah converts penalty for Reds",
          "description": "Liverpool vs Wolves: Mohamed Salah converts penalty for Reds  Sky Sports",
          "date": "Sun, 16 Feb 2025 14:45:40 GMT"
        },
        {
          "title": "Liverpool survive shaky second half against Wolves to extend Premier League lead",
          "description": "Liverpool survive shaky second half against Wolves to extend Premier League lead  The Independent",
          "date": "Sun, 16 Feb 2025 18:59:00 GMT"
        },
        {
          "title": "Luis Díaz's Brilliance and Mohamed Salah's Goal: Penalty Controversy in Liverpool vs. Wolves",
          "description": "Luis Díaz's Brilliance and Mohamed Salah's Goal: Penalty Controversy in Liverpool vs. Wolves  FootBoom",
          "date": "Sun, 16 Feb 2025 15:51:50 GMT"
        }
      ]
    },
    {
      "player_id": 18784,
      "player_name": "James Daniel Maddison",
      "trending_score": 82.0,
      "trend_summary": "In a thrilling Premier League clash, James Maddison's early goal secured a 1-0 victory for Tottenham Hotspur over Manchester United, silencing his critics and giving the Spurs a much-needed boost after their recent struggles. Maddison's celebration, aimed at former United captain Roy Keane, added further intrigue to the match, as the midfielder responded to Keane's previous criticism of his performances.",
      "news": [
        {
          "title": "How Tottenham beat Manchester United in the Premier League thanks to James Maddison's early goal",
          "description": "How Tottenham beat Manchester United in the Premier League thanks to James Maddison's early goal",
          "date": "Sun, 16 Feb 2025 19:39:19 GMT"
        },
        {
          "title": "Bullseye! Maddison takes aim at Keane after goal",
          "description": "Bullseye! Maddison takes aim at Keane after goal  ESPN",
          "date": "Sun, 16 Feb 2025 21:03:40 GMT"
        },
        {
          "title": "Tottenham Hotspur 1-0 Manchester United: James Maddison condemns Red Devils to yet another defeat",
          "description": "Tottenham Hotspur 1-0 Manchester United: James Maddison condemns Red Devils to yet another defeat  OneFootball",
          "date": "Sun, 16 Feb 2025 18:44:45 GMT"
        },
        {
          "title": "James Maddison returns to give Tottenham win over injury-hit Manchester United",
          "description": "James Maddison returns to give Tottenham win over injury-hit Manchester United  The Independent",
          "date": "Sun, 16 Feb 2025 20:20:00 GMT"
        },
        {
          "title": "Tottenham's James Maddison silences 'outside noise' after Roy Keane criticism",
          "description": "Tottenham's James Maddison silences 'outside noise' after Roy Keane criticism  Flashscore.com",
          "date": "Sun, 16 Feb 2025 20:13:39 GMT"
        },
        {
          "title": "James Maddison gives Spurs the lead against Man Utd!",
          "description": "James Maddison gives Spurs the lead against Man Utd!  Sky Sports",
          "date": "Sun, 16 Feb 2025 16:54:54 GMT"
        },
        {
          "title": "Tottenham 1-0 Man United LIVE REACTION: James Maddison hits back at Roy Keane as Ruben Amorim loses again...",
          "description": "Tottenham 1-0 Man United LIVE REACTION: James Maddison hits back at Roy Keane as Ruben Amorim loses again...  talkSPORT",
          "date": "Sun, 16 Feb 2025 18:42:30 GMT"
        },
        {
          "title": "James Maddison explains who his celebration was aimed at in fascinating Sky Sports post-match interview",
          "description": "James Maddison explains who his celebration was aimed at in fascinating Sky Sports post-match interview  SPORTbible",
          "date": "Sun, 16 Feb 2025 19:21:02 GMT"
        },
        {
          "title": "Guglielmo Vicario and James Maddison Tottenham truth clear as Daniel Levy sent important message",
          "description": "Guglielmo Vicario and James Maddison Tottenham truth clear as Daniel Levy sent important message  Football.London",
          "date": "Sun, 16 Feb 2025 18:55:12 GMT"
        },
        {
          "title": "Watch: James Maddison hits back at Roy Keane criticism with pointed celebration",
          "description": "Watch: James Maddison hits back at Roy Keane criticism with pointed celebration  The Telegraph",
          "date": "Sun, 16 Feb 2025 17:32:00 GMT"
        }
      ]
    },
    {
      "player_id": 161585,
      "player_name": "Francisco Fernandes da Conceição",
      "trending_score": 76.0,
      "trend_summary": "In a stunning upset, Francisco Conceição scored the decisive goal in Juventus's 1-0 victory over Inter Milan in the Derby d'Italia, boosting Napoli's Serie A title chances. Conceição's late strike denied Inter the opportunity to move top of the table and handed Juventus a crucial three points in their pursuit of a top-four finish.",
      "news": [
        {
          "title": "Juventus vs. Inter score, highlights: Francisco Conceicao grabs deciding goal, boost Napoli's Serie A chances",
          "description": "Juventus vs. Inter score, highlights: Francisco Conceicao grabs deciding goal, boost Napoli's Serie A chances  CBS Sports",
          "date": "Sun, 16 Feb 2025 22:14:00 GMT"
        },
        {
          "title": "Francisco Conceicao helps Juventus to Derby d’Italia victory over Inter Milan",
          "description": "Francisco Conceicao helps Juventus to Derby d’Italia victory over Inter Milan  The Independent",
          "date": "Sun, 16 Feb 2025 22:55:00 GMT"
        },
        {
          "title": "Soccer-Title-chasing Inter suffer 1-0 defeat at Juve",
          "description": "Soccer-Title-chasing Inter suffer 1-0 defeat at Juve  MSN",
          "date": "Sun, 16 Feb 2025 23:40:15 GMT"
        },
        {
          "title": "European football: Inter miss chance while racist chants halt La Liga game",
          "description": "European football: Inter miss chance while racist chants halt La Liga game  The Guardian",
          "date": "Sun, 16 Feb 2025 22:45:00 GMT"
        },
        {
          "title": "Conceicao nets late winner for Juventus as Inter miss chance to move top of Serie A",
          "description": "Conceicao nets late winner for Juventus as Inter miss chance to move top of Serie A  Flashscore.com",
          "date": "Sun, 16 Feb 2025 21:48:39 GMT"
        },
        {
          "title": "Juventus vs. Inter score, highlights: Francisco Conceicao grabs deciding goal, boost Napoli's Serie A chances",
          "description": "Juventus vs. Inter score, highlights: Francisco Conceicao grabs deciding goal, boost Napoli's Serie A chances  thepress.net",
          "date": "Sun, 16 Feb 2025 22:14:09 GMT"
        },
        {
          "title": "Juventus 1-0 Inter Milan: Champions miss chance to go top of Serie A",
          "description": "Juventus 1-0 Inter Milan: Champions miss chance to go top of Serie A  BBC.com",
          "date": "Sun, 16 Feb 2025 22:38:57 GMT"
        },
        {
          "title": "Serie A",
          "description": "Serie A",
          "date": "Sun, 16 Feb 2025 21:39:36 GMT"
        },
        {
          "title": "Title-chasing Inter suffer 1-0 defeat at Juve",
          "description": "Title-chasing Inter suffer 1-0 defeat at Juve  The Straits Times",
          "date": "Sun, 16 Feb 2025 22:30:00 GMT"
        },
        {
          "title": "Video: Juventus take the lead vs. Inter with Conceiçao’s goal",
          "description": "Video: Juventus take the lead vs. Inter with Conceiçao’s goal  Football Italia",
          "date": "Sun, 16 Feb 2025 21:32:00 GMT"
        }
      ]
    },
    {
      "player_id": 747,
      "player_name": "Carlos Henrique Casimiro",
      "trending_score": 65.0,
      "trend_summary": "Casemiro's return to Manchester United's starting lineup against Tottenham proved disappointing, as the Brazilian midfielder received a poor player rating of 5/10 from the Manchester Evening News. Despite United's 1-0 loss, Casemiro's performance has sparked concerns about his on-field contributions and the need for changes within the team.",
      "news": [
        {
          "title": "How Tottenham beat Manchester United in the Premier League thanks to James Maddison's early goal",
          "description": "How Tottenham beat Manchester United in the Premier League thanks to James Maddison's early goal",
          "date": "Sun, 16 Feb 2025 19:39:19 GMT"
        },
        {
          "title": "Casemiro returns! Man United name team to face Tottenham",
          "description": "Casemiro returns! Man United name team to face Tottenham  Yahoo Canada Sports",
          "date": "Sun, 16 Feb 2025 15:31:00 GMT"
        },
        {
          "title": "'Wouldn't see these tactics in under-9s!'",
          "description": "'Wouldn't see these tactics in under-9s!'",
          "date": "Sun, 16 Feb 2025 20:07:11 GMT"
        },
        {
          "title": "Man Utd player ratings vs Spurs: Casemiro shocker as Onana errors continue",
          "description": "Man Utd player ratings vs Spurs: Casemiro shocker as Onana errors continue  Evening Standard",
          "date": "Sun, 16 Feb 2025 18:32:29 GMT"
        },
        {
          "title": "5 big changes: Expected Man Utd line-up (3-4-2-1) vs Tottenham with Casemiro decision made",
          "description": "5 big changes: Expected Man Utd line-up (3-4-2-1) vs Tottenham with Casemiro decision made  OneFootball",
          "date": "Sun, 16 Feb 2025 06:42:43 GMT"
        },
        {
          "title": "Manchester United player ratings vs Tottenham as Casemiro poor and four get 5/10",
          "description": "Manchester United player ratings vs Tottenham as Casemiro poor and four get 5/10  Manchester Evening News",
          "date": "Sun, 16 Feb 2025 18:24:00 GMT"
        },
        {
          "title": "Manchester United's Casemiro is costing far too much on and off pitch as changes and creativity are needed",
          "description": "Manchester United's Casemiro is costing far too much on and off pitch as changes and creativity are needed  CBS Sports",
          "date": "Sun, 16 Feb 2025 19:32:11 GMT"
        },
        {
          "title": "Gary Neville hits out at tactic that 'breaks all rules of football' during Tottenham and Man Utd clash",
          "description": "Gary Neville hits out at tactic that 'breaks all rules of football' during Tottenham and Man Utd clash  GB News",
          "date": "Sun, 16 Feb 2025 17:55:19 GMT"
        },
        {
          "title": "\"Let’s pray bro doesn’t get done by\", \"Lord have mercy\"",
          "description": "\"Let’s pray bro doesn’t get done by\", \"Lord have mercy\"",
          "date": "Sun, 16 Feb 2025 16:01:00 GMT"
        },
        {
          "title": "Tottenham 1-0 Man United LIVE REACTION: James Maddison hits back at Roy Keane as Ruben Amorim loses again...",
          "description": "Tottenham 1-0 Man United LIVE REACTION: James Maddison hits back at Roy Keane as Ruben Amorim loses again...  talkSPORT",
          "date": "Sun, 16 Feb 2025 18:42:30 GMT"
        }
      ]
    }
  ]
}