{
  "updated_at": "2025-02-15T00:04:00.725757+00:00",
  "player_news": [
    {
      "player_id": 106835,
      "player_name": "Kaoru Mitoma",
      "trending_score": 100.0,
      "trend_summary": "Kaoru Mitoma's mesmerizing solo goal against Chelsea, described as \"Messi-like\" by Jamie Carragher, propelled Brighton to a resounding 1-0 victory in the Premier League. The Japanese winger's impeccable first touch and stunning strike left Chelsea reeling and sparked praise for his exceptional skill and match-winning impact.",
      "news": [
        {
          "title": "Kaoru Mitoma drills Brighton 1-0 in front of Chelsea",
          "description": "Kaoru Mitoma drills Brighton 1-0 in front of Chelsea  NBC Sports",
          "date": "Fri, 14 Feb 2025 20:56:11 GMT"
        },
        {
          "title": "Jamie Carragher brands stunning Kaoru Mitoma first touch 'Messi-like' as fans go wild over winger's skill befo",
          "description": "Jamie Carragher brands stunning Kaoru Mitoma first touch 'Messi-like' as fans go wild over winger's skill befo  Daily Mail",
          "date": "Fri, 14 Feb 2025 22:11:16 GMT"
        },
        {
          "title": "Kaoru Mitoma’s magic touch prompts Chelsea implosion",
          "description": "Kaoru Mitoma’s magic touch prompts Chelsea implosion  The Times",
          "date": "Fri, 14 Feb 2025 22:10:00 GMT"
        },
        {
          "title": "Kaoru Mitoma scores incredible solo goal for Brighton after ‘greatest first touch of all-time’ as Jamie Carragher left speechless",
          "description": "Kaoru Mitoma scores incredible solo goal for Brighton after ‘greatest first touch of all-time’ as Jamie Carragher left speechless  SPORTbible",
          "date": "Fri, 14 Feb 2025 20:51:18 GMT"
        },
        {
          "title": "‘Worst performance’: Chelsea’s season could ‘unravel’ after dismal defeat to Brighton",
          "description": "‘Worst performance’: Chelsea’s season could ‘unravel’ after dismal defeat to Brighton  Fox Sports",
          "date": "Fri, 14 Feb 2025 23:58:51 GMT"
        },
        {
          "title": "'Impeccable first touch'",
          "description": "'Impeccable first touch'",
          "date": "Fri, 14 Feb 2025 23:41:00 GMT"
        },
        {
          "title": "Brighton vs Chelsea live updates: Woeful visitors three goals down after Minteh double",
          "description": "Brighton vs Chelsea live updates: Woeful visitors three goals down after Minteh double",
          "date": "Fri, 14 Feb 2025 17:29:17 GMT"
        },
        {
          "title": "'That's Messi-like!'",
          "description": "'That's Messi-like!'",
          "date": "Fri, 14 Feb 2025 20:37:48 GMT"
        },
        {
          "title": "Watch: Kaoru Mitoma's stunning strike against Chelsea",
          "description": "Watch: Kaoru Mitoma's stunning strike against Chelsea",
          "date": "Fri, 14 Feb 2025 20:43:00 GMT"
        },
        {
          "title": "Jamie Carragher criticises three Chelsea stars over Kaoru Mitoma goal for Brighton",
          "description": "Jamie Carragher criticises three Chelsea stars over Kaoru Mitoma goal for Brighton  Metro.co.uk",
          "date": "Fri, 14 Feb 2025 20:59:00 GMT"
        }
      ]
    },
    {
      "player_id": 181812,
      "player_name": "Jamal Musiala",
      "trending_score": 43.0,
      "trend_summary": "Jamal Musiala has extended his contract with Bayern Munich until 2030, securing his future with the German giants. The 19-year-old's new deal is a testament to his remarkable rise, having established himself as a key player for both club and country.",
      "news": [
        {
          "title": "Jamal Musiala signs contract extension with FC Bayern to 2030",
          "description": "Jamal Musiala signs contract extension with FC Bayern to 2030  FC Bayern Munich",
          "date": "Fri, 14 Feb 2025 12:00:00 GMT"
        },
        {
          "title": "Jamal Musiala \"extremely happy\" with Bayern Munich extension",
          "description": "Jamal Musiala \"extremely happy\" with Bayern Munich extension  Bavarian Football Works",
          "date": "Fri, 14 Feb 2025 23:00:00 GMT"
        },
        {
          "title": "Jamal Musiala: Germany international signs historic lucrative contract extension at Bayern Munich",
          "description": "Jamal Musiala: Germany international signs historic lucrative contract extension at Bayern Munich  BBC.com",
          "date": "Fri, 14 Feb 2025 17:52:22 GMT"
        },
        {
          "title": "Goodbye to the 'soap opera' Musiala! Bayern Munich renews Jamal until 2030",
          "description": "Goodbye to the 'soap opera' Musiala! Bayern Munich renews Jamal until 2030  FC Barcelona Noticias",
          "date": "Fri, 14 Feb 2025 14:03:00 GMT"
        },
        {
          "title": "How new Bayern Munich contract of Jamal Musiala has given a chance to Chelsea to re-sign him",
          "description": "How new Bayern Munich contract of Jamal Musiala has given a chance to Chelsea to re-sign him  Sporting News",
          "date": "Fri, 14 Feb 2025 14:06:41 GMT"
        },
        {
          "title": "Official",
          "description": "Official",
          "date": "Fri, 14 Feb 2025 14:46:37 GMT"
        },
        {
          "title": "Bayern Munich ties star player Jamal Musiala to contract until 2030",
          "description": "Bayern Munich ties star player Jamal Musiala to contract until 2030  India Today",
          "date": "Fri, 14 Feb 2025 17:04:06 GMT"
        },
        {
          "title": "Bayern Munich Extends Jamal Musiala with Mega Contract",
          "description": "Bayern Munich Extends Jamal Musiala with Mega Contract  MSN",
          "date": "Fri, 14 Feb 2025 15:50:15 GMT"
        },
        {
          "title": "Germany star Jamal Musiala signs new five-year deal with Bayern Munich",
          "description": "Germany star Jamal Musiala signs new five-year deal with Bayern Munich  Flashscore.com",
          "date": "Fri, 14 Feb 2025 13:06:26 GMT"
        },
        {
          "title": "Jamal Musiala Signs Contract Extension With Bayern Until 2030",
          "description": "Jamal Musiala Signs Contract Extension With Bayern Until 2030  Evrim Ağacı",
          "date": "Fri, 14 Feb 2025 13:02:17 GMT"
        }
      ]
    },
    {
      "player_id": 47380,
      "player_name": "Marc Cucurella Saseta",
      "trending_score": 41.0,
      "trend_summary": "Marc Cucurella endured a dismal performance in Chelsea's 3-0 defeat to Brighton, earning a meager 2/10 rating for his ineffective defensive display. The Spanish defender faced intense hostility from the crowd, who booed him throughout the match, adding to his recent struggles for the Blues.",
      "news": [
        {
          "title": "Chelsea player ratings: 2/10 in defence as Palmer fails to deliver again",
          "description": "Chelsea player ratings: 2/10 in defence as Palmer fails to deliver again  Evening Standard",
          "date": "Fri, 14 Feb 2025 22:01:00 GMT"
        },
        {
          "title": "Chelsea player ratings vs Brighton: That is embarrassing! Marc Cucurella and Filip Jorgensen flop big time in humiliating loss as Cole Palmer and Christopher Nkunku are kept silent by sublime Seagulls",
          "description": "Chelsea player ratings vs Brighton: That is embarrassing! Marc Cucurella and Filip Jorgensen flop big time in humiliating loss as Cole Palmer and Christopher Nkunku are kept silent by sublime Seagulls  Goal.com",
          "date": "Fri, 14 Feb 2025 22:02:42 GMT"
        },
        {
          "title": "'I'm happy' – Fabian Hurzeler makes Marc Cucurella and Robert Sanchez claim after Amex Stadium chants",
          "description": "'I'm happy' – Fabian Hurzeler makes Marc Cucurella and Robert Sanchez claim after Amex Stadium chants  SussexWorld",
          "date": "Fri, 14 Feb 2025 07:00:00 GMT"
        },
        {
          "title": "Mitoma shines as Brighton beat shot-shy Chelsea 3-0",
          "description": "Mitoma shines as Brighton beat shot-shy Chelsea 3-0  The Straits Times",
          "date": "Fri, 14 Feb 2025 23:20:00 GMT"
        },
        {
          "title": "Chelsea player ratings vs Brighton as Levi Colwill struggles and attacker scores 1/10",
          "description": "Chelsea player ratings vs Brighton as Levi Colwill struggles and attacker scores 1/10  The Chelsea Chronicle",
          "date": "Fri, 14 Feb 2025 21:55:50 GMT"
        },
        {
          "title": "Rivalry Rekindled: No Love Lost Between Chelsea and Brighton",
          "description": "Rivalry Rekindled: No Love Lost Between Chelsea and Brighton  VAVEL",
          "date": "Fri, 14 Feb 2025 11:59:11 GMT"
        },
        {
          "title": "Cucurella will be booed again",
          "description": "Cucurella will be booed again",
          "date": "Fri, 14 Feb 2025 07:44:00 GMT"
        },
        {
          "title": "Yankuba Minteh scores twice as Chelsea suffer deja-vu defeat at Brighton",
          "description": "Yankuba Minteh scores twice as Chelsea suffer deja-vu defeat at Brighton  Inkl",
          "date": "Fri, 14 Feb 2025 22:06:48 GMT"
        },
        {
          "title": "Chelsea fans send Yankuba Minteh message after Brighton star's masterclass in 3-0 loss for Blues",
          "description": "Chelsea fans send Yankuba Minteh message after Brighton star's masterclass in 3-0 loss for Blues  TBR Football",
          "date": "Fri, 14 Feb 2025 22:09:51 GMT"
        },
        {
          "title": "Brighton vs Chelsea Prediction: Team News, Predicted Lineups and Where To Watch",
          "description": "Brighton vs Chelsea Prediction: Team News, Predicted Lineups and Where To Watch  WhoScored.com",
          "date": "Fri, 14 Feb 2025 08:56:00 GMT"
        }
      ]
    },
    {
      "player_id": 13489,
      "player_name": "Jhon Jader Durán Palacio",
      "trending_score": 37.0,
      "trend_summary": "Following his £65 million move from Aston Villa, Jhon Durán has made an explosive start to life in Saudi Arabia with Al-Nassr, scoring a brace in a dramatic 3-2 win over Al-Ahli. The Colombian striker's impressive form has drawn praise from teammate Cristiano Ronaldo, who sent him a congratulatory message after the match.",
      "news": [
        {
          "title": "Jhon Duran makes blistering start to life in Saudi Arabia with Al-Nassr after £65m switch from Aston Villa in",
          "description": "Jhon Duran makes blistering start to life in Saudi Arabia with Al-Nassr after £65m switch from Aston Villa in  Daily Mail",
          "date": "Fri, 14 Feb 2025 11:31:38 GMT"
        },
        {
          "title": "Carlos Antonio Vélez Discusses Jhon Durán's Situation in Saudi Arabia",
          "description": "Carlos Antonio Vélez Discusses Jhon Durán's Situation in Saudi Arabia  FootBoom",
          "date": "Fri, 14 Feb 2025 19:18:39 GMT"
        },
        {
          "title": "Jhon Duran continues fine Al Nassr form with double in dramatic win",
          "description": "Jhon Duran continues fine Al Nassr form with double in dramatic win  Sky Sports",
          "date": "Fri, 14 Feb 2025 07:30:47 GMT"
        },
        {
          "title": "“I’m in FIFA mode”",
          "description": "“I’m in FIFA mode”",
          "date": "Fri, 14 Feb 2025 06:08:00 GMT"
        },
        {
          "title": "Jhon Duran shows true colours with nine-word message to Cristiano Ronaldo after Aston Villa transfer",
          "description": "Jhon Duran shows true colours with nine-word message to Cristiano Ronaldo after Aston Villa transfer  Birmingham Live",
          "date": "Fri, 14 Feb 2025 13:09:00 GMT"
        },
        {
          "title": "Wenger \"surprised\" seeing Duran leave Villa for Al-Nassr",
          "description": "Wenger \"surprised\" seeing Duran leave Villa for Al-Nassr  Tribal Football",
          "date": "Fri, 14 Feb 2025 01:07:50 GMT"
        },
        {
          "title": "“That’s it dad”",
          "description": "“That’s it dad”",
          "date": "Fri, 14 Feb 2025 07:01:00 GMT"
        },
        {
          "title": "Jhon Duran shows true colours with nine-word message to Cristiano Ronaldo after Aston Villa transfer",
          "description": "Jhon Duran shows true colours with nine-word message to Cristiano Ronaldo after Aston Villa transfer  Birmingham Live",
          "date": "Fri, 14 Feb 2025 13:09:00 GMT"
        },
        {
          "title": "Duran double decides Jeddah thriller for Al Nassr",
          "description": "Duran double decides Jeddah thriller for Al Nassr  OneFootball",
          "date": "Fri, 14 Feb 2025 08:06:00 GMT"
        },
        {
          "title": "Jhon Duran is on fire! Al-Nassr star grabs another brace to cancel out Ivan Toney's late equaliser with Cristiano Ronaldo HOOKED after subpar performance during nervy win over Al-Ahli",
          "description": "Jhon Duran is on fire! Al-Nassr star grabs another brace to cancel out Ivan Toney's late equaliser with Cristiano Ronaldo HOOKED after subpar performance during nervy win over Al-Ahli  MSN",
          "date": "Fri, 14 Feb 2025 16:42:22 GMT"
        }
      ]
    },
    {
      "player_id": 152982,
      "player_name": "Cole Jermaine Palmer",
      "trending_score": 36.0,
      "trend_summary": "Chelsea's Cole Palmer faces an uncertain future amid transfer speculation linking him with Champions League-bound Chelsea, despite his disappointing performance in the Blues' 3-0 defeat to Brighton in the Premier League. Palmer's lackluster display has raised questions about his commitment to the club, with former Chelsea star Jamie Carragher suggesting he could leave if they fail to secure a top-four finish and Champions League qualification.",
      "news": [
        {
          "title": "Cole Palmer will play Champions League football next season – whether he’s at Chelsea or not...",
          "description": "Cole Palmer will play Champions League football next season – whether he’s at Chelsea or not...  talkSPORT",
          "date": "Fri, 14 Feb 2025 18:00:00 GMT"
        },
        {
          "title": "Jamie Carragher: Chelsea could lose Cole Palmer without Champions League football",
          "description": "Jamie Carragher: Chelsea could lose Cole Palmer without Champions League football  Sky Sports",
          "date": "Fri, 14 Feb 2025 22:55:37 GMT"
        },
        {
          "title": "Brighton 3-0 Chelsea: How did Chelsea end up with no fit strikers?",
          "description": "Brighton 3-0 Chelsea: How did Chelsea end up with no fit strikers?  BBC.com",
          "date": "Fri, 14 Feb 2025 23:46:22 GMT"
        },
        {
          "title": "Why Lisandro Martinez wasn't shown red card for Cole Palmer challenge during Man United vs Chelsea",
          "description": "Why Lisandro Martinez wasn't shown red card for Cole Palmer challenge during Man United vs Chelsea  OneFootball",
          "date": "Fri, 14 Feb 2025 19:39:39 GMT"
        },
        {
          "title": "Every word Enzo Maresca said on Chelsea loss, Cole Palmer body language, fan chants",
          "description": "Every word Enzo Maresca said on Chelsea loss, Cole Palmer body language, fan chants  Football.London",
          "date": "Fri, 14 Feb 2025 23:12:42 GMT"
        },
        {
          "title": "Chelsea player ratings: 2/10 in defence as Palmer fails to deliver again",
          "description": "Chelsea player ratings: 2/10 in defence as Palmer fails to deliver again  Evening Standard",
          "date": "Fri, 14 Feb 2025 22:01:00 GMT"
        },
        {
          "title": "‘I don’t see Cole Palmer making same decision as me at Chelsea – it’d be big mistake'",
          "description": "‘I don’t see Cole Palmer making same decision as me at Chelsea – it’d be big mistake'  The Mirror",
          "date": "Fri, 14 Feb 2025 06:30:00 GMT"
        },
        {
          "title": "Brighton vs Chelsea player ratings: Three flops as Palmer embarrasses Maresca in meltdown",
          "description": "Brighton vs Chelsea player ratings: Three flops as Palmer embarrasses Maresca in meltdown  Express",
          "date": "Fri, 14 Feb 2025 21:55:00 GMT"
        },
        {
          "title": "Chelsea news: Has Cole Palmer become lukewarm?",
          "description": "Chelsea news: Has Cole Palmer become lukewarm?  BBC.com",
          "date": "Fri, 14 Feb 2025 12:57:07 GMT"
        },
        {
          "title": "Match report: Brighton 3-0 Chelsea",
          "description": "Match report: Brighton 3-0 Chelsea",
          "date": "Fri, 14 Feb 2025 22:00:00 GMT"
        }
      ]
    }
  ]
}