{
  "updated_at": "2025-03-21T06:49:37.891280+00:00",
  "player_news": [
    {
      "player_id": 361497,
      "player_name": "Dean Donny Huijsen",
      "trending_score": 100.0,
      "trend_summary": "Dean Huijsen, currently a Bournemouth defender, has debuted for the Spanish national team in the Nations League quarter-finals against the Netherlands, a decision met with a hostile reception in Rotterdam. Amidst transfer speculation linking him to Liverpool and Newcastle, Huijsen has expressed his preferred destination, while a new Premier League club has entered the race for the sought-after player.\n",
      "news": [
        {
          "title": "Dean Huijsen Joins Spanish National Team For Nations League Quarter-Finals",
          "description": "Dean Huijsen Joins Spanish National Team For Nations League Quarter-Finals  Evrim Ağacı",
          "date": "Fri, 21 Mar 2025 02:01:38 GMT"
        },
        {
          "title": "'Meant to be': Dean Huijsen debuts for Spain in and against country of birth",
          "description": "'Meant to be': Dean Huijsen debuts for Spain in and against country of birth  Flashscore.com",
          "date": "Fri, 21 Mar 2025 02:58:39 GMT"
        },
        {
          "title": "Dean Huijsen has no interest in Dutch drama after ‘dream’ Spain debut",
          "description": "Dean Huijsen has no interest in Dutch drama after ‘dream’ Spain debut  Football Espana",
          "date": "Thu, 20 Mar 2025 22:21:33 GMT"
        },
        {
          "title": "Dean Huijsen Embraces Spanish Identity Amid Hostility",
          "description": "Dean Huijsen Embraces Spanish Identity Amid Hostility  Evrim Ağacı",
          "date": "Thu, 20 Mar 2025 23:32:13 GMT"
        },
        {
          "title": "Bournemouth’s star defender Dean Huijsen: ‘My family is Dutch, but I feel Spanish’",
          "description": "Bournemouth’s star defender Dean Huijsen: ‘My family is Dutch, but I feel Spanish’  OneFootball",
          "date": "Thu, 20 Mar 2025 17:00:49 GMT"
        },
        {
          "title": "New Premier League club enter race for Bournemouth star Dean Huijsen and eye double swoop...",
          "description": "New Premier League club enter race for Bournemouth star Dean Huijsen and eye double swoop...  talkSPORT",
          "date": "Thu, 20 Mar 2025 14:28:12 GMT"
        },
        {
          "title": "Dean Huijsen tells Liverpool and Newcastle his preferred transfer destination",
          "description": "Dean Huijsen tells Liverpool and Newcastle his preferred transfer destination  TBR Football",
          "date": "Thu, 20 Mar 2025 13:15:00 GMT"
        },
        {
          "title": "Football: Soccer-Spain defender Huijsen gets hostile reception in Rotterdam",
          "description": "Football: Soccer-Spain defender Huijsen gets hostile reception in Rotterdam  The Star Online",
          "date": "Thu, 20 Mar 2025 23:19:00 GMT"
        },
        {
          "title": "Richard Hughes 'knows Dean Huijsen well' as two conditions set for £50m Liverpool transfer",
          "description": "Richard Hughes 'knows Dean Huijsen well' as two conditions set for £50m Liverpool transfer  Liverpool Echo",
          "date": "Thu, 20 Mar 2025 19:00:00 GMT"
        },
        {
          "title": "Dean Huijsen Makes Emotional Switch To Spain, Debuts Against Netherlands",
          "description": "Dean Huijsen Makes Emotional Switch To Spain, Debuts Against Netherlands  Evrim Ağacı",
          "date": "Thu, 20 Mar 2025 23:20:16 GMT"
        }
      ]
    },
    {
      "player_id": 339887,
      "player_name": "Can Yılmaz Uzun",
      "trending_score": 81.0,
      "trend_summary": "Can Uzun is in the spotlight as Türkiye prepares to face Hungary in a crucial UEFA Nations League play-off for promotion to League A. The young player's potential role comes as Türkiye deals with key absences and new call-ups for the high-stakes match.\n",
      "news": [
        {
          "title": "Türki̇ye-Hungary",
          "description": "Türki̇ye-Hungary",
          "date": "Fri, 21 Mar 2025 04:43:14 GMT"
        },
        {
          "title": "Türkiye to face Hungary in UEFA Nations League play-off: Key absences, new call-ups",
          "description": "Türkiye to face Hungary in UEFA Nations League play-off: Key absences, new call-ups  Türkiye Today",
          "date": "Thu, 20 Mar 2025 09:16:13 GMT"
        },
        {
          "title": "Turkey Battles Hungary for League A Promotion in Nations League Playoff",
          "description": "Turkey Battles Hungary for League A Promotion in Nations League Playoff  turkish football",
          "date": "Thu, 20 Mar 2025 11:33:46 GMT"
        }
      ]
    },
    {
      "player_id": 26256,
      "player_name": "Tim Kleindienst",
      "trending_score": 66.0,
      "trend_summary": "Based on the provided headlines, there is no mention of Tim Kleindienst. The articles primarily focus on the Germany vs. Italy Nations League match and other Nations League games.\n",
      "news": [
        {
          "title": "Italy 1-2 Germany: Initial Observations and Reactions",
          "description": "Italy 1-2 Germany: Initial Observations and Reactions  Bavarian Football Works",
          "date": "Fri, 21 Mar 2025 03:28:57 GMT"
        },
        {
          "title": "Spain grab late leveller against Dutch in Nations League, Croatia down France",
          "description": "Spain grab late leveller against Dutch in Nations League, Croatia down France  KTEN",
          "date": "Thu, 20 Mar 2025 23:17:36 GMT"
        },
        {
          "title": "Italy 1-2 Germany: Visitors come from behind to win first leg",
          "description": "Italy 1-2 Germany: Visitors come from behind to win first leg  UEFA.com",
          "date": "Fri, 21 Mar 2025 00:31:48 GMT"
        },
        {
          "title": "Italy 1-2 Germany: Visitors fight back to earn narrow first-leg lead",
          "description": "Italy 1-2 Germany: Visitors fight back to earn narrow first-leg lead  BBC.com",
          "date": "Thu, 20 Mar 2025 22:22:59 GMT"
        },
        {
          "title": "Germany win 2-1 in Italy in first step towards Nations League finals",
          "description": "Germany win 2-1 in Italy in first step towards Nations League finals  MSN",
          "date": "Thu, 20 Mar 2025 23:04:01 GMT"
        },
        {
          "title": "Italy shatter unpleasant records with capitulation to Germany",
          "description": "Italy shatter unpleasant records with capitulation to Germany  Football Italia",
          "date": "Thu, 20 Mar 2025 23:05:57 GMT"
        },
        {
          "title": "Spain grab late leveller against Dutch in Nations League, Croatia down France",
          "description": "Spain grab late leveller against Dutch in Nations League, Croatia down France  Northeast Mississippi Daily Journal",
          "date": "Thu, 20 Mar 2025 23:17:36 GMT"
        },
        {
          "title": "Germany player ratings against Italy",
          "description": "Germany player ratings against Italy  Bulinews.com",
          "date": "Thu, 20 Mar 2025 21:59:00 GMT"
        },
        {
          "title": "Spain grab late leveller against Dutch in Nations League, Croatia down France",
          "description": "Spain grab late leveller against Dutch in Nations League, Croatia down France  Black Hills Pioneer",
          "date": "Thu, 20 Mar 2025 23:17:36 GMT"
        },
        {
          "title": "UEFA Nations League quarterfinals: Goretzka winner helps Germany beat Italy 2-1 in first leg",
          "description": "UEFA Nations League quarterfinals: Goretzka winner helps Germany beat Italy 2-1 in first leg  Sportstar",
          "date": "Thu, 20 Mar 2025 22:45:59 GMT"
        }
      ]
    },
    {
      "player_id": 386828,
      "player_name": "Lamine Yamal Nasraoui Ebana",
      "trending_score": 29.0,
      "trend_summary": "Lamine Yamal's star continues to rise as he leads La Liga in goal creation, prompting Spain's coach to predict a historic career. The Barcelona player also featured in Spain's Nations League match against the Netherlands, while the reason for his unique jersey name choice has been revealed.\n",
      "news": [
        {
          "title": "Lamine Yamal impostor fools excited fan while casually walking down the street of Barcelona",
          "description": "Lamine Yamal impostor fools excited fan while casually walking down the street of Barcelona  Marca English",
          "date": "Thu, 20 Mar 2025 19:51:24 GMT"
        },
        {
          "title": "Lamine Yamal leads Real Madrid rivals as La Liga's No.1 goal creation machine",
          "description": "Lamine Yamal leads Real Madrid rivals as La Liga's No.1 goal creation machine  Sporting News",
          "date": "Thu, 20 Mar 2025 18:03:21 GMT"
        },
        {
          "title": "Reason why Lamine Yamal wears both names on his shirt but neither is related to his family",
          "description": "Reason why Lamine Yamal wears both names on his shirt but neither is related to his family  SPORTbible",
          "date": "Thu, 20 Mar 2025 16:01:45 GMT"
        },
        {
          "title": "Nations League: How the Barça internationals fared with Spain against the Netherlands",
          "description": "Nations League: How the Barça internationals fared with Spain against the Netherlands  FC Barcelona Noticias",
          "date": "Thu, 20 Mar 2025 22:48:00 GMT"
        },
        {
          "title": "Lamine Yamal continues ‘spectacular’ rise as Spain and Barcelona target trophies",
          "description": "Lamine Yamal continues ‘spectacular’ rise as Spain and Barcelona target trophies  MSN",
          "date": "Thu, 20 Mar 2025 12:46:15 GMT"
        },
        {
          "title": "Chelsea youngster ranked as second best teenager in world football, only Lamine Yamal is better",
          "description": "Chelsea youngster ranked as second best teenager in world football, only Lamine Yamal is better  The Chelsea Chronicle",
          "date": "Thu, 20 Mar 2025 16:30:00 GMT"
        },
        {
          "title": "'We will witness a historic player'",
          "description": "'We will witness a historic player'",
          "date": "Thu, 20 Mar 2025 12:00:00 GMT"
        },
        {
          "title": "Netherlands vs. Spain odds, where to watch, live stream: Nations League prediction, pick, predicted lineups",
          "description": "Netherlands vs. Spain odds, where to watch, live stream: Nations League prediction, pick, predicted lineups  CBS Sports",
          "date": "Thu, 20 Mar 2025 10:27:00 GMT"
        },
        {
          "title": "Barcelona Players Discuss Champions League Aspirations Amid Pressure",
          "description": "Barcelona Players Discuss Champions League Aspirations Amid Pressure  Evrim Ağacı",
          "date": "Thu, 20 Mar 2025 07:47:36 GMT"
        },
        {
          "title": "The reason why Lamine Yamal wears both names on his jersey, but neither is related to his family",
          "description": "The reason why Lamine Yamal wears both names on his jersey, but neither is related to his family  Telegrafi",
          "date": "Thu, 20 Mar 2025 17:12:43 GMT"
        }
      ]
    },
    {
      "player_id": 47311,
      "player_name": "Mikel Merino Zazón",
      "trending_score": 26.0,
      "trend_summary": "Mikel Merino etched his name into Spanish football folklore, scoring a dramatic stoppage-time equalizer against the Netherlands in the UEFA Nations League quarter-finals, rescuing a draw for the holders. Amidst the celebrations, Merino also revealed his preferred playing position, stating \"I never back down.\"\n",
      "news": [
        {
          "title": "Netherlands 2-2 Spain: Late Mikel Merino strike earns draw for holders",
          "description": "Netherlands 2-2 Spain: Late Mikel Merino strike earns draw for holders  UEFA.com",
          "date": "Thu, 20 Mar 2025 22:10:11 GMT"
        },
        {
          "title": "Netherlands 2–2 Spain: Player Ratings as Mikel Merino Scores Stoppage Time Equalizer for Spain",
          "description": "Netherlands 2–2 Spain: Player Ratings as Mikel Merino Scores Stoppage Time Equalizer for Spain  OneFootball",
          "date": "Fri, 21 Mar 2025 00:07:47 GMT"
        },
        {
          "title": "Mikel Merino rescues Spain as Croatia stun France in Nations League quarter-finals",
          "description": "Mikel Merino rescues Spain as Croatia stun France in Nations League quarter-finals  The Independent",
          "date": "Thu, 20 Mar 2025 22:40:00 GMT"
        },
        {
          "title": "Netherlands vs. Spain UEFA Nations League Highlights",
          "description": "Netherlands vs. Spain UEFA Nations League Highlights",
          "date": "Thu, 20 Mar 2025 22:11:06 GMT"
        },
        {
          "title": "Nations League: Merino saves Spain in Netherlands, Germany roar back at Italy",
          "description": "Nations League: Merino saves Spain in Netherlands, Germany roar back at Italy  The Guardian",
          "date": "Thu, 20 Mar 2025 23:44:00 GMT"
        },
        {
          "title": "Spain Scrape Last-Ditch Draw After 93rd-Minute Mikel Merino Equaliser vs Netherlands; France Lose",
          "description": "Spain Scrape Last-Ditch Draw After 93rd-Minute Mikel Merino Equaliser vs Netherlands; France Lose  NDTV Sports",
          "date": "Fri, 21 Mar 2025 03:11:30 GMT"
        },
        {
          "title": "Mikel Merino reveals preference over Arsenal position: ‘I never back down’",
          "description": "Mikel Merino reveals preference over Arsenal position: ‘I never back down’  MSN",
          "date": "Fri, 21 Mar 2025 02:03:45 GMT"
        },
        {
          "title": "Mikel Merino saves Spain! Arsenal star grabs stoppage-time equaliser against 10-man Netherlands as Nations League quarter-final tie ends all square",
          "description": "Mikel Merino saves Spain! Arsenal star grabs stoppage-time equaliser against 10-man Netherlands as Nations League quarter-final tie ends all square  Goal.com",
          "date": "Thu, 20 Mar 2025 21:59:24 GMT"
        },
        {
          "title": "Netherlands 2-2 Spain: La Roja survives a tumultuous day in Rotterdam",
          "description": "Netherlands 2-2 Spain: La Roja survives a tumultuous day in Rotterdam  FC Barcelona Noticias",
          "date": "Thu, 20 Mar 2025 22:03:00 GMT"
        },
        {
          "title": "Merino rescues draw for holders Spain against Netherlands",
          "description": "Merino rescues draw for holders Spain against Netherlands  The Financial Express BD",
          "date": "Fri, 21 Mar 2025 03:36:53 GMT"
        }
      ]
    }
  ]
}