{
  "updated_at": "2025-03-22T00:00:14.601128+00:00",
  "player_news": [
    {
      "player_id": 313245,
      "player_name": "Myles Anthony Lewis-Skelly",
      "trending_score": 100.0,
      "trend_summary": "Arsenal's Myles Lewis-Skelly shattered a 153-year record with a goal on his England debut against Albania, earning praise from Thomas Tuchel. Despite some questioning his future position, Declan Rice has backed Lewis-Skelly as a potential England left-back.\n",
      "news": [
        {
          "title": "Myles Lewis-Skelly: Arsenal full-back stars on England debut with goal against Albania",
          "description": "Myles Lewis-Skelly: Arsenal full-back stars on England debut with goal against Albania  BBC.com",
          "date": "Fri, 21 Mar 2025 22:58:27 GMT"
        },
        {
          "title": "Arsenal’s Myles Lewis-Skelly ‘lost for words’ after record-breaking England debut",
          "description": "Arsenal’s Myles Lewis-Skelly ‘lost for words’ after record-breaking England debut  The Athletic",
          "date": "Fri, 21 Mar 2025 22:11:46 GMT"
        },
        {
          "title": "Arsenal's Myles Lewis-Skelly Breaks England Record With Debut Goal vs. Albania",
          "description": "Arsenal's Myles Lewis-Skelly Breaks England Record With Debut Goal vs. Albania  Sports Illustrated",
          "date": "Fri, 21 Mar 2025 20:36:06 GMT"
        },
        {
          "title": "Thomas Tuchel has ‘fallen in love’ with ‘fearless’ England star after record-breaking debut",
          "description": "Thomas Tuchel has ‘fallen in love’ with ‘fearless’ England star after record-breaking debut  The Independent",
          "date": "Fri, 21 Mar 2025 23:18:00 GMT"
        },
        {
          "title": "England 2-0 Albania: Thomas Tuchel praises confident Myles Lewis-Skelly on debut as Marcus Rashford and Phil Foden struggle",
          "description": "England 2-0 Albania: Thomas Tuchel praises confident Myles Lewis-Skelly on debut as Marcus Rashford and Phil Foden struggle  Sky Sports",
          "date": "Fri, 21 Mar 2025 23:23:40 GMT"
        },
        {
          "title": "Arsenal star Myles Lewis-Skelly makes England history as he breaks 153-year record...",
          "description": "Arsenal star Myles Lewis-Skelly makes England history as he breaks 153-year record...  talkSPORT",
          "date": "Fri, 21 Mar 2025 21:40:00 GMT"
        },
        {
          "title": "Myles Lewis-Skelly shines, Phil Foden falters — but real tests lie in USA",
          "description": "Myles Lewis-Skelly shines, Phil Foden falters — but real tests lie in USA  The Times",
          "date": "Fri, 21 Mar 2025 22:15:00 GMT"
        },
        {
          "title": "Lewis-Skelly with an interesting record",
          "description": "Lewis-Skelly with an interesting record  KOHA.net",
          "date": "Fri, 21 Mar 2025 20:24:29 GMT"
        },
        {
          "title": "If we yearned to discover in England's 2-0 win over Albania what type of boss Thomas Tuchel is going to be, we",
          "description": "If we yearned to discover in England's 2-0 win over Albania what type of boss Thomas Tuchel is going to be, we  Daily Mail",
          "date": "Fri, 21 Mar 2025 21:41:10 GMT"
        },
        {
          "title": "Rice: I was mocked for saying Lewis-Skelly can be England's left-back",
          "description": "Rice: I was mocked for saying Lewis-Skelly can be England's left-back  Evening Standard",
          "date": "Fri, 21 Mar 2025 23:16:30 GMT"
        }
      ]
    },
    {
      "player_id": 762,
      "player_name": "Vinícius José Paixão de Oliveira Júnior",
      "trending_score": 88.0,
      "trend_summary": "Vinicius Junior delivered a 99th-minute winner for Brazil against Colombia in a World Cup qualifier, securing a 2-1 victory. Despite his heroics, Real Madrid is reportedly eyeing a Spain star as a potential replacement, while Chelsea has allegedly opened talks for a shocking transfer deal.\n",
      "news": [
        {
          "title": "Real Madrid reportedly targets Spain star as potential replacement for Vinicius Junior",
          "description": "Real Madrid reportedly targets Spain star as potential replacement for Vinicius Junior  World Soccer Talk",
          "date": "Fri, 21 Mar 2025 14:26:47 GMT"
        },
        {
          "title": "Vinicius Junior explains Raphinha talking to on Brazil duty",
          "description": "Vinicius Junior explains Raphinha talking to on Brazil duty  Football Espana",
          "date": "Fri, 21 Mar 2025 18:43:13 GMT"
        },
        {
          "title": "Vinícius Júnior launches 99th-minute winner to lift Brazil past Colombia",
          "description": "Vinícius Júnior launches 99th-minute winner to lift Brazil past Colombia  The Guardian",
          "date": "Fri, 21 Mar 2025 08:29:00 GMT"
        },
        {
          "title": "Chelsea chase SHOCK Vinicius Jr deal as 'talks opened'",
          "description": "Chelsea chase SHOCK Vinicius Jr deal as 'talks opened'  FootballTransfers",
          "date": "Fri, 21 Mar 2025 22:00:00 GMT"
        },
        {
          "title": "Brazil 2-1 Colombia: Vinicius Junior the hero deep in stoppage time",
          "description": "Brazil 2-1 Colombia: Vinicius Junior the hero deep in stoppage time  NBC Sports",
          "date": "Fri, 21 Mar 2025 03:33:27 GMT"
        },
        {
          "title": "Comparing Raphinha and Vinicius Junior’s surprisingly different records for Brazil",
          "description": "Comparing Raphinha and Vinicius Junior’s surprisingly different records for Brazil  MSN",
          "date": "Fri, 21 Mar 2025 06:15:11 GMT"
        },
        {
          "title": "Brazil 2–1 Colombia: Player Ratings As Raphinha, Vinicius Junior Secure Three Points for Selecao",
          "description": "Brazil 2–1 Colombia: Player Ratings As Raphinha, Vinicius Junior Secure Three Points for Selecao  Sports Illustrated",
          "date": "Fri, 21 Mar 2025 03:12:02 GMT"
        },
        {
          "title": "Brazil 2-1 Colombia: Vinicius Junior the hero deep in stoppage time",
          "description": "Brazil 2-1 Colombia: Vinicius Junior the hero deep in stoppage time  Yahoo Sports",
          "date": "Fri, 21 Mar 2025 02:55:00 GMT"
        },
        {
          "title": "Brazil player ratings vs Colombia: Vinicius Junior comes up clutch! Real Madrid superstar's last-gasp wonder-strike saves Selecao as Raphinha pulls the strings in vital World Cup qualifying win",
          "description": "Brazil player ratings vs Colombia: Vinicius Junior comes up clutch! Real Madrid superstar's last-gasp wonder-strike saves Selecao as Raphinha pulls the strings in vital World Cup qualifying win  Goal Singapore",
          "date": "Fri, 21 Mar 2025 08:28:09 GMT"
        },
        {
          "title": "Vinicius Junior scores last-gasp screamer as Brazil beat Colombia in World Cup qualifiers; watch video",
          "description": "Vinicius Junior scores last-gasp screamer as Brazil beat Colombia in World Cup qualifiers; watch video  Firstpost",
          "date": "Fri, 21 Mar 2025 05:25:03 GMT"
        }
      ]
    },
    {
      "player_id": 10329,
      "player_name": "João Pedro Junqueira de Jesus",
      "trending_score": 74.0,
      "trend_summary": "Brighton's João Pedro is attracting interest from Arsenal amid transfer speculation, while also earning a starting role for Brazil in their World Cup qualifying campaign against Colombia. However, a health scare during a BBB 25 challenge has also surfaced, adding an unexpected twist to the young player's recent headlines.\n",
      "news": [
        {
          "title": "Brighton’s Joao Pedro Captures Attention Amid Arsenal Interest",
          "description": "Brighton’s Joao Pedro Captures Attention Amid Arsenal Interest  Evrim Ağacı",
          "date": "Fri, 21 Mar 2025 06:33:48 GMT"
        },
        {
          "title": "João Pedro Set To Star For Brazil Against Colombia",
          "description": "João Pedro Set To Star For Brazil Against Colombia  Evrim Ağacı",
          "date": "Fri, 21 Mar 2025 01:58:15 GMT"
        },
        {
          "title": "Brazil player ratings vs Colombia: Vinicius Junior comes up clutch! Real Madrid superstar's last-gasp wonder-strike saves Selecao as Raphinha pulls the strings in vital World Cup qualifying win",
          "description": "Brazil player ratings vs Colombia: Vinicius Junior comes up clutch! Real Madrid superstar's last-gasp wonder-strike saves Selecao as Raphinha pulls the strings in vital World Cup qualifying win  GOAL English",
          "date": "Fri, 21 Mar 2025 08:16:48 GMT"
        },
        {
          "title": "Brazil vs. Colombia lineups, starting 11, confirmed team news, injuries: Neymar denied Selecao return",
          "description": "Brazil vs. Colombia lineups, starting 11, confirmed team news, injuries: Neymar denied Selecao return  Sporting News",
          "date": "Fri, 21 Mar 2025 00:25:00 GMT"
        },
        {
          "title": "Gus Poyet Sees Joao Pedro As Arsenal Striker Solution",
          "description": "Gus Poyet Sees Joao Pedro As Arsenal Striker Solution  Evrim Ağacı",
          "date": "Fri, 21 Mar 2025 05:46:34 GMT"
        },
        {
          "title": "João Pedro Faces Health Scare During BBB 25 Challenge",
          "description": "João Pedro Faces Health Scare During BBB 25 Challenge  Evrim Ağacı",
          "date": "Fri, 21 Mar 2025 01:54:32 GMT"
        },
        {
          "title": "Best Star's Harvest Evolution Picks In EA Sports FC 25",
          "description": "Best Star's Harvest Evolution Picks In EA Sports FC 25  TheGamer",
          "date": "Fri, 21 Mar 2025 23:30:00 GMT"
        },
        {
          "title": "How Joao Pedro fared as he started for Brazil in chase for World Cup place",
          "description": "How Joao Pedro fared as he started for Brazil in chase for World Cup place  The Argus",
          "date": "Fri, 21 Mar 2025 10:54:42 GMT"
        },
        {
          "title": "Vinicius's injury time winner saves Brazil",
          "description": "Vinicius's injury time winner saves Brazil  Mozzart Sport",
          "date": "Fri, 21 Mar 2025 08:38:07 GMT"
        },
        {
          "title": "Joao Pedro sends 'important' message amid Brighton exit clai...",
          "description": "Joao Pedro sends 'important' message amid Brighton exit clai...  Football Addict",
          "date": "Fri, 21 Mar 2025 12:32:49 GMT"
        }
      ]
    },
    {
      "player_id": 280,
      "player_name": "Alisson Ramsés Becker",
      "trending_score": 66.0,
      "trend_summary": "Liverpool's Alisson Becker has departed the Brazil squad and returned to Liverpool early after suffering a head injury during Brazil's win over Colombia. The injury, described as a suspected concussion resulting from a head clash, prompted a Liverpool statement and an injury update from Brazil's doctor.\n",
      "news": [
        {
          "title": "Alisson Becker departs Brazil squad",
          "description": "Alisson Becker departs Brazil squad  Liverpool FC",
          "date": "Fri, 21 Mar 2025 16:39:26 GMT"
        },
        {
          "title": "Liverpool’s Alisson Becker drops out after concussion",
          "description": "Liverpool’s Alisson Becker drops out after concussion  AS USA",
          "date": "Fri, 21 Mar 2025 20:17:41 GMT"
        },
        {
          "title": "Alisson: Liverpool goalkeeper leaves Brazil camp after 'suspected concussion'",
          "description": "Alisson: Liverpool goalkeeper leaves Brazil camp after 'suspected concussion'  BBC.com",
          "date": "Fri, 21 Mar 2025 17:56:14 GMT"
        },
        {
          "title": "Alisson Becker returns early from Brazil duty after suspected concussion",
          "description": "Alisson Becker returns early from Brazil duty after suspected concussion  The Independent",
          "date": "Fri, 21 Mar 2025 17:28:00 GMT"
        },
        {
          "title": "Alisson Becker forced off while on Brazil duty following sickening head clash with former Premier League rival",
          "description": "Alisson Becker forced off while on Brazil duty following sickening head clash with former Premier League rival  Daily Mail",
          "date": "Fri, 21 Mar 2025 12:34:13 GMT"
        },
        {
          "title": "Alisson returning to Liverpool early after suffering head injury in Brazil's win over Colombia",
          "description": "Alisson returning to Liverpool early after suffering head injury in Brazil's win over Colombia  Flashscore.com",
          "date": "Fri, 21 Mar 2025 17:31:33 GMT"
        },
        {
          "title": "Brazil’s Doctor Provides Injury Update on Liverpool’s Alisson Becker",
          "description": "Brazil’s Doctor Provides Injury Update on Liverpool’s Alisson Becker  OneFootball",
          "date": "Fri, 21 Mar 2025 10:41:13 GMT"
        },
        {
          "title": "Liverpool star Alisson Becker hit with injury blow as Brazil doctor provides key update",
          "description": "Liverpool star Alisson Becker hit with injury blow as Brazil doctor provides key update  MSN",
          "date": "Fri, 21 Mar 2025 10:17:26 GMT"
        },
        {
          "title": "Liverpool signing Giorgi Mamardashvili sends message to Alisson Becker for next season",
          "description": "Liverpool signing Giorgi Mamardashvili sends message to Alisson Becker for next season  Football Espana",
          "date": "Fri, 21 Mar 2025 15:30:17 GMT"
        },
        {
          "title": "Liverpool release statement as Alisson Becker decision made after injury scare",
          "description": "Liverpool release statement as Alisson Becker decision made after injury scare  Liverpool Echo",
          "date": "Fri, 21 Mar 2025 17:22:00 GMT"
        }
      ]
    },
    {
      "player_id": 184,
      "player_name": "Harry Edward Kane",
      "trending_score": 46.0,
      "trend_summary": "Harry Kane scored in England's 2-0 victory over Albania, securing Thomas Tuchel's first win as manager. Kane believes his move to Bayern Munich has improved his \"aura\" and increased respect for him, while also expressing that some England supporters take him for granted.\n",
      "news": [
        {
          "title": "How Thomas Tuchel got England's 2026 World Cup qualifying campaign off to the perfect start in first game",
          "description": "How Thomas Tuchel got England's 2026 World Cup qualifying campaign off to the perfect start in first game  The New York Times",
          "date": "Fri, 21 Mar 2025 23:00:22 GMT"
        },
        {
          "title": "Harry Kane and Jude Bellingham plan reveals England direction under Thomas Tuchel",
          "description": "Harry Kane and Jude Bellingham plan reveals England direction under Thomas Tuchel  The Independent",
          "date": "Fri, 21 Mar 2025 22:05:00 GMT"
        },
        {
          "title": "If we yearned to discover in England's 2-0 win over Albania what type of boss Thomas Tuchel is going to be, we",
          "description": "If we yearned to discover in England's 2-0 win over Albania what type of boss Thomas Tuchel is going to be, we  Daily Mail",
          "date": "Fri, 21 Mar 2025 21:41:10 GMT"
        },
        {
          "title": "Harry Kane: I am more respected since leaving Tottenham for Bayern Munich",
          "description": "Harry Kane: I am more respected since leaving Tottenham for Bayern Munich  Evening Standard",
          "date": "Fri, 21 Mar 2025 18:52:04 GMT"
        },
        {
          "title": "England 2-0 Albania LIVE REACTION: Thomas Tuchel wins first Three Lions game as Harry Kane and Myles...",
          "description": "England 2-0 Albania LIVE REACTION: Thomas Tuchel wins first Three Lions game as Harry Kane and Myles...  talkSPORT",
          "date": "Fri, 21 Mar 2025 21:40:15 GMT"
        },
        {
          "title": "Kane: 'Aura' improved after Spurs to Bayern move",
          "description": "Kane: 'Aura' improved after Spurs to Bayern move  ESPN",
          "date": "Fri, 21 Mar 2025 11:29:24 GMT"
        },
        {
          "title": "Harry Kane feels that 'bored' England supporters take him for granted",
          "description": "Harry Kane feels that 'bored' England supporters take him for granted  Flashscore.com",
          "date": "Fri, 21 Mar 2025 07:51:21 GMT"
        },
        {
          "title": "England Captain Harry Kane Feels Underrated As A Goalscorer, Eyes Ballon D’Or Glory With Bayern",
          "description": "England Captain Harry Kane Feels Underrated As A Goalscorer, Eyes Ballon D’Or Glory With Bayern  Outlook India",
          "date": "Fri, 21 Mar 2025 17:32:46 GMT"
        },
        {
          "title": "England 2-0 Albania: Myles Lewis-Skelly and Harry Kane seal first win for Thomas Tuchel",
          "description": "England 2-0 Albania: Myles Lewis-Skelly and Harry Kane seal first win for Thomas Tuchel  Metro.co.uk",
          "date": "Fri, 21 Mar 2025 18:33:00 GMT"
        },
        {
          "title": "Harry Kane's FIRST Premier League hat-trick",
          "description": "Harry Kane's FIRST Premier League hat-trick",
          "date": "Fri, 21 Mar 2025 09:52:08 GMT"
        }
      ]
    }
  ]
}