{
  "updated_at": "2025-01-11T11:58:31.884554+00:00",
  "player_news": [
    {
      "player_id": 360114,
      "player_name": "Abduqodir Khusanov",
      "trending_score": 100.0,
      "trend_summary": "Manchester City has reportedly agreed to a £33.6 million deal with Lens to sign highly-rated Uzbekistani defender Abdukodir Khusanov, a move that signals the start of the club's squad rebuild. The 20-year-old center-back, known for his speed, power, and aggression, missed Lens training amid the transfer talks, which are expected to be finalized soon.",
      "news": [
        {
          "title": "Manchester City reach agreement with Lens for Abdukodir Khusanov signing",
          "description": "Manchester City reach agreement with Lens for Abdukodir Khusanov signing",
          "date": "Fri, 10 Jan 2025 20:48:35 GMT"
        },
        {
          "title": "Abdukodir Khusanov to Man City: 'Tank' of a Centre-Back Will Bring Speed, Power and Aggression",
          "description": "Abdukodir Khusanov to Man City: 'Tank' of a Centre-Back Will Bring Speed, Power and Aggression  The Analyst",
          "date": "Fri, 10 Jan 2025 17:09:59 GMT"
        },
        {
          "title": "Sources: City agree deal for 20yo CB Khusanov",
          "description": "Sources: City agree deal for 20yo CB Khusanov  ESPN",
          "date": "Fri, 10 Jan 2025 19:09:51 GMT"
        },
        {
          "title": "The raw potential of Abdukodir Khusanov signals the start of Manchester City’s rebuild",
          "description": "The raw potential of Abdukodir Khusanov signals the start of Manchester City’s rebuild",
          "date": "Fri, 10 Jan 2025 21:36:08 GMT"
        },
        {
          "title": "Abdukodir Khusanov: Manchester City agree £33.6m deal for Lens defender",
          "description": "Abdukodir Khusanov: Manchester City agree £33.6m deal for Lens defender  BBC.com",
          "date": "Fri, 10 Jan 2025 14:53:18 GMT"
        },
        {
          "title": "Sources: City agree deal for Lens CB Khusanov",
          "description": "Sources: City agree deal for Lens CB Khusanov  ESPN.co.uk",
          "date": "Fri, 10 Jan 2025 18:50:00 GMT"
        },
        {
          "title": "Abdukodir Khusanov: Manchester City's £33.5m bid for defender accepted by Lens after Omar Marmoush deal agreed in principle",
          "description": "Abdukodir Khusanov: Manchester City's £33.5m bid for defender accepted by Lens after Omar Marmoush deal agreed in principle  Sky Sports",
          "date": "Fri, 10 Jan 2025 21:03:21 GMT"
        },
        {
          "title": "Abdukodir Khusanov misses Lens training as Manchester City agreement draws near",
          "description": "Abdukodir Khusanov misses Lens training as Manchester City agreement draws near  Yahoo Canada Sports",
          "date": "Fri, 10 Jan 2025 12:13:00 GMT"
        },
        {
          "title": "Abdukodir Khusanov: Man City in talks to sign 20-year-old Uzbekistan international defender",
          "description": "Abdukodir Khusanov: Man City in talks to sign 20-year-old Uzbekistan international defender  The Independent",
          "date": "Fri, 10 Jan 2025 20:17:00 GMT"
        },
        {
          "title": "Manchester City reach final agreement with Lens over Abdukodir Khusanov",
          "description": "Manchester City reach final agreement with Lens over Abdukodir Khusanov  OneFootball",
          "date": "Fri, 10 Jan 2025 22:09:53 GMT"
        }
      ]
    },
    {
      "player_id": 203224,
      "player_name": "Florian Richard Wirtz",
      "trending_score": 89.0,
      "trend_summary": "Florian Wirtz missed Bayer Leverkusen's match against Dortmund due to an unexpected issue, leaving manager Xabi Alonso to explain his absence. Amidst transfer rumors linking him to Bayern Munich and Manchester City, Wirtz's fitness remains a concern as he faces an uncertain future.",
      "news": [
        {
          "title": "Xabi Alonso explains Florian Wirtz’ absence from Bayer Leverkusen’s starting XI vs Dortmund",
          "description": "Xabi Alonso explains Florian Wirtz’ absence from Bayer Leverkusen’s starting XI vs Dortmund  OneFootball",
          "date": "Sat, 11 Jan 2025 07:34:26 GMT"
        },
        {
          "title": "What’s Next for Florian Wirtz? Transfers on the Horizon!",
          "description": "What’s Next for Florian Wirtz? Transfers on the Horizon!  Qhubo",
          "date": "Fri, 10 Jan 2025 19:04:02 GMT"
        },
        {
          "title": "Why Bayern Munich expect to sign Florian Wirtz",
          "description": "Why Bayern Munich expect to sign Florian Wirtz  OneFootball",
          "date": "Fri, 10 Jan 2025 15:00:23 GMT"
        },
        {
          "title": "Xabi Alonso explains Florian Wirtz’ absence from Bayer Leverkusen’s starting XI vs Dortmund",
          "description": "Xabi Alonso explains Florian Wirtz’ absence from Bayer Leverkusen’s starting XI vs Dortmund  Yahoo Sports",
          "date": "Sat, 11 Jan 2025 06:37:00 GMT"
        },
        {
          "title": "“Something unexpected happened” – Why Florian Wirtz was left out of Bayer Leverkusen’s starting XI vs Dortmund",
          "description": "“Something unexpected happened” – Why Florian Wirtz was left out of Bayer Leverkusen’s starting XI vs Dortmund  Yahoo Sports",
          "date": "Fri, 10 Jan 2025 21:08:00 GMT"
        },
        {
          "title": "Report: City Set Their Sights on Bundesliga Star Amid Kevin De Bruyne’s Fitness Concerns",
          "description": "Report: City Set Their Sights on Bundesliga Star Amid Kevin De Bruyne’s Fitness Concerns  OneFootball",
          "date": "Fri, 10 Jan 2025 22:19:03 GMT"
        }
      ]
    },
    {
      "player_id": 517,
      "player_name": "James David Rodríguez Rubio",
      "trending_score": 87.0,
      "trend_summary": "James Rodríguez's future remains uncertain as reports emerge linking him to Mexican club León, while a potential move to Junior in Colombia has reportedly fallen through. Despite rumors of a move to Mexico, FootBoom reports that the midfielder will instead join Junior, with negotiations reaching an advanced stage.",
      "news": [
        {
          "title": "James Rodríguez to Join León",
          "description": "James Rodríguez to Join León  OneFootball",
          "date": "Fri, 10 Jan 2025 23:27:53 GMT"
        },
        {
          "title": "James Rodríguez Will Not Move to Mexico, Joins Junior",
          "description": "James Rodríguez Will Not Move to Mexico, Joins Junior  FootBoom",
          "date": "Sat, 11 Jan 2025 00:33:19 GMT"
        },
        {
          "title": "CLOSED: James Rodriguez has a new team and will play in the Club World Cup",
          "description": "CLOSED: James Rodriguez has a new team and will play in the Club World Cup  fichajes.net",
          "date": "Fri, 10 Jan 2025 20:46:47 GMT"
        },
        {
          "title": "James joins a new team",
          "description": "James joins a new team  Yalla Shoot",
          "date": "Fri, 10 Jan 2025 20:58:33 GMT"
        },
        {
          "title": "León Looks to Pair Him Up with James Rodríguez? Andrés Guardado Registered for CL2025",
          "description": "León Looks to Pair Him Up with James Rodríguez? Andrés Guardado Registered for CL2025  FootBoom",
          "date": "Sat, 11 Jan 2025 03:22:27 GMT"
        },
        {
          "title": "James Rodríguez's Replacement at Rayo Vallecano is Another Exotic Signing",
          "description": "James Rodríguez's Replacement at Rayo Vallecano is Another Exotic Signing  FootBoom",
          "date": "Sat, 11 Jan 2025 07:02:44 GMT"
        },
        {
          "title": "When Will James Rodríguez Respond to Junior? Expectations for Transfer",
          "description": "When Will James Rodríguez Respond to Junior? Expectations for Transfer  FootBoom",
          "date": "Sat, 11 Jan 2025 04:06:30 GMT"
        },
        {
          "title": "León Goes 'Fiera': Signs James Rodríguez and Brings Guardado Out of Retirement",
          "description": "León Goes 'Fiera': Signs James Rodríguez and Brings Guardado Out of Retirement  FootBoom",
          "date": "Sat, 11 Jan 2025 02:08:13 GMT"
        },
        {
          "title": "\"It's Off\": Fuad Char Reveals James Rodríguez Won't Join Junior Due to This Reason",
          "description": "\"It's Off\": Fuad Char Reveals James Rodríguez Won't Join Junior Due to This Reason  FootBoom",
          "date": "Sat, 11 Jan 2025 02:50:22 GMT"
        },
        {
          "title": "Junior Raises the Stakes: Juicy Figures Revealed for James Rodríguez Transfer Negotiations",
          "description": "Junior Raises the Stakes: Juicy Figures Revealed for James Rodríguez Transfer Negotiations  FootBoom",
          "date": "Sat, 11 Jan 2025 00:07:11 GMT"
        }
      ]
    },
    {
      "player_id": 794,
      "player_name": "Patrik Schick",
      "trending_score": 86.0,
      "trend_summary": "In a thrilling Bundesliga clash, Patrik Schick fired a first-half brace to lead Bayer Leverkusen to a 3-2 victory over Borussia Dortmund, handing the hosts their first home defeat of the season. Schick's goals extend his impressive form, as he continues to play a pivotal role in Leverkusen's pursuit of league leaders Bayern Munich.",
      "news": [
        {
          "title": "German Bundesliga 2024-25: Patrik Schick's Brace Helps Bayer Leverkusen Beat Borussia Dortmund",
          "description": "German Bundesliga 2024-25: Patrik Schick's Brace Helps Bayer Leverkusen Beat Borussia Dortmund",
          "date": "Sat, 11 Jan 2025 11:26:00 GMT"
        },
        {
          "title": "Borussia Dortmund 2-3 Bayer Leverkusen: Patrik Schick scores twice for visitors",
          "description": "Borussia Dortmund 2-3 Bayer Leverkusen: Patrik Schick scores twice for visitors  BBC.com",
          "date": "Sat, 11 Jan 2025 11:37:27 GMT"
        },
        {
          "title": "Patrik Schick and Bayer Leverkusen’s flying start catches Dortmund cold",
          "description": "Patrik Schick and Bayer Leverkusen’s flying start catches Dortmund cold  The Guardian",
          "date": "Fri, 10 Jan 2025 23:09:00 GMT"
        },
        {
          "title": "Soccer-Leverkusen stun hosts Dortmund 3-2 to close on leaders Bayern",
          "description": "Soccer-Leverkusen stun hosts Dortmund 3-2 to close on leaders Bayern  MSN",
          "date": "Sat, 11 Jan 2025 01:02:31 GMT"
        },
        {
          "title": "Bundesliga: First-half flurry sees Bayer Leverkusen edge Dortmund 3-2 in five-goal thriller",
          "description": "Bundesliga: First-half flurry sees Bayer Leverkusen edge Dortmund 3-2 in five-goal thriller  Flashscore.com",
          "date": "Sat, 11 Jan 2025 07:50:11 GMT"
        },
        {
          "title": "Patrick Schick, a troubled Yan Couto, and more",
          "description": "Patrick Schick, a troubled Yan Couto, and more",
          "date": "Fri, 10 Jan 2025 22:03:18 GMT"
        },
        {
          "title": "Patrik Schick bags first-half brace as Leverkusen edge win at Borussia Dortmund",
          "description": "Patrik Schick bags first-half brace as Leverkusen edge win at Borussia Dortmund  PLZ Soccer",
          "date": "Fri, 10 Jan 2025 22:51:32 GMT"
        },
        {
          "title": "Borussia Dortmund 2-3 Bayer Leverkusen, Bundesliga: Schick Double Hands Hosts First Home Defeat",
          "description": "Borussia Dortmund 2-3 Bayer Leverkusen, Bundesliga: Schick Double Hands Hosts First Home Defeat  Outlook India",
          "date": "Sat, 11 Jan 2025 01:47:47 GMT"
        },
        {
          "title": "Bayer Leverkusen Triumphs Over Borussia Dortmund With Schick's Two Goals In Bundesliga Match",
          "description": "Bayer Leverkusen Triumphs Over Borussia Dortmund With Schick's Two Goals In Bundesliga Match  myKhel",
          "date": "Fri, 10 Jan 2025 22:38:46 GMT"
        },
        {
          "title": "Football: Soccer-Leverkusen stun hosts Dortmund 3-2 to close on leaders Bayern",
          "description": "Football: Soccer-Leverkusen stun hosts Dortmund 3-2 to close on leaders Bayern  The Star Online",
          "date": "Fri, 10 Jan 2025 22:04:00 GMT"
        }
      ]
    },
    {
      "player_id": 185477,
      "player_name": "Rodrigo Sánchez Rodríguez",
      "trending_score": 78.0,
      "trend_summary": "Manchester City's Rodri has been the subject of praise after receiving a congratulatory text from Lionel Messi following his 2024 Ballon d'Or triumph. Despite being excluded from Darren Bent's top five Premier League players, Rodri remains a key figure for City, with manager Pep Guardiola expressing excitement for their upcoming FA Cup clash against Salford City.",
      "news": [
        {
          "title": "Club insider reveals Lionel Messi text to Rodri after 2024 Ballon d’Or win",
          "description": "Club insider reveals Lionel Messi text to Rodri after 2024 Ballon d’Or win  OneFootball",
          "date": "Fri, 10 Jan 2025 22:19:03 GMT"
        },
        {
          "title": "Darren Bent names the top five players in the Premier League right now – and there’s no room for Cole Pal...",
          "description": "Darren Bent names the top five players in the Premier League right now – and there’s no room for Cole Pal...  talkSPORT",
          "date": "Sat, 11 Jan 2025 10:32:39 GMT"
        },
        {
          "title": "Guardiola relishing 'hometown' FA Cup tie with class of 92's Salford",
          "description": "Guardiola relishing 'hometown' FA Cup tie with class of 92's Salford  theScore",
          "date": "Fri, 10 Jan 2025 14:51:06 GMT"
        },
        {
          "title": "After Marmoush: Man City chase £70m ace who's \"very similar to Bellingham\"",
          "description": "After Marmoush: Man City chase £70m ace who's \"very similar to Bellingham\"  Football Transfer Tavern",
          "date": "Fri, 10 Jan 2025 17:15:00 GMT"
        },
        {
          "title": "Pep Guardiola issues response to Real Madrid’s Ballon d’Or boycott after Rodri success and Vinicius snub",
          "description": "Pep Guardiola issues response to Real Madrid’s Ballon d’Or boycott after Rodri success and Vinicius snub  OneFootball",
          "date": "Fri, 10 Jan 2025 14:42:45 GMT"
        },
        {
          "title": "Manchester City vs Salford City: Match Preview and Prediction",
          "description": "Manchester City vs Salford City: Match Preview and Prediction  FootBoom",
          "date": "Fri, 10 Jan 2025 20:50:23 GMT"
        },
        {
          "title": "Man City transfer news: Pep Guardiola makes stance on new signings crystal clear amid Omar Marmoush, Abdukodir Khusanov, Vitor Reis links",
          "description": "Man City transfer news: Pep Guardiola makes stance on new signings crystal clear amid Omar Marmoush, Abdukodir Khusanov, Vitor Reis links  Sports Mole",
          "date": "Fri, 10 Jan 2025 14:00:00 GMT"
        },
        {
          "title": "Man City submit £41m+ bid to sign \"monster\" who is faster than Haaland",
          "description": "Man City submit £41m+ bid to sign \"monster\" who is faster than Haaland  Football Transfer Tavern",
          "date": "Fri, 10 Jan 2025 20:20:00 GMT"
        },
        {
          "title": "Fresh Air for Guardiola: City Secures First 'Signing'",
          "description": "Fresh Air for Guardiola: City Secures First 'Signing'  FootBoom",
          "date": "Fri, 10 Jan 2025 16:37:02 GMT"
        },
        {
          "title": "Ivan Kalyuzhny: \"I dream of playing for Manchester City\" (Jan. 10, 2025)",
          "description": "Ivan Kalyuzhny: \"I dream of playing for Manchester City\" (Jan. 10, 2025)  Динамо Киев от Шурика",
          "date": "Fri, 10 Jan 2025 12:11:00 GMT"
        }
      ]
    }
  ]
}