{
  "updated_at": "2025-01-23T12:55:58.366538+00:00",
  "player_news": [
    {
      "player_id": 161904,
      "player_name": "Bradley Barcola",
      "trending_score": 100.0,
      "trend_summary": "In a thrilling Champions League clash, 19-year-old Bradley Barcola stole the show for Paris Saint-Germain, leveling the score against Manchester City and contributing to a stunning comeback victory that leaves the English giants on the brink of elimination. Barcola's performance has sparked transfer rumors, with Manchester City reportedly considering a record-breaking bid for the French starlet.",
      "news": [
        {
          "title": "Manchester City could break the bank for this European star",
          "description": "Manchester City could break the bank for this European star  fichajes.net",
          "date": "Thu, 23 Jan 2025 09:15:00 GMT"
        },
        {
          "title": "Video: Man City Bottles Their Lead as Bradley Barcola Levels for PSG",
          "description": "Video: Man City Bottles Their Lead as Bradley Barcola Levels for PSG  OneFootball",
          "date": "Wed, 22 Jan 2025 21:37:44 GMT"
        },
        {
          "title": "How Manchester City squandered a 2-0 lead in damaging Champions League defeat to Paris Saint-Germain",
          "description": "How Manchester City squandered a 2-0 lead in damaging Champions League defeat to Paris Saint-Germain  The New York Times",
          "date": "Wed, 22 Jan 2025 23:45:48 GMT"
        },
        {
          "title": "Soccer-PSG roar back to stun Manchester City",
          "description": "Soccer-PSG roar back to stun Manchester City  MSN",
          "date": "Thu, 23 Jan 2025 01:14:54 GMT"
        },
        {
          "title": "PSG vs Manchester City: Dembélé Shines as Barcola Steals the Show",
          "description": "PSG vs Manchester City: Dembélé Shines as Barcola Steals the Show  FootBoom",
          "date": "Wed, 22 Jan 2025 21:50:24 GMT"
        },
        {
          "title": "Watch Champions League MOTD as PSG stun Man City, Celtic and Arsenal win",
          "description": "Watch Champions League MOTD as PSG stun Man City, Celtic and Arsenal win  BBC.com",
          "date": "Wed, 22 Jan 2025 21:02:10 GMT"
        },
        {
          "title": "PSG Stages Stunning Comeback To Defeat Manchester City",
          "description": "PSG Stages Stunning Comeback To Defeat Manchester City  Evrim Ağacı",
          "date": "Thu, 23 Jan 2025 00:34:22 GMT"
        },
        {
          "title": "PSG roar back to win crucial Champions League clash with Man City",
          "description": "PSG roar back to win crucial Champions League clash with Man City",
          "date": "Wed, 22 Jan 2025 22:01:00 GMT"
        },
        {
          "title": "Manchester City collapse in calamitous defeat at Paris Saint-Germain",
          "description": "Manchester City collapse in calamitous defeat at Paris Saint-Germain  The Guardian",
          "date": "Wed, 22 Jan 2025 22:53:31 GMT"
        },
        {
          "title": "PSG stage stunning comeback to put Man City on brink of Champions League exit",
          "description": "PSG stage stunning comeback to put Man City on brink of Champions League exit  Tribal Football",
          "date": "Thu, 23 Jan 2025 00:08:24 GMT"
        }
      ]
    },
    {
      "player_id": 10009,
      "player_name": "Rodrygo Silva de Goes",
      "trending_score": 86.0,
      "trend_summary": "Rodrygo Goes, the rising Brazilian star, demanded respect after scoring a brace in Real Madrid's 5-1 Champions League victory over Salzburg, showcasing his exceptional talent and earning praise as the \"most underappreciated superstar in world football.\"",
      "news": [
        {
          "title": "Real Madrid 5 Salzburg 1 – Rodrygo demands respect, brilliant Bellingham, Vinicius Jr to miss Brest",
          "description": "Real Madrid 5 Salzburg 1 – Rodrygo demands respect, brilliant Bellingham, Vinicius Jr to miss Brest",
          "date": "Wed, 22 Jan 2025 22:02:32 GMT"
        },
        {
          "title": "Rodrygo and Vinícius double up as Real Madrid hit five past hapless Salzburg",
          "description": "Rodrygo and Vinícius double up as Real Madrid hit five past hapless Salzburg  The Guardian",
          "date": "Thu, 23 Jan 2025 04:41:00 GMT"
        },
        {
          "title": "Rodrygo reveals what Vinícius said to his teammates after his expulsion at Mestalla",
          "description": "Rodrygo reveals what Vinícius said to his teammates after his expulsion at Mestalla  Real Madrid Confidencial",
          "date": "Thu, 23 Jan 2025 05:30:00 GMT"
        },
        {
          "title": "\"Most underappreciated superstar in world football\"",
          "description": "\"Most underappreciated superstar in world football\"",
          "date": "Thu, 23 Jan 2025 00:19:00 GMT"
        },
        {
          "title": "Champions League: Rodrygo scores for Real Madrid",
          "description": "Champions League: Rodrygo scores for Real Madrid  BBC.com",
          "date": "Wed, 22 Jan 2025 22:00:44 GMT"
        },
        {
          "title": "Bellingham's Brilliant Back-Heel Assist Sends Rodrygo Free in Champions League Win",
          "description": "Bellingham's Brilliant Back-Heel Assist Sends Rodrygo Free in Champions League Win  FootBoom",
          "date": "Wed, 22 Jan 2025 22:12:57 GMT"
        },
        {
          "title": "WATCH: Real Madrid double advantage over RB Salzburg courtesy of Rodrygo Goes' second",
          "description": "WATCH: Real Madrid double advantage over RB Salzburg courtesy of Rodrygo Goes' second  Football Espana",
          "date": "Wed, 22 Jan 2025 20:39:27 GMT"
        },
        {
          "title": "Soccer-Real Madrid thrash Salzburg 5-1 with Rodrygo and Vinicius doubles",
          "description": "Soccer-Real Madrid thrash Salzburg 5-1 with Rodrygo and Vinicius doubles  MSN",
          "date": "Thu, 23 Jan 2025 00:02:10 GMT"
        },
        {
          "title": "Real Madrid 5-1 RB Salzburg (22 Jan, 2025) Game Analysis",
          "description": "Real Madrid 5-1 RB Salzburg (22 Jan, 2025) Game Analysis  ESPN.co.uk",
          "date": "Wed, 22 Jan 2025 15:09:00 GMT"
        },
        {
          "title": "Real Madrid vs RB Salzburg Highlights: RMA 5-1 SAL; Vinicius, Rodrygo score brace; Mbappe finds net",
          "description": "Real Madrid vs RB Salzburg Highlights: RMA 5-1 SAL; Vinicius, Rodrygo score brace; Mbappe finds net  Sportstar",
          "date": "Wed, 22 Jan 2025 21:52:37 GMT"
        }
      ]
    },
    {
      "player_id": 762,
      "player_name": "Vinícius José Paixão de Oliveira Júnior",
      "trending_score": 85.0,
      "trend_summary": "Vinicius Junior reached a century of goals for Real Madrid, scoring a brace in their 5-0 Champions League triumph over Salzburg. Despite his on-field success, the Brazilian forward's future remains uncertain, with reports suggesting a world-record €350 million bid from the Saudi Pro League.",
      "news": [
        {
          "title": "Vinicius Jr brings up Real Madrid century – but will (another) booking prove costly?",
          "description": "Vinicius Jr brings up Real Madrid century – but will (another) booking prove costly?",
          "date": "Thu, 23 Jan 2025 07:48:47 GMT"
        },
        {
          "title": "Vinicius Junior and Rodrygo bag braces as five-star Real Madrid thump sorry Salzburg",
          "description": "Vinicius Junior and Rodrygo bag braces as five-star Real Madrid thump sorry Salzburg  Flashscore.com",
          "date": "Thu, 23 Jan 2025 11:20:55 GMT"
        },
        {
          "title": "Real Madrid star Vinicius Junior admits he expected to win Ballon d’Or",
          "description": "Real Madrid star Vinicius Junior admits he expected to win Ballon d’Or  Football Espana",
          "date": "Thu, 23 Jan 2025 10:56:35 GMT"
        },
        {
          "title": "Netflix Announces Vinicius Junior Documentary Coming in 2025",
          "description": "Netflix Announces Vinicius Junior Documentary Coming in 2025  OneFootball",
          "date": "Thu, 23 Jan 2025 07:20:00 GMT"
        },
        {
          "title": "Vinicius Junior completes 100 goals for Real Madrid: Key stats",
          "description": "Vinicius Junior completes 100 goals for Real Madrid: Key stats  NewsBytes",
          "date": "Wed, 22 Jan 2025 22:50:06 GMT"
        },
        {
          "title": "Revealed: The staggering world-record fee Saudi Pro League is prepared to splurge on Vinicius Jr as potential destination emerges for Real Madrid superstar",
          "description": "Revealed: The staggering world-record fee Saudi Pro League is prepared to splurge on Vinicius Jr as potential destination emerges for Real Madrid superstar  Goal.com",
          "date": "Wed, 22 Jan 2025 18:57:10 GMT"
        },
        {
          "title": "Saudi Pro League still keen on signing Real Madrid's Vinicius Junior",
          "description": "Saudi Pro League still keen on signing Real Madrid's Vinicius Junior  MSN",
          "date": "Thu, 23 Jan 2025 00:33:49 GMT"
        },
        {
          "title": "Football transfer rumours: Garnacho's Man Utd exit collapses; Real Madrid receive €350m Vinicius bid",
          "description": "Football transfer rumours: Garnacho's Man Utd exit collapses; Real Madrid receive €350m Vinicius bid  90min UK",
          "date": "Thu, 23 Jan 2025 09:00:00 GMT"
        },
        {
          "title": "Real Madrid injury, suspension news vs. Real Valladolid: Will Vinicius Junior be available?",
          "description": "Real Madrid injury, suspension news vs. Real Valladolid: Will Vinicius Junior be available?  Sports Mole",
          "date": "Thu, 23 Jan 2025 10:57:00 GMT"
        },
        {
          "title": "Vinicius Junior: Saudis to decimate world record with €350m offer as insider urges 'watch this space'",
          "description": "Vinicius Junior: Saudis to decimate world record with €350m offer as insider urges 'watch this space'  TEAMtalk",
          "date": "Wed, 22 Jan 2025 22:42:05 GMT"
        }
      ]
    },
    {
      "player_id": 19187,
      "player_name": "Jack Peter Grealish",
      "trending_score": 78.0,
      "trend_summary": "Jack Grealish's candid assessment of Manchester City's \"weird\" Champions League performance has raised concerns about the team's form, while the English international has also revealed his secret Gaelic football past, crediting the sport for toughening him up on the pitch.",
      "news": [
        {
          "title": "Jack Grealish knows Manchester City have no margin for error in Champions League",
          "description": "Jack Grealish knows Manchester City have no margin for error in Champions League  The Independent",
          "date": "Thu, 23 Jan 2025 10:46:00 GMT"
        },
        {
          "title": "Jack Grealish laments ‘weird’ Man City performance that leaves them on brink of Champions League exit...",
          "description": "Jack Grealish laments ‘weird’ Man City performance that leaves them on brink of Champions League exit...  talkSPORT",
          "date": "Thu, 23 Jan 2025 09:17:29 GMT"
        },
        {
          "title": "Jack Grealish calls out 'weird' Man City performance in honest interview as club on brink of Champions League exit",
          "description": "Jack Grealish calls out 'weird' Man City performance in honest interview as club on brink of Champions League exit  SPORTbible",
          "date": "Thu, 23 Jan 2025 07:38:54 GMT"
        },
        {
          "title": "Pep Guardiola and Jack Grealish admission underline how far Man City have fallen",
          "description": "Pep Guardiola and Jack Grealish admission underline how far Man City have fallen  Sporting News",
          "date": "Wed, 22 Jan 2025 23:25:09 GMT"
        },
        {
          "title": "Jack Grealish agrees with Pep Guardiola as sobering Man City confession speaks volumes",
          "description": "Jack Grealish agrees with Pep Guardiola as sobering Man City confession speaks volumes  The Mirror",
          "date": "Thu, 23 Jan 2025 07:21:00 GMT"
        },
        {
          "title": "Jack Grealish explains how his secret Gaelic football career helped ‘toughen’ him up",
          "description": "Jack Grealish explains how his secret Gaelic football career helped ‘toughen’ him up  MSN",
          "date": "Wed, 22 Jan 2025 19:25:02 GMT"
        },
        {
          "title": "Daily Schmankerl: The aftermath of Bayern Munich vs. Feyenoord; Bayern’s Daniel Peretz spurned multiple offers; Manchester City, Real Madrid tracking Florian Wirtz; Jack Grealish to Borussia Dortmund?; Manchester United’s Ruben Amorim unravels; and M",
          "description": "Daily Schmankerl: The aftermath of Bayern Munich vs. Feyenoord; Bayern’s Daniel Peretz spurned multiple offers; Manchester City, Real Madrid tracking Florian Wirtz; Jack Grealish to Borussia Dortmund?; Manchester United’s Ruben Amorim unravels; and M  Bavarian Football Works",
          "date": "Thu, 23 Jan 2025 05:00:00 GMT"
        },
        {
          "title": "Man Utd striker shortlist includes Matheus Cunha, Bryan Mbeumo, Liam Delap and Jonathan David",
          "description": "Man Utd striker shortlist includes Matheus Cunha, Bryan Mbeumo, Liam Delap and Jonathan David",
          "date": "Wed, 22 Jan 2025 22:10:27 GMT"
        },
        {
          "title": "Jack Grealish throwaway comment exposes concerning Man City issue that needs urgent attention",
          "description": "Jack Grealish throwaway comment exposes concerning Man City issue that needs urgent attention  Manchester Evening News",
          "date": "Thu, 23 Jan 2025 07:00:00 GMT"
        },
        {
          "title": "Why Jack Grealish was stopped from playing Gaelic football",
          "description": "Why Jack Grealish was stopped from playing Gaelic football  EVOKE",
          "date": "Wed, 22 Jan 2025 14:33:21 GMT"
        }
      ]
    },
    {
      "player_id": 278,
      "player_name": "Kylian Mbappé Lottin",
      "trending_score": 72.0,
      "trend_summary": "Kylian Mbappé made history by scoring for Real Madrid in a 5-1 win over Red Bull Salzburg, surpassing Thierry Henry as the French club's all-time top scorer in the UEFA Champions League. Despite speculation about a potential move to Real Madrid, Mbappé has denied claims of jealousy towards Lionel Messi and remains a key player for Paris Saint-Germain.",
      "news": [
        {
          "title": "The 'street football mentality' that helps Paris produce stars like Mbappe and Henry",
          "description": "The 'street football mentality' that helps Paris produce stars like Mbappe and Henry  Eurosport COM",
          "date": "Thu, 23 Jan 2025 10:40:00 GMT"
        },
        {
          "title": "PSG superstar Achraf Hakimi comments on Kylian Mbappe scoring for Real Madrid in 5-1 win vs Red Bull Salzburg",
          "description": "PSG superstar Achraf Hakimi comments on Kylian Mbappe scoring for Real Madrid in 5-1 win vs Red Bull Salzburg  Sportskeeda",
          "date": "Thu, 23 Jan 2025 05:57:00 GMT"
        },
        {
          "title": "Kylian Mbappe Net Worth In 2025: What Makes Him One of the Richest Athletes?",
          "description": "Kylian Mbappe Net Worth In 2025: What Makes Him One of the Richest Athletes?  Tycoonstory Media",
          "date": "Thu, 23 Jan 2025 03:51:38 GMT"
        },
        {
          "title": "WATCH: Goalkeeper mistake allows Kylian Mbappe to score Real Madrid’s third",
          "description": "WATCH: Goalkeeper mistake allows Kylian Mbappe to score Real Madrid’s third  Football Espana",
          "date": "Wed, 22 Jan 2025 21:11:48 GMT"
        },
        {
          "title": "Deschamps Addresses Ex-PSG Star Kylian Mbappé’s Injury Omission Despite Starting for Real Madrid",
          "description": "Deschamps Addresses Ex-PSG Star Kylian Mbappé’s Injury Omission Despite Starting for Real Madrid  OneFootball",
          "date": "Wed, 22 Jan 2025 17:59:05 GMT"
        },
        {
          "title": "Jude Bellingham equals Lionel Messi in stunning feat but is outdone by Kylian Mbappe and Erling Haaland...",
          "description": "Jude Bellingham equals Lionel Messi in stunning feat but is outdone by Kylian Mbappe and Erling Haaland...  talkSPORT",
          "date": "Wed, 22 Jan 2025 21:46:00 GMT"
        },
        {
          "title": "Real Madrid vs RB Salzburg 5-1: UEFA Champions League – as it happened",
          "description": "Real Madrid vs RB Salzburg 5-1: UEFA Champions League – as it happened  Al Jazeera English",
          "date": "Thu, 23 Jan 2025 00:00:00 GMT"
        },
        {
          "title": "Kylian Mbappe hits back at Neymar’s claim of being 'jealous' with Lionel Messi",
          "description": "Kylian Mbappe hits back at Neymar’s claim of being 'jealous' with Lionel Messi  Firstpost",
          "date": "Wed, 22 Jan 2025 16:22:36 GMT"
        },
        {
          "title": "Transfer Centre LIVE! Football transfers, news, updates and rumours",
          "description": "Transfer Centre LIVE! Football transfers, news, updates and rumours  Sky Sports",
          "date": "Wed, 22 Jan 2025 17:53:07 GMT"
        },
        {
          "title": "Kylian Mbappe Overtakes Thierry Henry With Historic Champions League Goal vs. RB Salzburg",
          "description": "Kylian Mbappe Overtakes Thierry Henry With Historic Champions League Goal vs. RB Salzburg  FootBoom",
          "date": "Wed, 22 Jan 2025 23:05:20 GMT"
        }
      ]
    }
  ]
}