{
  "updated_at": "2025-02-13T12:27:14.520692+00:00",
  "player_news": [
    {
      "player_id": 306,
      "player_name": "Mohamed Salah Hamed Mahrous Ghaly",
      "trending_score": 100.0,
      "trend_summary": "Liverpool's Mohamed Salah continues to etch his name into Premier League history, breaking a 30-year-old record in the Merseyside derby against Everton. Despite Liverpool's draw, Salah's goal and assist extended his remarkable scoring streak, solidifying his status as the league's most prolific winger. Amidst speculation about a potential move to Saudi Arabian club Al Hilal, Salah remains a key figure for Liverpool and a source of pride for his Muslim faith and Algerian heritage.",
      "news": [
        {
          "title": "Mo Salah: Outrageous stats of Liverpool legend prove he is Premier League's greatest winger",
          "description": "Mo Salah: Outrageous stats of Liverpool legend prove he is Premier League's greatest winger  Football365",
          "date": "Thu, 13 Feb 2025 10:12:03 GMT"
        },
        {
          "title": "Mohamed Salah Broke Another Huge Premier League Record in Liverpool’s Draw with Everton",
          "description": "Mohamed Salah Broke Another Huge Premier League Record in Liverpool’s Draw with Everton  OneFootball",
          "date": "Thu, 13 Feb 2025 11:59:35 GMT"
        },
        {
          "title": "Liverpool all-time top scorers: Where does Mohamed Salah rank among Reds players with most goals?",
          "description": "Liverpool all-time top scorers: Where does Mohamed Salah rank among Reds players with most goals?  Sporting News",
          "date": "Wed, 12 Feb 2025 21:18:00 GMT"
        },
        {
          "title": "Liverpool ace Mohamed Salah breaks 30-year-long Premier League record after registering goal and assist in Merseyside derby draw vs Everton",
          "description": "Liverpool ace Mohamed Salah breaks 30-year-long Premier League record after registering goal and assist in Merseyside derby draw vs Everton  Sportskeeda",
          "date": "Thu, 13 Feb 2025 09:16:00 GMT"
        },
        {
          "title": "Al Hilal go public in pursuit of Liverpool’s Mohamed Salah",
          "description": "Al Hilal go public in pursuit of Liverpool’s Mohamed Salah  The Football Faithful",
          "date": "Thu, 13 Feb 2025 11:59:09 GMT"
        },
        {
          "title": "Rayan Ait-Nouri on importance of Muslim faith, pride in playing for Algeria and trying to stop Mohamed Salah",
          "description": "Rayan Ait-Nouri on importance of Muslim faith, pride in playing for Algeria and trying to stop Mohamed Salah  The National",
          "date": "Thu, 13 Feb 2025 05:26:26 GMT"
        },
        {
          "title": "Mohamed Salah breaks stunning Premier League record during Liverpool’s clash at Everton...",
          "description": "Mohamed Salah breaks stunning Premier League record during Liverpool’s clash at Everton...  talkSPORT",
          "date": "Wed, 12 Feb 2025 20:03:28 GMT"
        },
        {
          "title": "Sir Jim Ratcliffe believes job cuts will stop Manchester United from going bust",
          "description": "Sir Jim Ratcliffe believes job cuts will stop Manchester United from going bust",
          "date": "Thu, 13 Feb 2025 10:49:11 GMT"
        },
        {
          "title": "Jamie Carragher's Everton TV nightmare, Mohamed Salah message and Liverpool forgotten reality",
          "description": "Jamie Carragher's Everton TV nightmare, Mohamed Salah message and Liverpool forgotten reality  Liverpool Echo",
          "date": "Thu, 13 Feb 2025 11:56:00 GMT"
        },
        {
          "title": "Everton score stoppage-time equaliser against Liverpool",
          "description": "Everton score stoppage-time equaliser against Liverpool  Loop News Cayman",
          "date": "Wed, 12 Feb 2025 22:10:40 GMT"
        }
      ]
    },
    {
      "player_id": 19617,
      "player_name": "Michael Akpovie Olise",
      "trending_score": 88.0,
      "trend_summary": "In a stunning Champions League clash, Bayern Munich's Michael Olise ignited the scoring against Celtic, showcasing his brilliance with a remarkable goal. The victory marked a significant milestone for Olise, surpassing the legendary Franck Ribéry's record at the German giants.",
      "news": [
        {
          "title": "'Best player' Olise 'could be as good as anyone' – Hargreaves",
          "description": "'Best player' Olise 'could be as good as anyone' – Hargreaves  Eurosport COM",
          "date": "Thu, 13 Feb 2025 08:28:00 GMT"
        },
        {
          "title": "Bayern Munich: Michael Olise Surpasses Franck Ribéry",
          "description": "Bayern Munich: Michael Olise Surpasses Franck Ribéry  MSN",
          "date": "Thu, 13 Feb 2025 08:40:44 GMT"
        },
        {
          "title": "Daily Schmankerl: Manchester City, Liverpool talking to Bayern Munich’s Joshua Kimmich; Harry Kane, Michael Olise, Kimmich recognized for efforts; Manchester United chasing Leroy Sané?; and MORE!",
          "description": "Daily Schmankerl: Manchester City, Liverpool talking to Bayern Munich’s Joshua Kimmich; Harry Kane, Michael Olise, Kimmich recognized for efforts; Manchester United chasing Leroy Sané?; and MORE!  Bavarian Football Works",
          "date": "Thu, 13 Feb 2025 07:33:48 GMT"
        },
        {
          "title": "Kane lifts Bayern to beat Celtic in Champions League playoffs. Milan, Atalanta and Monaco all lose",
          "description": "Kane lifts Bayern to beat Celtic in Champions League playoffs. Milan, Atalanta and Monaco all lose  WTNH.com",
          "date": "Wed, 12 Feb 2025 23:19:09 GMT"
        },
        {
          "title": "Champions League: Bayern Munich's Michael Olise opens the scoring against Celtic",
          "description": "Champions League: Bayern Munich's Michael Olise opens the scoring against Celtic  BBC.com",
          "date": "Wed, 12 Feb 2025 22:00:03 GMT"
        },
        {
          "title": "Bayern 2-1 Celtic (Feb 12, 2025) Game Analysis",
          "description": "Bayern 2-1 Celtic (Feb 12, 2025) Game Analysis  ESPN",
          "date": "Wed, 12 Feb 2025 22:01:58 GMT"
        },
        {
          "title": "Champions League Awards: Olise’s Golazo, Vini has last laugh",
          "description": "Champions League Awards: Olise’s Golazo, Vini has last laugh  The Football Faithful",
          "date": "Thu, 13 Feb 2025 09:06:26 GMT"
        },
        {
          "title": "Celtic 1-2 Bayern Munich: Visitors survive late fightback after Michael Olise and Harry Kane strikes",
          "description": "Celtic 1-2 Bayern Munich: Visitors survive late fightback after Michael Olise and Harry Kane strikes  Eurosport COM",
          "date": "Thu, 13 Feb 2025 01:18:45 GMT"
        },
        {
          "title": "Celtic vs Bayern Munich LIVE: Champions League result and final score",
          "description": "Celtic vs Bayern Munich LIVE: Champions League result and final score  The Independent",
          "date": "Thu, 13 Feb 2025 01:27:00 GMT"
        },
        {
          "title": "Champions League: Bayern Munich's Michael Olise opens the scoring against Celtic",
          "description": "Champions League: Bayern Munich's Michael Olise opens the scoring against Celtic  BBC",
          "date": "Wed, 12 Feb 2025 22:00:03 GMT"
        }
      ]
    },
    {
      "player_id": 2936,
      "player_name": "James Alan Tarkowski",
      "trending_score": 85.0,
      "trend_summary": "James Tarkowski's dramatic late equalizer against Liverpool in the Merseyside derby earned Everton a vital point, slowing the Reds' Premier League title charge. The defender's stunning goal sparked chaos at Goodison Park, with Tarkowski describing the scenes as \"special\" and admitting that he had never experienced anything like it in his career.",
      "news": [
        {
          "title": "'I'm just proud of my team'",
          "description": "'I'm just proud of my team'",
          "date": "Wed, 12 Feb 2025 22:13:19 GMT"
        },
        {
          "title": "How Tarkowski's late equaliser caused full-time chaos as Everton and Liverpool played out brilliant draw",
          "description": "How Tarkowski's late equaliser caused full-time chaos as Everton and Liverpool played out brilliant draw  The Athletic",
          "date": "Wed, 12 Feb 2025 20:41:36 GMT"
        },
        {
          "title": "Everton hero James Tarkowski surprises himself with last-gasp screamer",
          "description": "Everton hero James Tarkowski surprises himself with last-gasp screamer",
          "date": "Wed, 12 Feb 2025 23:34:00 GMT"
        },
        {
          "title": "Everton vs Liverpool: James Tarkowski scores dramatic last-gasp equaliser",
          "description": "Everton vs Liverpool: James Tarkowski scores dramatic last-gasp equaliser  Sky Sports",
          "date": "Thu, 13 Feb 2025 00:06:53 GMT"
        },
        {
          "title": "Everton slow Liverpool’s Premier League charge with injury-time leveller",
          "description": "Everton slow Liverpool’s Premier League charge with injury-time leveller  Al Jazeera English",
          "date": "Wed, 12 Feb 2025 22:51:34 GMT"
        },
        {
          "title": "Premier League releases VAR statement on Everton’s equaliser against Liverpool",
          "description": "Premier League releases VAR statement on Everton’s equaliser against Liverpool  The Independent",
          "date": "Thu, 13 Feb 2025 08:20:00 GMT"
        },
        {
          "title": "Everton 2-2 Liverpool: Player Ratings From Everton's Dramatic Stoppage Time Equalizer in the Merseyside Derby",
          "description": "Everton 2-2 Liverpool: Player Ratings From Everton's Dramatic Stoppage Time Equalizer in the Merseyside Derby  Sports Illustrated",
          "date": "Wed, 12 Feb 2025 22:09:34 GMT"
        },
        {
          "title": "EPL on Citi: James Tarkowski scores stunning goal late to deny Liverpool derby win",
          "description": "EPL on Citi: James Tarkowski scores stunning goal late to deny Liverpool derby win  Citi Sports Online",
          "date": "Wed, 12 Feb 2025 22:19:46 GMT"
        },
        {
          "title": "'I had an 80-year-old grabbing me'",
          "description": "'I had an 80-year-old grabbing me'",
          "date": "Thu, 13 Feb 2025 09:00:00 GMT"
        },
        {
          "title": "Everton 2-2 Liverpool: 'What an amazing night'",
          "description": "Everton 2-2 Liverpool: 'What an amazing night'",
          "date": "Wed, 12 Feb 2025 22:02:38 GMT"
        }
      ]
    },
    {
      "player_id": 894,
      "player_name": "Ashley Simon Young",
      "trending_score": 63.0,
      "trend_summary": "Ashley Young's Everton debut was a fiery one, as the Merseyside derby against Liverpool erupted into a brawl that resulted in four red cards. Despite the chaos, Young played a crucial role in Everton's 1-1 draw, assisting James Tarkowski's late equalizer that earned the Toffees a point in the emotional finale at Goodison Park.",
      "news": [
        {
          "title": "No big surprises for Everton on crucial night for Beto",
          "description": "No big surprises for Everton on crucial night for Beto  The Athletic",
          "date": "Wed, 12 Feb 2025 18:47:42 GMT"
        },
        {
          "title": "Soccer-Late Tarkowski goal earns Everton draw in emotional derby finale",
          "description": "Soccer-Late Tarkowski goal earns Everton draw in emotional derby finale  MSN",
          "date": "Thu, 13 Feb 2025 04:52:20 GMT"
        },
        {
          "title": "Liverpool and Everton Merseyside Derby Brawl Leads to Four Red Cards",
          "description": "Liverpool and Everton Merseyside Derby Brawl Leads to Four Red Cards  Sports Illustrated",
          "date": "Wed, 12 Feb 2025 22:10:12 GMT"
        },
        {
          "title": "The other punishment likely coming Liverpool's way after Arne Slot and Curtis Jones red cards",
          "description": "The other punishment likely coming Liverpool's way after Arne Slot and Curtis Jones red cards  TBR Football",
          "date": "Thu, 13 Feb 2025 11:00:00 GMT"
        },
        {
          "title": "Abdoulaye Doucoure breaks silence as Liverpool and Everton await FA charge",
          "description": "Abdoulaye Doucoure breaks silence as Liverpool and Everton await FA charge  LiverpoolWorld",
          "date": "Thu, 13 Feb 2025 07:18:00 GMT"
        },
        {
          "title": "Everton’s logic-defying derby leveller reminds us football cannot be tamed",
          "description": "Everton’s logic-defying derby leveller reminds us football cannot be tamed  Inkl",
          "date": "Wed, 12 Feb 2025 23:47:25 GMT"
        },
        {
          "title": "Confirmed Everton XI For Last-Ever Goodison Derby",
          "description": "Confirmed Everton XI For Last-Ever Goodison Derby  evertonfc.com",
          "date": "Wed, 12 Feb 2025 21:02:21 GMT"
        },
        {
          "title": "Soccer-Late Tarkowski goal earns Everton draw in emotional derby finale",
          "description": "Soccer-Late Tarkowski goal earns Everton draw in emotional derby finale  MSN",
          "date": "Thu, 13 Feb 2025 00:12:42 GMT"
        },
        {
          "title": "Football: Soccer-Late Tarkowski goal earns Everton draw in emotional derby finale",
          "description": "Football: Soccer-Late Tarkowski goal earns Everton draw in emotional derby finale  The Star Online",
          "date": "Wed, 12 Feb 2025 21:55:00 GMT"
        },
        {
          "title": "Premier League release statements after James Tarkowski goal and Everton vs Liverpool red card chaos",
          "description": "Premier League release statements after James Tarkowski goal and Everton vs Liverpool red card chaos  Liverpool Echo",
          "date": "Wed, 12 Feb 2025 22:05:00 GMT"
        }
      ]
    },
    {
      "player_id": 522,
      "player_name": "Thomas Müller",
      "trending_score": 55.0,
      "trend_summary": "Ahead of Bayern Munich's Champions League clash with Celtic, Thomas Müller has warned his teammates not to underestimate the Scottish side, stating that \"anyone who underestimates the Scots has never experienced them at Celtic Park.\" Müller is eyeing Champions League history as Bayern face Celtic, aiming to become the first player to score in eight consecutive Champions League away matches.",
      "news": [
        {
          "title": "'Anyone who underestimates the Scots has never experienced them at Celtic Park,' Thomas Muller",
          "description": "'Anyone who underestimates the Scots has never experienced them at Celtic Park,' Thomas Muller  Yardbarker",
          "date": "Wed, 12 Feb 2025 17:25:38 GMT"
        },
        {
          "title": "Thomas Muller Eyes Champions League History as Bayern Munich Face Celtic",
          "description": "Thomas Muller Eyes Champions League History as Bayern Munich Face Celtic  MSN",
          "date": "Wed, 12 Feb 2025 14:37:23 GMT"
        },
        {
          "title": "“Anyone who underestimates the Scots has never experienced them at Celtic Park,” Thomas Muller",
          "description": "“Anyone who underestimates the Scots has never experienced them at Celtic Park,” Thomas Muller  The Celtic Star",
          "date": "Wed, 12 Feb 2025 17:08:52 GMT"
        }
      ]
    }
  ]
}