{
  "updated_at": "2025-01-22T00:11:21.328212+00:00",
  "player_news": [
    {
      "player_id": 1496,
      "player_name": "Raphael Dias Belloli",
      "trending_score": 100.0,
      "trend_summary": "In a thrilling Champions League clash, Raphinha emerged as Barcelona's hero, scoring a controversial last-gasp winner to secure a dramatic 5-4 comeback victory over Benfica. The Brazilian forward's late heroics have propelled him to the top of the Champions League scoring charts, solidifying his status as one of the most in-form players in Europe.",
      "news": [
        {
          "title": "FC Barcelona’s Benfica Comeback Hero Raphinha: ‘I’ll Kill And Die For This Team’",
          "description": "FC Barcelona’s Benfica Comeback Hero Raphinha: ‘I’ll Kill And Die For This Team’  Forbes",
          "date": "Tue, 21 Jan 2025 22:47:12 GMT"
        },
        {
          "title": "Controversial Raphinha winner seals nine-goal thriller for Barca at Benfica",
          "description": "Controversial Raphinha winner seals nine-goal thriller for Barca at Benfica  Al Jazeera English",
          "date": "Tue, 21 Jan 2025 23:08:37 GMT"
        },
        {
          "title": "Barcelona 5-4 Benfica (Jan 21, 2025) Game Analysis",
          "description": "Barcelona 5-4 Benfica (Jan 21, 2025) Game Analysis  ESPN",
          "date": "Tue, 21 Jan 2025 23:48:45 GMT"
        },
        {
          "title": "HISTORICAL COMEBACK: Raphinha becomes a hero and rescues Barça against Benfica (4-5)",
          "description": "HISTORICAL COMEBACK: Raphinha becomes a hero and rescues Barça against Benfica (4-5)  FC Barcelona Noticias",
          "date": "Tue, 21 Jan 2025 22:25:00 GMT"
        },
        {
          "title": "Photo: Hansi Flick’s reaction to Raphinha’s last-gasp Barcelona winner vs Benfica",
          "description": "Photo: Hansi Flick’s reaction to Raphinha’s last-gasp Barcelona winner vs Benfica  Yahoo Canada Sports",
          "date": "Tue, 21 Jan 2025 22:36:00 GMT"
        },
        {
          "title": "Raphinha caps late Barcelona comeback to settle nine-goal thriller with Benfica",
          "description": "Raphinha caps late Barcelona comeback to settle nine-goal thriller with Benfica  The Guardian",
          "date": "Tue, 21 Jan 2025 23:44:00 GMT"
        },
        {
          "title": "Barcelona Score 'Weirdest Goal... Ever Seen Scored in the Champions League'",
          "description": "Barcelona Score 'Weirdest Goal... Ever Seen Scored in the Champions League'  Sports Illustrated",
          "date": "Tue, 21 Jan 2025 22:12:50 GMT"
        },
        {
          "title": "Raphinha explains exactly what happened as tempers flare after Benfica vs Barcelona",
          "description": "Raphinha explains exactly what happened as tempers flare after Benfica vs Barcelona  SPORTbible",
          "date": "Tue, 21 Jan 2025 22:48:49 GMT"
        },
        {
          "title": "Raphinha in form of his life as Barcelona win nine-goal thriller",
          "description": "Raphinha in form of his life as Barcelona win nine-goal thriller  FotMob",
          "date": "Tue, 21 Jan 2025 23:34:13 GMT"
        },
        {
          "title": "Champions League top scorers: Robert Lewandowski leads Raphinha and Serhou Guirassy",
          "description": "Champions League top scorers: Robert Lewandowski leads Raphinha and Serhou Guirassy  UEFA.com",
          "date": "Tue, 21 Jan 2025 22:39:46 GMT"
        }
      ]
    },
    {
      "player_id": 21090,
      "player_name": "Diego Carlos Santos Silva",
      "trending_score": 43.0,
      "trend_summary": "Aston Villa defender Diego Carlos is set to join Fenerbahce after the clubs agreed on a transfer deal, with the Brazilian center-back leaving Villa Park after just one season. The move comes amid speculation that Wolves had also made a bid for Carlos, but Fenerbahce has secured the player's signature.",
      "news": [
        {
          "title": "Aston Villa reach verbal agreement with Fenerbahce for Diego Carlos transfer",
          "description": "Aston Villa reach verbal agreement with Fenerbahce for Diego Carlos transfer  The Athletic",
          "date": "Tue, 21 Jan 2025 19:35:02 GMT"
        },
        {
          "title": "Diego Carlos transfer crisis: Last-minute shock for Fenerbahce",
          "description": "Diego Carlos transfer crisis: Last-minute shock for Fenerbahce  Türkiye Today",
          "date": "Tue, 21 Jan 2025 11:08:21 GMT"
        },
        {
          "title": "OFFICIAL: Diego Carlos leaves Villa to join Mourinho's Fenerbahce",
          "description": "OFFICIAL: Diego Carlos leaves Villa to join Mourinho's Fenerbahce  BeSoccer EN",
          "date": "Tue, 21 Jan 2025 19:17:10 GMT"
        },
        {
          "title": "Diego Carlos: Fenerbahce agree deal with Aston Villa for Brazilian centre-back",
          "description": "Diego Carlos: Fenerbahce agree deal with Aston Villa for Brazilian centre-back  BBC",
          "date": "Tue, 21 Jan 2025 21:13:11 GMT"
        },
        {
          "title": "Sources confirm Wolves transfer work behind the scenes as truth of Diego Carlos bid revealed",
          "description": "Sources confirm Wolves transfer work behind the scenes as truth of Diego Carlos bid revealed  Molineux News",
          "date": "Tue, 21 Jan 2025 12:30:00 GMT"
        },
        {
          "title": "Aston Villa defender Diego Carlos set for Fenerbahce move after clubs agree deal",
          "description": "Aston Villa defender Diego Carlos set for Fenerbahce move after clubs agree deal  Irish Independent",
          "date": "Tue, 21 Jan 2025 21:42:21 GMT"
        },
        {
          "title": "Aston Villa predicted XI v Monaco: Donyell Malen ineligible, Diego Carlos suspended",
          "description": "Aston Villa predicted XI v Monaco: Donyell Malen ineligible, Diego Carlos suspended  Get French Football News",
          "date": "Tue, 21 Jan 2025 08:42:14 GMT"
        },
        {
          "title": "Major Diego Carlos Aston Villa transfer update given as Fenerbahce release statement",
          "description": "Major Diego Carlos Aston Villa transfer update given as Fenerbahce release statement  Birmingham Live",
          "date": "Tue, 21 Jan 2025 20:12:00 GMT"
        },
        {
          "title": "Aston Villa transfer news: Diego Carlos deal get Fabrizio Romano ‘here we go’ as Emery CONFIRMS replacement",
          "description": "Aston Villa transfer news: Diego Carlos deal get Fabrizio Romano ‘here we go’ as Emery CONFIRMS replacement  MSN",
          "date": "Tue, 21 Jan 2025 04:41:10 GMT"
        },
        {
          "title": "Man City's Jack Grealish wanted by Inter Milan, Borussia Dortmund with future uncertain",
          "description": "Man City's Jack Grealish wanted by Inter Milan, Borussia Dortmund with future uncertain",
          "date": "Tue, 21 Jan 2025 23:49:44 GMT"
        }
      ]
    },
    {
      "player_id": 851,
      "player_name": "Wojciech Tomasz Szczęsny",
      "trending_score": 42.0,
      "trend_summary": "In a thrilling Champions League clash, Barcelona's Wojciech Szczęsny made costly errors that gifted Benfica a 3-1 halftime lead, but the Polish goalkeeper was spared further embarrassment as Barcelona rallied to a 5-4 victory. Despite his mistakes, Szczęsny's performance was overshadowed by Barcelona's late winner, which secured a dramatic victory in a match filled with penalties, a hat-trick, and an own goal.",
      "news": [
        {
          "title": "Benfica 4 Barcelona 5: Late winner, Szczesny errors, penalties, a hat-trick and an own goal in thriller",
          "description": "Benfica 4 Barcelona 5: Late winner, Szczesny errors, penalties, a hat-trick and an own goal in thriller",
          "date": "Tue, 21 Jan 2025 22:52:39 GMT"
        },
        {
          "title": "Watch the moment Wojciech Szczesny clatters into his own TEAM-MATE",
          "description": "Watch the moment Wojciech Szczesny clatters into his own TEAM-MATE",
          "date": "Tue, 21 Jan 2025 21:46:46 GMT"
        },
        {
          "title": "Szczesny's costly mistakes give Benfica a 3-1 halftime lead over Barcelona: Funniest memes and reactions",
          "description": "Szczesny's costly mistakes give Benfica a 3-1 halftime lead over Barcelona: Funniest memes and reactions  Bolavip US",
          "date": "Tue, 21 Jan 2025 21:07:27 GMT"
        },
        {
          "title": "Another robbery for Barça? The controversial penalty of Szczesny against Benfica",
          "description": "Another robbery for Barça? The controversial penalty of Szczesny against Benfica  FC Barcelona Noticias",
          "date": "Tue, 21 Jan 2025 21:32:00 GMT"
        },
        {
          "title": "\"Perfect choice for big games like this\"",
          "description": "\"Perfect choice for big games like this\"",
          "date": "Tue, 21 Jan 2025 19:55:00 GMT"
        },
        {
          "title": "WATCH: Wojciech Szczesny howler allows Benfica to re-take lead against Barcelona",
          "description": "WATCH: Wojciech Szczesny howler allows Benfica to re-take lead against Barcelona  Football Espana",
          "date": "Tue, 21 Jan 2025 20:27:51 GMT"
        },
        {
          "title": "Barcelona concede one of the worst goals of the season against Benfica and fans can't believe what happened",
          "description": "Barcelona concede one of the worst goals of the season against Benfica and fans can't believe what happened  SPORTbible",
          "date": "Tue, 21 Jan 2025 20:49:00 GMT"
        },
        {
          "title": "Barcelona player ratings vs Benfica: Raphinha, you GENIUS! Barca edge nine-goal Champions League classic in last minute to spare Wojciech Szczesny's blushes",
          "description": "Barcelona player ratings vs Benfica: Raphinha, you GENIUS! Barca edge nine-goal Champions League classic in last minute to spare Wojciech Szczesny's blushes  Goal.com",
          "date": "Tue, 21 Jan 2025 22:19:38 GMT"
        },
        {
          "title": "UEFA Champions League 2025 highlights",
          "description": "UEFA Champions League 2025 highlights",
          "date": "Tue, 21 Jan 2025 21:20:31 GMT"
        },
        {
          "title": "Benfica",
          "description": "Benfica",
          "date": "Tue, 21 Jan 2025 18:52:00 GMT"
        }
      ]
    },
    {
      "player_id": 521,
      "player_name": "Robert Lewandowski",
      "trending_score": 38.0,
      "trend_summary": "Robert Lewandowski has equaled Cristiano Ronaldo's Champions League record of scoring in 19 consecutive matches, helping Barcelona secure a 3-3 draw against Benfica. Amidst rumors of a potential €100 million offer from Manchester City, Barcelona is reportedly considering Juventus forward Dusan Vlahovic as a possible replacement for Lewandowski, whose recent performance in a 1-1 draw against Getafe has drawn criticism from fans.",
      "news": [
        {
          "title": "Champions League top scorers: Robert Lewandowski leads Raphinha and Serhou Guirassy",
          "description": "Champions League top scorers: Robert Lewandowski leads Raphinha and Serhou Guirassy  UEFA.com",
          "date": "Tue, 21 Jan 2025 22:39:46 GMT"
        },
        {
          "title": "Lewandowski matches Champions League record set by Cristiano Ronaldo to stay above Lionel Messi",
          "description": "Lewandowski matches Champions League record set by Cristiano Ronaldo to stay above Lionel Messi  Bolavip US",
          "date": "Tue, 21 Jan 2025 22:29:30 GMT"
        },
        {
          "title": "Robert Lewandowski Ties Cristiano Ronaldo's Champions League Record in Barcelona vs. Benfica Match",
          "description": "Robert Lewandowski Ties Cristiano Ronaldo's Champions League Record in Barcelona vs. Benfica Match  beIN SPORTS",
          "date": "Tue, 21 Jan 2025 21:55:42 GMT"
        },
        {
          "title": "This is the ranking of top scorers in the Champions League 2024-25 after matchday 7",
          "description": "This is the ranking of top scorers in the Champions League 2024-25 after matchday 7  FC Barcelona Noticias",
          "date": "Tue, 21 Jan 2025 23:20:00 GMT"
        },
        {
          "title": "WATCH: Robert Lewandowski scores second penalty as Barcelona cut deficit to 4-3",
          "description": "WATCH: Robert Lewandowski scores second penalty as Barcelona cut deficit to 4-3  Football Espana",
          "date": "Tue, 21 Jan 2025 21:40:26 GMT"
        },
        {
          "title": "European Golden Shoe 2024-25: Robert Lewandowski, Erling Haaland & the top scorers in Europe",
          "description": "European Golden Shoe 2024-25: Robert Lewandowski, Erling Haaland & the top scorers in Europe  Goal.com",
          "date": "Tue, 21 Jan 2025 14:23:44 GMT"
        },
        {
          "title": "WATCH: Barcelona back on level terms as Robert Lewandowski scores from the penalty spot",
          "description": "WATCH: Barcelona back on level terms as Robert Lewandowski scores from the penalty spot  Football Espana",
          "date": "Tue, 21 Jan 2025 20:16:07 GMT"
        },
        {
          "title": "\"We will never win LaLiga again\", \"He’s holding this team back\"",
          "description": "\"We will never win LaLiga again\", \"He’s holding this team back\"",
          "date": "Tue, 21 Jan 2025 05:19:00 GMT"
        },
        {
          "title": "Barcelona on alert as Man City readying €100m offer for ace that Arsenal covet",
          "description": "Barcelona on alert as Man City readying €100m offer for ace that Arsenal covet  CaughtOffside",
          "date": "Tue, 21 Jan 2025 07:15:18 GMT"
        },
        {
          "title": "Barcelona add Juventus forward to Robert Lewandowski replacement shortlist",
          "description": "Barcelona add Juventus forward to Robert Lewandowski replacement shortlist  Football Espana",
          "date": "Tue, 21 Jan 2025 10:54:56 GMT"
        }
      ]
    },
    {
      "player_id": 306,
      "player_name": "Mohamed Salah Hamed Mahrous Ghaly",
      "trending_score": 35.0,
      "trend_summary": "Mohamed Salah has reached a historic milestone, scoring his 50th European goal for Liverpool in their Champions League victory over Lille. Despite rumors of a potential departure to Saudi Arabia, Salah remains a key figure for the Reds, inspiring them to a record-equaling win in Europe's premier club competition.",
      "news": [
        {
          "title": "'Elite mindset'",
          "description": "'Elite mindset'",
          "date": "Tue, 21 Jan 2025 23:30:08 GMT"
        },
        {
          "title": "Former Liverpool Star: £39.5m Real Madrid Star Could be Mohamed Salah Replacement",
          "description": "Former Liverpool Star: £39.5m Real Madrid Star Could be Mohamed Salah Replacement  OneFootball",
          "date": "Tue, 21 Jan 2025 20:32:41 GMT"
        },
        {
          "title": "Curtis Jones copies Mohamed Salah celebration following Liverpool star's goal against Lille",
          "description": "Curtis Jones copies Mohamed Salah celebration following Liverpool star's goal against Lille",
          "date": "Tue, 21 Jan 2025 22:02:10 GMT"
        },
        {
          "title": "Alan Shearer fires Liverpool warning over Mohamed Salah contract",
          "description": "Alan Shearer fires Liverpool warning over Mohamed Salah contract",
          "date": "Tue, 21 Jan 2025 22:41:00 GMT"
        },
        {
          "title": "Liverpool 2-1 Lille: Brilliant Mohamed Salah keeps Reds top of the Champions League",
          "description": "Liverpool 2-1 Lille: Brilliant Mohamed Salah keeps Reds top of the Champions League  VAVEL.com",
          "date": "Tue, 21 Jan 2025 21:59:26 GMT"
        },
        {
          "title": "'Proud' Salah nets 50th for Liverpool in Europe",
          "description": "'Proud' Salah nets 50th for Liverpool in Europe  ESPN Australia",
          "date": "Wed, 22 Jan 2025 00:02:40 GMT"
        },
        {
          "title": "Mohamed Salah inspires Liverpool to record-equalling victory over Lille in Champions League",
          "description": "Mohamed Salah inspires Liverpool to record-equalling victory over Lille in Champions League  GB News",
          "date": "Tue, 21 Jan 2025 22:15:48 GMT"
        },
        {
          "title": "Mohamed Salah eyes historic record as Liverpool face Lille in Champions League",
          "description": "Mohamed Salah eyes historic record as Liverpool face Lille in Champions League  Sporting News",
          "date": "Tue, 21 Jan 2025 07:58:23 GMT"
        },
        {
          "title": "Gabby Logan slip-up as new BBC MOTD host calls Mohamed Salah by Mo Farah's name",
          "description": "Gabby Logan slip-up as new BBC MOTD host calls Mohamed Salah by Mo Farah's name  Express",
          "date": "Tue, 21 Jan 2025 21:15:00 GMT"
        },
        {
          "title": "Salah leaving Liverpool? 'Serious interest' from Saudi Arabia 'confirmed' with club 'ready to act'",
          "description": "Salah leaving Liverpool? 'Serious interest' from Saudi Arabia 'confirmed' with club 'ready to act'  Football365",
          "date": "Tue, 21 Jan 2025 17:33:33 GMT"
        }
      ]
    }
  ]
}