{
  "updated_at": "2025-01-22T23:54:04.225274+00:00",
  "player_news": [
    {
      "player_id": 198,
      "player_name": "Milan Škriniar",
      "trending_score": 100.0,
      "trend_summary": "Paris Saint-Germain defender Milan Škriniar is set to join Turkish Süper Lig club Fenerbahçe on loan, with the deal expected to be finalized soon. The Slovakian international has been linked with a move to Fenerbahçe for several weeks, and it now appears that the transfer is close to completion. Škriniar has been a key player for PSG since joining the club in 2017, but he has fallen down the pecking order this season following the arrival of Sergio",
      "news": [
        {
          "title": "PSG set to send Milan Škriniar on loan to Fenerbahçe",
          "description": "PSG set to send Milan Škriniar on loan to Fenerbahçe  Get French Football News",
          "date": "Wed, 22 Jan 2025 10:54:14 GMT"
        },
        {
          "title": "‘Turkish League is fair!’ Mourinho reveals how he convinced Škriniar to join Fenerbahce",
          "description": "‘Turkish League is fair!’ Mourinho reveals how he convinced Škriniar to join Fenerbahce  Hayters",
          "date": "Wed, 22 Jan 2025 15:49:47 GMT"
        },
        {
          "title": "Milan Škriniar Set To Join Fenerbahçe After PSG Deal",
          "description": "Milan Škriniar Set To Join Fenerbahçe After PSG Deal  Evrim Ağacı",
          "date": "Wed, 22 Jan 2025 11:39:24 GMT"
        },
        {
          "title": "PSG agree to send Skriniar to Fenerbahce: Why it impacts Juventus and Milan",
          "description": "PSG agree to send Skriniar to Fenerbahce: Why it impacts Juventus and Milan  OneFootball",
          "date": "Wed, 22 Jan 2025 11:53:07 GMT"
        },
        {
          "title": "Fenerbahce signs PSG’s Slovakian Skriniar after Galatasaray shows interest",
          "description": "Fenerbahce signs PSG’s Slovakian Skriniar after Galatasaray shows interest  Türkiye Today",
          "date": "Wed, 22 Jan 2025 13:26:21 GMT"
        },
        {
          "title": "Škriniar agrees transfer to Fenerbahçe",
          "description": "Škriniar agrees transfer to Fenerbahçe  DailySports",
          "date": "Wed, 22 Jan 2025 10:48:04 GMT"
        }
      ]
    },
    {
      "player_id": 161904,
      "player_name": "Bradley Barcola",
      "trending_score": 35.0,
      "trend_summary": "Bradley Barcola, the rising star of Paris Saint-Germain, inspired a remarkable Champions League comeback against Manchester City, scoring a crucial equalizer to spark a 4-2 victory that keeps the French giants in contention for the knockout stages. Barcola's performance has drawn widespread praise, with pundits hailing his impact and potential as a future footballing great.",
      "news": [
        {
          "title": "PSG vs Manchester City live result: Barcola inspires hosts to extraordinary Champions League comeback win",
          "description": "PSG vs Manchester City live result: Barcola inspires hosts to extraordinary Champions League comeback win  The New York Times",
          "date": "Wed, 22 Jan 2025 22:21:11 GMT"
        },
        {
          "title": "Video: Man City Bottles Their Lead as Bradley Barcola Levels for PSG",
          "description": "Video: Man City Bottles Their Lead as Bradley Barcola Levels for PSG  OneFootball",
          "date": "Wed, 22 Jan 2025 21:37:44 GMT"
        },
        {
          "title": "PSG vs Manchester City: Dembélé Shines as Barcola Steals the Show",
          "description": "PSG vs Manchester City: Dembélé Shines as Barcola Steals the Show  FootBoom",
          "date": "Wed, 22 Jan 2025 21:50:24 GMT"
        },
        {
          "title": "Manchester City collapse in calamitous defeat at Paris Saint-Germain",
          "description": "Manchester City collapse in calamitous defeat at Paris Saint-Germain  The Guardian",
          "date": "Wed, 22 Jan 2025 23:31:00 GMT"
        },
        {
          "title": "PSG roar back to win crucial Champions League clash with Man City",
          "description": "PSG roar back to win crucial Champions League clash with Man City",
          "date": "Wed, 22 Jan 2025 22:01:00 GMT"
        },
        {
          "title": "Football: PSG’s brilliant comeback stuns City",
          "description": "Football: PSG’s brilliant comeback stuns City  Gulf Digital News",
          "date": "Wed, 22 Jan 2025 22:43:09 GMT"
        },
        {
          "title": "Champions League permutations: What Man City & PSG need to qualify",
          "description": "Champions League permutations: What Man City & PSG need to qualify  BBC.com",
          "date": "Wed, 22 Jan 2025 09:17:50 GMT"
        },
        {
          "title": "PSG v Man City Tips: Joe Cole's 48/1 Bet Builder",
          "description": "PSG v Man City Tips: Joe Cole's 48/1 Bet Builder  Paddy Power News",
          "date": "Wed, 22 Jan 2025 14:55:13 GMT"
        },
        {
          "title": "PSG vs. Man City live score: UEFA Champions League result, updates, stats as European giants face elimination threat",
          "description": "PSG vs. Man City live score: UEFA Champions League result, updates, stats as European giants face elimination threat  Sporting News",
          "date": "Wed, 22 Jan 2025 21:43:00 GMT"
        },
        {
          "title": "Sad separation behind Man City's sharp decline as PSG score stunning 4-2 win",
          "description": "Sad separation behind Man City's sharp decline as PSG score stunning 4-2 win  Nine",
          "date": "Wed, 22 Jan 2025 22:25:08 GMT"
        }
      ]
    },
    {
      "player_id": 10009,
      "player_name": "Rodrygo Silva de Goes",
      "trending_score": 31.0,
      "trend_summary": "Rodrygo Goes demanded respect with a stunning brace in Real Madrid's 5-1 Champions League victory over Salzburg, while Jude Bellingham's brilliant back-heel assist set up one of his goals. The Brazilian forward's performance, alongside Vinicius Junior's brace, has sparked speculation that the duo could be the future of Real Madrid's attacking line.",
      "news": [
        {
          "title": "Real Madrid 5 Salzburg 1 – Rodrygo demands respect, brilliant Bellingham, Vinicius Jr to miss Brest",
          "description": "Real Madrid 5 Salzburg 1 – Rodrygo demands respect, brilliant Bellingham, Vinicius Jr to miss Brest  The Athletic",
          "date": "Wed, 22 Jan 2025 22:02:32 GMT"
        },
        {
          "title": "Rodrygo and Vinícius double up as Real Madrid hit five past hapless Salzburg",
          "description": "Rodrygo and Vinícius double up as Real Madrid hit five past hapless Salzburg  The Guardian",
          "date": "Wed, 22 Jan 2025 22:31:00 GMT"
        },
        {
          "title": "Champions League: Rodrygo scores for Real Madrid",
          "description": "Champions League: Rodrygo scores for Real Madrid  BBC.com",
          "date": "Wed, 22 Jan 2025 22:00:44 GMT"
        },
        {
          "title": "Bellingham's Brilliant Back-Heel Assist Sends Rodrygo Free in Champions League Win",
          "description": "Bellingham's Brilliant Back-Heel Assist Sends Rodrygo Free in Champions League Win  FootBoom",
          "date": "Wed, 22 Jan 2025 22:12:57 GMT"
        },
        {
          "title": "WATCH: Real Madrid double advantage over RB Salzburg courtesy of Rodrygo Goes’ second",
          "description": "WATCH: Real Madrid double advantage over RB Salzburg courtesy of Rodrygo Goes’ second  Football Espana",
          "date": "Wed, 22 Jan 2025 20:39:27 GMT"
        },
        {
          "title": "Vinicius Junior and Rodrygo bag braces as five-star Real Madrid thump sorry Salzburg",
          "description": "Vinicius Junior and Rodrygo bag braces as five-star Real Madrid thump sorry Salzburg  Flashscore.com",
          "date": "Wed, 22 Jan 2025 22:04:42 GMT"
        },
        {
          "title": "Modric, directly going for Mbappé after Rodrygo's second goal",
          "description": "Modric, directly going for Mbappé after Rodrygo's second goal  Real Madrid Confidencial",
          "date": "Wed, 22 Jan 2025 20:45:00 GMT"
        },
        {
          "title": "Real Madrid thrash Salzburg 5-1 with Rodrygo and Vinicius doubles",
          "description": "Real Madrid thrash Salzburg 5-1 with Rodrygo and Vinicius doubles  The Straits Times",
          "date": "Wed, 22 Jan 2025 22:51:00 GMT"
        },
        {
          "title": "Real Madrid vs RB Salzburg Highlights: RMA 5-1 SAL; Vinicius, Rodrygo score brace; Mbappe finds net",
          "description": "Real Madrid vs RB Salzburg Highlights: RMA 5-1 SAL; Vinicius, Rodrygo score brace; Mbappe finds net  Sportstar",
          "date": "Wed, 22 Jan 2025 21:52:26 GMT"
        },
        {
          "title": "Real Madrid thrash Salzburg 5-1 with Rodrygo and Vinicius doubles",
          "description": "Real Madrid thrash Salzburg 5-1 with Rodrygo and Vinicius doubles  CNA",
          "date": "Wed, 22 Jan 2025 22:17:09 GMT"
        }
      ]
    },
    {
      "player_id": 762,
      "player_name": "Vinícius José Paixão de Oliveira Júnior",
      "trending_score": 27.0,
      "trend_summary": "Vinicius Junior reached a remarkable milestone, scoring his 100th goal for Real Madrid in their 5-1 Champions League victory over Salzburg, where he netted a brace alongside fellow Brazilian Rodrygo. Amidst the transfer speculation, news emerged that the Saudi Pro League is reportedly preparing a world-record €350 million offer for Vinicius Junior, potentially tempting the winger away from the Spanish giants.",
      "news": [
        {
          "title": "Vinicius Junior completes 100 goals for Real Madrid: Key stats",
          "description": "Vinicius Junior completes 100 goals for Real Madrid: Key stats  NewsBytes",
          "date": "Wed, 22 Jan 2025 22:50:06 GMT"
        },
        {
          "title": "Revealed: The staggering world-record fee Saudi Pro League is prepared to splurge on Vinicius Jr as potential destination emerges for Real Madrid superstar",
          "description": "Revealed: The staggering world-record fee Saudi Pro League is prepared to splurge on Vinicius Jr as potential destination emerges for Real Madrid superstar  Goal.com",
          "date": "Wed, 22 Jan 2025 18:57:10 GMT"
        },
        {
          "title": "Vinicius Junior Reacts to Scoring His 100th Goal for Real Madrid",
          "description": "Vinicius Junior Reacts to Scoring His 100th Goal for Real Madrid  OneFootball",
          "date": "Wed, 22 Jan 2025 23:35:55 GMT"
        },
        {
          "title": "WATCH: Vinicius Junior gets on the scoresheet as goal number four arrives for Real Madrid",
          "description": "WATCH: Vinicius Junior gets on the scoresheet as goal number four arrives for Real Madrid  Football Espana",
          "date": "Wed, 22 Jan 2025 21:17:59 GMT"
        },
        {
          "title": "Vinicius Junior and Rodrygo bag braces as five-star Real Madrid thump sorry Salzburg",
          "description": "Vinicius Junior and Rodrygo bag braces as five-star Real Madrid thump sorry Salzburg  Flashscore.com",
          "date": "Wed, 22 Jan 2025 22:04:42 GMT"
        },
        {
          "title": "Vinicius Junior: Saudis to decimate world record with €350m offer as insider urges 'watch this space'",
          "description": "Vinicius Junior: Saudis to decimate world record with €350m offer as insider urges 'watch this space'  TEAMtalk",
          "date": "Wed, 22 Jan 2025 22:42:05 GMT"
        },
        {
          "title": "UCL 2024-25: Real Madrid thrashes Salzburg 5-1 to get back on track in Europe",
          "description": "UCL 2024-25: Real Madrid thrashes Salzburg 5-1 to get back on track in Europe  Sportstar",
          "date": "Wed, 22 Jan 2025 21:58:00 GMT"
        },
        {
          "title": "Real Madrid thrash Salzburg 5-1 with Rodrygo and Vinicius doubles",
          "description": "Real Madrid thrash Salzburg 5-1 with Rodrygo and Vinicius doubles  The Straits Times",
          "date": "Wed, 22 Jan 2025 22:51:00 GMT"
        },
        {
          "title": "WATCH: Vinicius Junior doubles up as Real Madrid hit fifth against RB Salzburg",
          "description": "WATCH: Vinicius Junior doubles up as Real Madrid hit fifth against RB Salzburg  Football Espana",
          "date": "Wed, 22 Jan 2025 21:38:24 GMT"
        },
        {
          "title": "Football: Soccer-Real Madrid thrash Salzburg 5-1 with Rodrygo and Vinicius doubles",
          "description": "Football: Soccer-Real Madrid thrash Salzburg 5-1 with Rodrygo and Vinicius doubles  The Star Online",
          "date": "Wed, 22 Jan 2025 22:26:00 GMT"
        }
      ]
    },
    {
      "player_id": 278,
      "player_name": "Kylian Mbappé Lottin",
      "trending_score": 24.0,
      "trend_summary": "Kylian Mbappé's Champions League brilliance continued as he surpassed Thierry Henry's goal tally in the competition with a strike against RB Salzburg. Despite Real Madrid's recent struggles, Mbappé has defended his performance, admitting he \"couldn't do any worse.\" Off the pitch, Mbappé has refuted Neymar's claims of jealousy towards Lionel Messi, highlighting the complex dynamics within the star-studded PSG squad.",
      "news": [
        {
          "title": "WATCH: Goalkeeper mistake allows Kylian Mbappe to score Real Madrid’s third",
          "description": "WATCH: Goalkeeper mistake allows Kylian Mbappe to score Real Madrid’s third  Football Espana",
          "date": "Wed, 22 Jan 2025 21:11:48 GMT"
        },
        {
          "title": "LIVE: Real Madrid cruise by RB Salzburg – UEFA Champions League reaction",
          "description": "LIVE: Real Madrid cruise by RB Salzburg – UEFA Champions League reaction  Al Jazeera English",
          "date": "Wed, 22 Jan 2025 22:30:00 GMT"
        },
        {
          "title": "Deschamps Addresses Ex-PSG Star Kylian Mbappé’s Injury Omission Despite Starting for Real Madrid",
          "description": "Deschamps Addresses Ex-PSG Star Kylian Mbappé’s Injury Omission Despite Starting for Real Madrid  OneFootball",
          "date": "Wed, 22 Jan 2025 17:59:05 GMT"
        },
        {
          "title": "Jude Bellingham equals Lionel Messi in stunning feat but is outdone by Kylian Mbappe and Erling Haaland...",
          "description": "Jude Bellingham equals Lionel Messi in stunning feat but is outdone by Kylian Mbappe and Erling Haaland...  talkSPORT",
          "date": "Wed, 22 Jan 2025 21:46:00 GMT"
        },
        {
          "title": "Kylian Mbappe hits back at Neymar’s claim of being 'jealous' with Lionel Messi",
          "description": "Kylian Mbappe hits back at Neymar’s claim of being 'jealous' with Lionel Messi  Firstpost",
          "date": "Wed, 22 Jan 2025 16:22:36 GMT"
        },
        {
          "title": "\"I think he should give it up\"",
          "description": "\"I think he should give it up\"",
          "date": "Wed, 22 Jan 2025 15:27:00 GMT"
        },
        {
          "title": "Kylian Mbappe explains poor Real Madrid form: 'I couldn't do any worse‘",
          "description": "Kylian Mbappe explains poor Real Madrid form: 'I couldn't do any worse‘  The Independent",
          "date": "Wed, 22 Jan 2025 12:39:00 GMT"
        },
        {
          "title": "Kylian Mbappe fires back at Neymar’s claim of jealousy towards Lionel Messi",
          "description": "Kylian Mbappe fires back at Neymar’s claim of jealousy towards Lionel Messi  The Indian Express",
          "date": "Wed, 22 Jan 2025 06:08:28 GMT"
        },
        {
          "title": "Kylian Mbappe Overtakes Thierry Henry With Historic Champions League Goal vs. RB Salzburg",
          "description": "Kylian Mbappe Overtakes Thierry Henry With Historic Champions League Goal vs. RB Salzburg  FootBoom",
          "date": "Wed, 22 Jan 2025 23:05:20 GMT"
        },
        {
          "title": "Champions League: Kylian Mbappe proving doubters wrong as Real Madrid approach crunch clash",
          "description": "Champions League: Kylian Mbappe proving doubters wrong as Real Madrid approach crunch clash  Flashscore.com",
          "date": "Wed, 22 Jan 2025 14:28:59 GMT"
        }
      ]
    }
  ]
}