{
  "updated_at": "2025-01-26T12:07:19.563393+00:00",
  "player_news": [
    {
      "player_id": 360114,
      "player_name": "Abduqodir Khusanov",
      "trending_score": 100.0,
      "trend_summary": "Abdukodir Khusanov's debut for Manchester City against Chelsea was a nightmare, with his costly errors contributing to the team's early deficit. Despite his poor performance, Khusanov's debut made Premier League history as he became the first Uzbek to start a match in the competition.",
      "news": [
        {
          "title": "What Man City players and fans did to help Abdukodir Khusanov through nightmare debut",
          "description": "What Man City players and fans did to help Abdukodir Khusanov through nightmare debut  Sporting News",
          "date": "Sun, 26 Jan 2025 12:00:01 GMT"
        },
        {
          "title": "Man City 3-1 Chelsea: Premier League champions recover from Abdukodir Khusanov's nightmare start",
          "description": "Man City 3-1 Chelsea: Premier League champions recover from Abdukodir Khusanov's nightmare start  BBC.com",
          "date": "Sat, 25 Jan 2025 22:18:59 GMT"
        },
        {
          "title": "Manchester City v Chelsea: Abdukodir Khusanov will learn from nightmare debut, says Pep Guardiola",
          "description": "Manchester City v Chelsea: Abdukodir Khusanov will learn from nightmare debut, says Pep Guardiola  The National",
          "date": "Sun, 26 Jan 2025 06:23:47 GMT"
        },
        {
          "title": "Man City's Pep Guardiola made a mistake starting debutant Abdukodir Khusanov against Chelsea, says Jamie Redknapp",
          "description": "Man City's Pep Guardiola made a mistake starting debutant Abdukodir Khusanov against Chelsea, says Jamie Redknapp  Sky Sports",
          "date": "Sat, 25 Jan 2025 23:15:40 GMT"
        },
        {
          "title": "Debut errors ‘best lesson’ for new City recruit Khusanov, insists Guardiola",
          "description": "Debut errors ‘best lesson’ for new City recruit Khusanov, insists Guardiola  The Guardian",
          "date": "Sat, 25 Jan 2025 21:35:00 GMT"
        },
        {
          "title": "Abdukodir Khusanov’s Man City debut from hell salvaged by even greater Chelsea gaffes",
          "description": "Abdukodir Khusanov’s Man City debut from hell salvaged by even greater Chelsea gaffes  The Independent",
          "date": "Sun, 26 Jan 2025 10:10:00 GMT"
        },
        {
          "title": "'He didn’t make one...': Manchester City Boss Pep Guardiola Addresses Debutant Abdukodir Khusanov's Costly Error Against Chelsea That Left the Team Trailing",
          "description": "'He didn’t make one...': Manchester City Boss Pep Guardiola Addresses Debutant Abdukodir Khusanov's Costly Error Against Chelsea That Left the Team Trailing  SportsTak",
          "date": "Sun, 26 Jan 2025 03:09:02 GMT"
        },
        {
          "title": "Abdukodir Khusanov Debuts For Manchester City Amid Early Challenge",
          "description": "Abdukodir Khusanov Debuts For Manchester City Amid Early Challenge  Evrim Ağacı",
          "date": "Sat, 25 Jan 2025 18:53:35 GMT"
        },
        {
          "title": "Abdukodir Khusanov makes Premier League history as he starts for Manchester City with Omar Marmoush in line-up to face Chelsea",
          "description": "Abdukodir Khusanov makes Premier League history as he starts for Manchester City with Omar Marmoush in line-up to face Chelsea  Sportskeeda",
          "date": "Sat, 25 Jan 2025 18:04:00 GMT"
        },
        {
          "title": "'He didn't make one...': Manchester City Boss Pep Guardiola Addresses Debutant Abdukodir Khusanov's Costly Error Against Chelsea That Left the Team Trailing",
          "description": "'He didn't make one...': Manchester City Boss Pep Guardiola Addresses Debutant Abdukodir Khusanov's Costly Error Against Chelsea That Left the Team Trailing  MSN",
          "date": "Sun, 26 Jan 2025 03:23:45 GMT"
        }
      ]
    },
    {
      "player_id": 278,
      "player_name": "Kylian Mbappé Lottin",
      "trending_score": 84.0,
      "trend_summary": "Kylian Mbappé has made history by scoring his first hat-trick for Real Madrid in a 3-0 victory over Real Valladolid in La Liga, equaling Cristiano Ronaldo's feat at the club. The French superstar's goalscoring milestone extends Real Madrid's lead at the top of the table and cements his status as one of the game's elite forwards.",
      "news": [
        {
          "title": "Mbappe scores first LaLiga hat-trick for Real Madrid in win over Valladolid",
          "description": "Mbappe scores first LaLiga hat-trick for Real Madrid in win over Valladolid  Al Jazeera English",
          "date": "Sun, 26 Jan 2025 08:01:35 GMT"
        },
        {
          "title": "Kylian Mbappe betters Cristiano Ronaldo feat at Real Madrid",
          "description": "Kylian Mbappe betters Cristiano Ronaldo feat at Real Madrid  Football Espana",
          "date": "Sun, 26 Jan 2025 09:35:10 GMT"
        },
        {
          "title": "Kylian Mbappé hits Real Madrid goalscoring milestone during Valladolid clash",
          "description": "Kylian Mbappé hits Real Madrid goalscoring milestone during Valladolid clash  Yahoo Canada Sports",
          "date": "Sat, 25 Jan 2025 21:14:00 GMT"
        },
        {
          "title": "\"They are truly special\"",
          "description": "\"They are truly special\"",
          "date": "Sun, 26 Jan 2025 09:29:00 GMT"
        },
        {
          "title": "Kylian Mbappé: The Challenge That Awaits His Return to France!",
          "description": "Kylian Mbappé: The Challenge That Awaits His Return to France!  FootBoom",
          "date": "Sun, 26 Jan 2025 07:48:48 GMT"
        },
        {
          "title": "Real Valladolid 0-3 Real Madrid",
          "description": "Real Valladolid 0-3 Real Madrid",
          "date": "Sun, 26 Jan 2025 00:00:00 GMT"
        },
        {
          "title": "LaLiga: Mbappe scores first hat trick for Real Madrid; Atletico held",
          "description": "LaLiga: Mbappe scores first hat trick for Real Madrid; Atletico held  Business Standard",
          "date": "Sun, 26 Jan 2025 04:50:45 GMT"
        },
        {
          "title": "Kylian Mbappe Treble Extends La Liga Leaders Real Madrid's Edge On Atletico Madrid",
          "description": "Kylian Mbappe Treble Extends La Liga Leaders Real Madrid's Edge On Atletico Madrid  NDTV Sports",
          "date": "Sun, 26 Jan 2025 02:54:32 GMT"
        },
        {
          "title": "La Liga: Kylian Mbappé nets first hat trick for Real Madrid; Sevilla, Atletico secure draws",
          "description": "La Liga: Kylian Mbappé nets first hat trick for Real Madrid; Sevilla, Atletico secure draws  The Times of India",
          "date": "Sun, 26 Jan 2025 03:13:00 GMT"
        },
        {
          "title": "Kylian Mbappe Creates History, Matches Cristiano Ronaldo's Record To Join Elite Club",
          "description": "Kylian Mbappe Creates History, Matches Cristiano Ronaldo's Record To Join Elite Club  Times Now",
          "date": "Sun, 26 Jan 2025 06:34:56 GMT"
        }
      ]
    },
    {
      "player_id": 81573,
      "player_name": "Omar Khaled Mohamed Abd Elsala Marmoush",
      "trending_score": 43.0,
      "trend_summary": "Omar Marmoush made an impressive debut for Manchester City, drawing praise from Erling Haaland for his \"incredible\" movements in their win over Chelsea. The Egyptian forward's performance has sparked transfer rumors linking him with a permanent move to the Premier League champions, with Eintracht Frankfurt's chief acknowledging interest from Manchester City.",
      "news": [
        {
          "title": "Manchester City have a serious player on their hands in Omar Marmoush",
          "description": "Manchester City have a serious player on their hands in Omar Marmoush  Yahoo Sports",
          "date": "Sun, 26 Jan 2025 07:23:00 GMT"
        },
        {
          "title": "Eintracht Frankfurt chief breaks silence on Omar Marmoush future amid Manchester City transfer interest",
          "description": "Eintracht Frankfurt chief breaks silence on Omar Marmoush future amid Manchester City transfer interest  OneFootball",
          "date": "Sun, 26 Jan 2025 04:30:27 GMT"
        },
        {
          "title": "Manchester City's new striker Omar Marmoush pits Guardiola's transfer success vs. Frankfurt's striker flops",
          "description": "Manchester City's new striker Omar Marmoush pits Guardiola's transfer success vs. Frankfurt's striker flops  CBS Sports",
          "date": "Sat, 25 Jan 2025 13:57:47 GMT"
        },
        {
          "title": "Marmoush's memorable debut could spark Man City rebirth",
          "description": "Marmoush's memorable debut could spark Man City rebirth  Premier League",
          "date": "Sat, 25 Jan 2025 21:49:10 GMT"
        },
        {
          "title": "Erling Haaland praises Omar Marmoush on Man City debut",
          "description": "Erling Haaland praises Omar Marmoush on Man City debut  Pan-Africa Football",
          "date": "Sun, 26 Jan 2025 05:09:52 GMT"
        },
        {
          "title": "Marmoush Hails ‘Amazing’ Debut",
          "description": "Marmoush Hails ‘Amazing’ Debut  KingFut",
          "date": "Sun, 26 Jan 2025 04:23:57 GMT"
        },
        {
          "title": "“They should be more clever”",
          "description": "“They should be more clever”",
          "date": "Sun, 26 Jan 2025 00:44:00 GMT"
        },
        {
          "title": "Marmoush reflects on 'amazing' debut",
          "description": "Marmoush reflects on 'amazing' debut  Manchester City FC",
          "date": "Sat, 25 Jan 2025 20:20:00 GMT"
        },
        {
          "title": "Transfer news LIVE! Sesko to Arsenal, Nypan decision, Chelsea bid for Spain star, Liverpool latest",
          "description": "Transfer news LIVE! Sesko to Arsenal, Nypan decision, Chelsea bid for Spain star, Liverpool latest  The Independent",
          "date": "Sun, 26 Jan 2025 11:41:48 GMT"
        },
        {
          "title": "Man City vs. Chelsea lineups, starting 11, confirmed team news, injuries: Debuts for Marmoush, Khusanov",
          "description": "Man City vs. Chelsea lineups, starting 11, confirmed team news, injuries: Debuts for Marmoush, Khusanov  Sporting News",
          "date": "Sat, 25 Jan 2025 16:44:00 GMT"
        }
      ]
    },
    {
      "player_id": 1100,
      "player_name": "Erling Braut Haaland",
      "trending_score": 30.0,
      "trend_summary": "Erling Haaland's impressive performance against Chelsea saw him lead Manchester City to a crucial 3-1 victory, showcasing his exceptional goal-scoring prowess and underlining the club's need for further transfer reinforcements. Off the pitch, Haaland has praised new signing Omar Marmoush, while also offering his thoughts on Chelsea goalkeeper Robert Sanchez's recent error.",
      "news": [
        {
          "title": "Pep Guardiola explains Erling Haaland tactic to underline Man City's transfer market need",
          "description": "Pep Guardiola explains Erling Haaland tactic to underline Man City's transfer market need  Sporting News",
          "date": "Sun, 26 Jan 2025 00:23:27 GMT"
        },
        {
          "title": "Premier League: Erling Haaland Leads Manchester City Revival To Beat Chelsea",
          "description": "Premier League: Erling Haaland Leads Manchester City Revival To Beat Chelsea  NDTV Sports",
          "date": "Sun, 26 Jan 2025 02:47:39 GMT"
        },
        {
          "title": "Premier League reaction recap",
          "description": "Premier League reaction recap",
          "date": "Sat, 25 Jan 2025 22:05:00 GMT"
        },
        {
          "title": "Haaland magic lifts Manchester City to win over Chelsea after Khusanov error",
          "description": "Haaland magic lifts Manchester City to win over Chelsea after Khusanov error  The Guardian",
          "date": "Sat, 25 Jan 2025 21:55:00 GMT"
        },
        {
          "title": "Inside Erling Haaland's life with childhood sweetheart, Marbella pad, £5m car collection",
          "description": "Inside Erling Haaland's life with childhood sweetheart, Marbella pad, £5m car collection  Express",
          "date": "Sun, 26 Jan 2025 07:15:00 GMT"
        },
        {
          "title": "Manchester City vs Chelsea 3-1: English Premier League – as it happened",
          "description": "Manchester City vs Chelsea 3-1: English Premier League – as it happened  Al Jazeera English",
          "date": "Sat, 25 Jan 2025 20:26:15 GMT"
        },
        {
          "title": "Erling Haaland's record-breaking City career so far",
          "description": "Erling Haaland's record-breaking City career so far  OneFootball",
          "date": "Sun, 26 Jan 2025 02:54:34 GMT"
        },
        {
          "title": "Manchester City 3-1 Chelsea: Erling Haaland and Phil Foden power crucial win as Pep Guardiola's side show top-four fight",
          "description": "Manchester City 3-1 Chelsea: Erling Haaland and Phil Foden power crucial win as Pep Guardiola's side show top-four fight  Sky Sports",
          "date": "Sat, 25 Jan 2025 19:39:16 GMT"
        },
        {
          "title": "Erling Haaland and Phil Foden help Manchester City to comeback win over Chelsea",
          "description": "Erling Haaland and Phil Foden help Manchester City to comeback win over Chelsea  The Independent",
          "date": "Sat, 25 Jan 2025 19:38:00 GMT"
        },
        {
          "title": "Erling Haaland makes Robert Sanchez admission after Chelsea goalkeeper’s latest blunder...",
          "description": "Erling Haaland makes Robert Sanchez admission after Chelsea goalkeeper’s latest blunder...  talkSPORT",
          "date": "Sat, 25 Jan 2025 22:11:09 GMT"
        }
      ]
    },
    {
      "player_id": 59,
      "player_name": "Álvaro Borja Morata Martín",
      "trending_score": 24.0,
      "trend_summary": "Unable to generate summary at this time.",
      "news": [
        {
          "title": "Neither Vinícius nor Benzema: Mbappé matches a feat previously achieved by Morata",
          "description": "Neither Vinícius nor Benzema: Mbappé matches a feat previously achieved by Morata  Real Madrid Confidencial",
          "date": "Sun, 26 Jan 2025 09:15:00 GMT"
        },
        {
          "title": "Serie A line-ups: Milan vs. Parma",
          "description": "Serie A line-ups: Milan vs. Parma  Football Italia",
          "date": "Sun, 26 Jan 2025 10:30:00 GMT"
        },
        {
          "title": "Rafael Leao takes Milan pressure off coach Fonseca",
          "description": "Rafael Leao takes Milan pressure off coach Fonseca  OneFootball",
          "date": "Sun, 26 Jan 2025 02:31:15 GMT"
        },
        {
          "title": "Serie A: Milan vs. Parma – Probable line-ups and where to watch",
          "description": "Serie A: Milan vs. Parma – Probable line-ups and where to watch  Football Italia",
          "date": "Sun, 26 Jan 2025 08:51:24 GMT"
        },
        {
          "title": "Zinedine Zidane Considered For Belgium Coach Role",
          "description": "Zinedine Zidane Considered For Belgium Coach Role  Evrim Ağacı",
          "date": "Sat, 25 Jan 2025 18:42:24 GMT"
        },
        {
          "title": "AC Milan vs Parma Prediction, lineups, betting tips & odds",
          "description": "AC Milan vs Parma Prediction, lineups, betting tips & odds  Khel Now",
          "date": "Sat, 25 Jan 2025 22:28:41 GMT"
        },
        {
          "title": "Milan prepare new Gimenez proposal after Feyenoord rejection",
          "description": "Milan prepare new Gimenez proposal after Feyenoord rejection  Football Italia",
          "date": "Sat, 25 Jan 2025 13:55:31 GMT"
        },
        {
          "title": "Top 20 hottest, sexiest & best looking soccer players",
          "description": "Top 20 hottest, sexiest & best looking soccer players  Interesting Football",
          "date": "Sat, 25 Jan 2025 12:35:00 GMT"
        }
      ]
    }
  ]
}