{
  "updated_at": "2025-03-22T12:04:14.934211+00:00",
  "player_news": [
    {
      "player_id": 313245,
      "player_name": "Myles Anthony Lewis-Skelly",
      "trending_score": 100.0,
      "trend_summary": "Arsenal's Myles Lewis-Skelly enjoyed a record-breaking England debut, scoring a goal against Albania and surpassing a 153-year record previously held by Marcus Rashford. His performance has sparked discussion about what England needs under Thomas Tuchel.\n",
      "news": [
        {
          "title": "The Myles Lewis-Skelly moment that showed what England need under Thomas Tuchel",
          "description": "The Myles Lewis-Skelly moment that showed what England need under Thomas Tuchel  The Independent",
          "date": "Sat, 22 Mar 2025 10:02:00 GMT"
        },
        {
          "title": "Myles Lewis-Skelly: Arsenal full-back stars on England debut with goal against Albania",
          "description": "Myles Lewis-Skelly: Arsenal full-back stars on England debut with goal against Albania  BBC.com",
          "date": "Fri, 21 Mar 2025 22:58:27 GMT"
        },
        {
          "title": "Arsenal’s Myles Lewis-Skelly ‘lost for words’ after record-breaking England debut",
          "description": "Arsenal’s Myles Lewis-Skelly ‘lost for words’ after record-breaking England debut  The Athletic",
          "date": "Fri, 21 Mar 2025 22:14:48 GMT"
        },
        {
          "title": "Arsenal's Myles Lewis-Skelly Breaks England Record With Debut Goal vs. Albania",
          "description": "Arsenal's Myles Lewis-Skelly Breaks England Record With Debut Goal vs. Albania  Sports Illustrated",
          "date": "Fri, 21 Mar 2025 20:36:06 GMT"
        },
        {
          "title": "The Verdict: Myles Lewis-Skelly shines on debut as Thomas Tuchel's England leave room for improvement",
          "description": "The Verdict: Myles Lewis-Skelly shines on debut as Thomas Tuchel's England leave room for improvement  Sky Sports",
          "date": "Sat, 22 Mar 2025 00:00:00 GMT"
        },
        {
          "title": "Bukayo Saka sends two-word message to Myles Lewis-Skelly after dream England debut",
          "description": "Bukayo Saka sends two-word message to Myles Lewis-Skelly after dream England debut  Football.London",
          "date": "Sat, 22 Mar 2025 08:20:48 GMT"
        },
        {
          "title": "Myles Lewis-Skelly breaks Marcus Rashford's record as the Arsenal star makes history on his England debut",
          "description": "Myles Lewis-Skelly breaks Marcus Rashford's record as the Arsenal star makes history on his England debut  Daily Mail",
          "date": "Fri, 21 Mar 2025 20:52:22 GMT"
        },
        {
          "title": "Lewis-Skelly sets England record with debut goal",
          "description": "Lewis-Skelly sets England record with debut goal  ESPN.co.uk",
          "date": "Fri, 21 Mar 2025 21:41:00 GMT"
        },
        {
          "title": "Arsenal star Myles Lewis-Skelly makes England history as he breaks 153-year record...",
          "description": "Arsenal star Myles Lewis-Skelly makes England history as he breaks 153-year record...  talkSPORT",
          "date": "Fri, 21 Mar 2025 21:40:00 GMT"
        },
        {
          "title": "Lewis-Skelly with an interesting record",
          "description": "Lewis-Skelly with an interesting record  KOHA.net",
          "date": "Fri, 21 Mar 2025 20:24:29 GMT"
        }
      ]
    },
    {
      "player_id": 18961,
      "player_name": "Daniel Johnson Burn",
      "trending_score": 66.0,
      "trend_summary": "Newcastle hero Dan Burn recently made his England debut against Albania, an appearance described as \"underwhelming\" by some reports. Despite this, Burn admitted he \"thought I had scored\" and is \"getting greedy\" for more opportunities.\n",
      "news": [
        {
          "title": "Dan Burn: Newcastle hero's story shines a light on second chances",
          "description": "Dan Burn: Newcastle hero's story shines a light on second chances  BBC.com",
          "date": "Sat, 22 Mar 2025 08:35:24 GMT"
        },
        {
          "title": "Dan Burn returns to earth with a bump as Newcastle's Wembley hero sees his limits exposed on underwhelming England debut, writes IAN LADYMAN",
          "description": "Dan Burn returns to earth with a bump as Newcastle's Wembley hero sees his limits exposed on underwhelming England debut, writes IAN LADYMAN  MSN",
          "date": "Sat, 22 Mar 2025 08:30:45 GMT"
        },
        {
          "title": "One on One: Dan Burn",
          "description": "One on One: Dan Burn",
          "date": "Sat, 22 Mar 2025 04:48:52 GMT"
        },
        {
          "title": "Dan Burn returns to earth with a bump as Newcastle's Wembley hero sees his limits exposed on underwhelming Eng",
          "description": "Dan Burn returns to earth with a bump as Newcastle's Wembley hero sees his limits exposed on underwhelming Eng  Daily Mail",
          "date": "Sat, 22 Mar 2025 07:00:49 GMT"
        },
        {
          "title": "Lewis-Skelly, Burn handed debuts against Albania",
          "description": "Lewis-Skelly, Burn handed debuts against Albania  ESPN",
          "date": "Fri, 21 Mar 2025 18:46:05 GMT"
        },
        {
          "title": "England v Albania: How Dan Burn can be a pillar of Tuchel's side",
          "description": "England v Albania: How Dan Burn can be a pillar of Tuchel's side  Paddy Power News",
          "date": "Sat, 22 Mar 2025 08:36:45 GMT"
        },
        {
          "title": "Saturday Football Quiz: Burn, Pochettino, Gerrard, Ramos, Mourinho…",
          "description": "Saturday Football Quiz: Burn, Pochettino, Gerrard, Ramos, Mourinho…  Football365",
          "date": "Sat, 22 Mar 2025 11:33:16 GMT"
        },
        {
          "title": "England XI vs Albania: Predicted lineup, confirmed team news, injury latest for Thomas Tuchel's first game",
          "description": "England XI vs Albania: Predicted lineup, confirmed team news, injury latest for Thomas Tuchel's first game  Yahoo Sports",
          "date": "Fri, 21 Mar 2025 16:28:39 GMT"
        },
        {
          "title": "What Alan Shearer said about Newcastle's Dan Burn immediately after his England debut",
          "description": "What Alan Shearer said about Newcastle's Dan Burn immediately after his England debut  Geordie Boot Boys",
          "date": "Sat, 22 Mar 2025 06:00:00 GMT"
        },
        {
          "title": "Dan Burn: I thought I had scored on England debut, I'm getting greedy",
          "description": "Dan Burn: I thought I had scored on England debut, I'm getting greedy  Evening Standard",
          "date": "Sat, 22 Mar 2025 00:05:17 GMT"
        }
      ]
    },
    {
      "player_id": 184,
      "player_name": "Harry Edward Kane",
      "trending_score": 47.0,
      "trend_summary": "Harry Kane scored in England's 2-0 World Cup qualifying win against Albania, a match that marked Thomas Tuchel's debut as England manager, and is being backed for the Ballon d'Or. However, at Bayern Munich, speculation is already swirling about his potential successor, with Jonathan Burkardt being considered.\n",
      "news": [
        {
          "title": "BFW Question of the Day — March 22nd, 2025: Is Jonathan Burkardt a good fit to be Harry Kane’s successor at Bayern Munich?",
          "description": "BFW Question of the Day — March 22nd, 2025: Is Jonathan Burkardt a good fit to be Harry Kane’s successor at Bayern Munich?  Bavarian Football Works",
          "date": "Sat, 22 Mar 2025 10:00:00 GMT"
        },
        {
          "title": "How Thomas Tuchel got England's 2026 World Cup qualifying campaign off to the perfect start in first game",
          "description": "How Thomas Tuchel got England's 2026 World Cup qualifying campaign off to the perfect start in first game  The New York Times",
          "date": "Fri, 21 Mar 2025 23:00:22 GMT"
        },
        {
          "title": "England: Declan Rice and Harry Kane hail Myles Lewis-Skelly's debut",
          "description": "England: Declan Rice and Harry Kane hail Myles Lewis-Skelly's debut  Sky Sports",
          "date": "Sat, 22 Mar 2025 08:06:14 GMT"
        },
        {
          "title": "Harry Kane and Jude Bellingham plan reveals England direction under Thomas Tuchel",
          "description": "Harry Kane and Jude Bellingham plan reveals England direction under Thomas Tuchel  The Independent",
          "date": "Sat, 22 Mar 2025 01:58:00 GMT"
        },
        {
          "title": "England player ratings vs Albania: Thomas Tuchel has lift-off! Debutant Myles Lewis-Skelly delivers win in new manager's first game despite Phil Foden no-show as Harry Kane bags customary Three Lions goal",
          "description": "England player ratings vs Albania: Thomas Tuchel has lift-off! Debutant Myles Lewis-Skelly delivers win in new manager's first game despite Phil Foden no-show as Harry Kane bags customary Three Lions goal  GOAL English",
          "date": "Fri, 21 Mar 2025 22:18:45 GMT"
        },
        {
          "title": "Harry Kane believes fans are ‘bored’ by his goals: ‘If I was 25 it would be different’",
          "description": "Harry Kane believes fans are ‘bored’ by his goals: ‘If I was 25 it would be different’  MSN",
          "date": "Fri, 21 Mar 2025 19:18:10 GMT"
        },
        {
          "title": "England 2-0 Albania LIVE REACTION: Thomas Tuchel wins first Three Lions game as Harry Kane and Myles...",
          "description": "England 2-0 Albania LIVE REACTION: Thomas Tuchel wins first Three Lions game as Harry Kane and Myles...  talkSPORT",
          "date": "Fri, 21 Mar 2025 21:40:15 GMT"
        },
        {
          "title": "England icon Emile Heskey gives Bayern Munich ace Harry Kane Ballon d'Or backing",
          "description": "England icon Emile Heskey gives Bayern Munich ace Harry Kane Ballon d'Or backing  Tribal Football",
          "date": "Fri, 21 Mar 2025 22:16:15 GMT"
        },
        {
          "title": "England vs. Albania final score: World Cup qualifier result, stats as Lewis-Skelly and Kane give Tuchel lift-off",
          "description": "England vs. Albania final score: World Cup qualifier result, stats as Lewis-Skelly and Kane give Tuchel lift-off  Sporting News",
          "date": "Fri, 21 Mar 2025 22:00:00 GMT"
        },
        {
          "title": "Tuchel starts mission WC with win over Albania, demands more from England players",
          "description": "Tuchel starts mission WC with win over Albania, demands more from England players  Mathrubhumi English",
          "date": "Sat, 22 Mar 2025 07:06:51 GMT"
        }
      ]
    },
    {
      "player_id": 26315,
      "player_name": "Nicolás Iván González",
      "trending_score": 36.0,
      "trend_summary": "Nicolás González will return early from international duty with Argentina, and is reportedly not injured. While Argentina edged closer to World Cup qualification with a 1-0 victory over Uruguay, González's role in the match is not specified.\n",
      "news": [
        {
          "title": "Nicolas Gonzalez will return early from international duty and he is not injured",
          "description": "Nicolas Gonzalez will return early from international duty and he is not injured  Juve FC",
          "date": "Sat, 22 Mar 2025 11:01:12 GMT"
        },
        {
          "title": "Uruguay vs Argentina: summary: score, stats, goals and highlights",
          "description": "Uruguay vs Argentina: summary: score, stats, goals and highlights",
          "date": "Sat, 22 Mar 2025 01:26:09 GMT"
        },
        {
          "title": "González: Messi's Replacement? Argentina's Hope Against Uruguay & Brazil",
          "description": "González: Messi's Replacement? Argentina's Hope Against Uruguay & Brazil  Jobaaj Stories",
          "date": "Sat, 22 Mar 2025 08:04:32 GMT"
        },
        {
          "title": "Argentina edge closer to World Cup qualification with victory over Uruguay",
          "description": "Argentina edge closer to World Cup qualification with victory over Uruguay  The Times of India",
          "date": "Sat, 22 Mar 2025 05:52:00 GMT"
        },
        {
          "title": "Thiago Almada stunner goal for Argentina in 1-0 win vs. Uruguay",
          "description": "Thiago Almada stunner goal for Argentina in 1-0 win vs. Uruguay  mundoalbiceleste.com",
          "date": "Sat, 22 Mar 2025 01:34:09 GMT"
        },
        {
          "title": "Uruguay vs Argentina Highlights: URU 0-1 ARG; Thiago Almada stunner takes Argentina on the verge of World Cup Qualification",
          "description": "Uruguay vs Argentina Highlights: URU 0-1 ARG; Thiago Almada stunner takes Argentina on the verge of World Cup Qualification  myKhel",
          "date": "Sat, 22 Mar 2025 01:37:59 GMT"
        },
        {
          "title": "Uruguay 0-1 Argentina: Thiago Almada strike puts World Cup holders on brink of 2026 qualification",
          "description": "Uruguay 0-1 Argentina: Thiago Almada strike puts World Cup holders on brink of 2026 qualification  BBC",
          "date": "Fri, 21 Mar 2025 23:30:00 GMT"
        },
        {
          "title": "Argentina on brink of World Cup after Thiago Almada strike sinks Uruguay",
          "description": "Argentina on brink of World Cup after Thiago Almada strike sinks Uruguay  The Straits Times",
          "date": "Sat, 22 Mar 2025 03:13:49 GMT"
        },
        {
          "title": "Argentina starting XI vs. Uruguay, Giuliano Simeone and Julián Álvarez start",
          "description": "Argentina starting XI vs. Uruguay, Giuliano Simeone and Julián Álvarez start  mundoalbiceleste.com",
          "date": "Sat, 22 Mar 2025 01:47:42 GMT"
        },
        {
          "title": "Uruguay 0-1 Argentina: Thiago Almada's Stunning Strike Advances Team Towards World Cup Qualification",
          "description": "Uruguay 0-1 Argentina: Thiago Almada's Stunning Strike Advances Team Towards World Cup Qualification  myKhel",
          "date": "Sat, 22 Mar 2025 09:46:25 GMT"
        }
      ]
    },
    {
      "player_id": 521,
      "player_name": "Robert Lewandowski",
      "trending_score": 22.0,
      "trend_summary": "Robert Lewandowski secured a late 1-0 victory for Poland against Lithuania in their opening World Cup qualifier. However, Sergio Aguero notably excluded Lewandowski from his list of the three best strikers of all time.\n",
      "news": [
        {
          "title": "Lewandowski nets late winner as Poland start World Cup qualifiers with win over Lithuania",
          "description": "Lewandowski nets late winner as Poland start World Cup qualifiers with win over Lithuania  Flashscore.com",
          "date": "Sat, 22 Mar 2025 09:11:55 GMT"
        },
        {
          "title": "Neither Alexander Isak nor Viktor Gyökeres, There's a Surprise: Robert Lewandowski Didn't Expect It",
          "description": "Neither Alexander Isak nor Viktor Gyökeres, There's a Surprise: Robert Lewandowski Didn't Expect It  E-Notícies",
          "date": "Sat, 22 Mar 2025 11:00:00 GMT"
        },
        {
          "title": "Lamine and Pedri Are Freaking Out About Him in Spain: Top Player for Barça, Signed",
          "description": "Lamine and Pedri Are Freaking Out About Him in Spain: Top Player for Barça, Signed  Carpetas Blaugranas",
          "date": "Fri, 21 Mar 2025 20:00:00 GMT"
        },
        {
          "title": "The 3 best strikers of all time according to Sergio Aguero: No CR7 or Lewandowski…",
          "description": "The 3 best strikers of all time according to Sergio Aguero: No CR7 or Lewandowski…  Football365",
          "date": "Sat, 22 Mar 2025 08:20:11 GMT"
        },
        {
          "title": "Poland Struggles To Victory Over Lithuania In World Cup Qualifiers",
          "description": "Poland Struggles To Victory Over Lithuania In World Cup Qualifiers  Evrim Ağacı",
          "date": "Fri, 21 Mar 2025 23:23:58 GMT"
        },
        {
          "title": "Cristiano Ronaldo absent as Sergio Aguero names the 3 best strikers of all time",
          "description": "Cristiano Ronaldo absent as Sergio Aguero names the 3 best strikers of all time  Planet Football",
          "date": "Sat, 22 Mar 2025 08:06:43 GMT"
        },
        {
          "title": "World Cup 2026 Qualifiers: Lewandowski Lifts Poland Over Lithuania",
          "description": "World Cup 2026 Qualifiers: Lewandowski Lifts Poland Over Lithuania  Terrikon",
          "date": "Fri, 21 Mar 2025 22:21:07 GMT"
        },
        {
          "title": "Poland Prepares For Key World Cup Qualifiers Against Lithuania And Malta",
          "description": "Poland Prepares For Key World Cup Qualifiers Against Lithuania And Malta  Evrim Ağacı",
          "date": "Fri, 21 Mar 2025 21:30:08 GMT"
        },
        {
          "title": "Football: Poland beat Lithuania 1-0 in opening World Cup qualifier",
          "description": "Football: Poland beat Lithuania 1-0 in opening World Cup qualifier  Polskie Radio",
          "date": "Fri, 21 Mar 2025 22:00:00 GMT"
        },
        {
          "title": "Luis Enrique Leaves Barça Wanting More: Goodbye Camp Nou, Signs with PSG",
          "description": "Luis Enrique Leaves Barça Wanting More: Goodbye Camp Nou, Signs with PSG  Madrid-Barcelona.com",
          "date": "Fri, 21 Mar 2025 12:30:00 GMT"
        }
      ]
    }
  ]
}