{
  "updated_at": "2025-03-23T12:23:54.538252+00:00",
  "player_news": [
    {
      "player_id": 1100,
      "player_name": "Erling Braut Haaland",
      "trending_score": 100.0,
      "trend_summary": "Erling Haaland starred as Norway thumped Moldova in a FIFA World Cup 2026 qualifier, contributing to their dominant victory. Off the field, Haaland addressed Manchester City's ongoing legal battle regarding Premier League charges, expressing confidence in the club's innocence.\n",
      "news": [
        {
          "title": "Report: Moldova 0-5 Norway",
          "description": "Report: Moldova 0-5 Norway  sportsmax.tv",
          "date": "Sun, 23 Mar 2025 03:50:28 GMT"
        },
        {
          "title": "FIFA WC 2026 Qualifiers: Haaland Stars As Norway Thump Moldova",
          "description": "FIFA WC 2026 Qualifiers: Haaland Stars As Norway Thump Moldova  Outlook India",
          "date": "Sun, 23 Mar 2025 05:58:45 GMT"
        },
        {
          "title": "Erling Haaland’s latest comments hint at Man City’s fate as club awaits verdict on 130 Premier League charges",
          "description": "Erling Haaland’s latest comments hint at Man City’s fate as club awaits verdict on 130 Premier League charges  MSN",
          "date": "Sun, 23 Mar 2025 02:23:14 GMT"
        },
        {
          "title": "Wales open with win in World Cup qualifying, Erling Haaland on target for Norway",
          "description": "Wales open with win in World Cup qualifying, Erling Haaland on target for Norway  The Straits Times",
          "date": "Sun, 23 Mar 2025 07:56:31 GMT"
        },
        {
          "title": "Norway \"destroys\" Moldova, Haaland scores",
          "description": "Norway \"destroys\" Moldova, Haaland scores  KOHA.net",
          "date": "Sat, 22 Mar 2025 18:56:38 GMT"
        },
        {
          "title": "Erling Haaland drops shocking revelation on Manchester City's crushed Premier League title dreams",
          "description": "Erling Haaland drops shocking revelation on Manchester City's crushed Premier League title dreams  SportsTak",
          "date": "Sat, 22 Mar 2025 15:19:25 GMT"
        },
        {
          "title": "Erling Haaland makes feelings clear amid Manchester City's 115 charges legal battle",
          "description": "Erling Haaland makes feelings clear amid Manchester City's 115 charges legal battle",
          "date": "Sat, 22 Mar 2025 14:30:37 GMT"
        },
        {
          "title": "Erling Haaland gives bullish verdict on Man City FFP case as Pep eyes a Real Madrid star",
          "description": "Erling Haaland gives bullish verdict on Man City FFP case as Pep eyes a Real Madrid star  Football365",
          "date": "Sat, 22 Mar 2025 14:58:23 GMT"
        },
        {
          "title": "Haaland scores again, Norway outclasses Moldova",
          "description": "Haaland scores again, Norway outclasses Moldova  Vijesti.me",
          "date": "Sat, 22 Mar 2025 19:36:58 GMT"
        },
        {
          "title": "“I’ve answered that 300 times” – Erling Haaland confident of Manchester City’s innocence as 115 charges verdict nears",
          "description": "“I’ve answered that 300 times” – Erling Haaland confident of Manchester City’s innocence as 115 charges verdict nears  OneFootball",
          "date": "Sat, 22 Mar 2025 13:13:44 GMT"
        }
      ]
    },
    {
      "player_id": 702,
      "player_name": "Oliver Baumann",
      "trending_score": 94.0,
      "trend_summary": "Despite accepting every role throughout his career, Oliver Baumann is now publicly vying for a chance to compete for Germany's No. 1 goalkeeper position. This comes as Germany experiences a \"surge\" heading into their Nations League showdown against Italy.\n",
      "news": [
        {
          "title": "Oliver Baumann just wants a chance to compete for No. 1 gig with Germany",
          "description": "Oliver Baumann just wants a chance to compete for No. 1 gig with Germany  Bavarian Football Works",
          "date": "Sun, 23 Mar 2025 01:00:00 GMT"
        },
        {
          "title": "Oliver Baumann: \"I've always accepted every role”",
          "description": "Oliver Baumann: \"I've always accepted every role”  OneFootball",
          "date": "Sat, 22 Mar 2025 16:34:32 GMT"
        },
        {
          "title": "Germany riding 'surge' ahead of Italy showdown in Nations League",
          "description": "Germany riding 'surge' ahead of Italy showdown in Nations League  eNCA",
          "date": "Sat, 22 Mar 2025 20:40:00 GMT"
        }
      ]
    },
    {
      "player_id": 386828,
      "player_name": "Lamine Yamal Nasraoui Ebana",
      "trending_score": 69.0,
      "trend_summary": "Barcelona prodigy Lamine Yamal won the Kopa Trophy at the Ballon d'Or ceremony, while his burgeoning talent has sparked comparisons to Lionel Messi, which teammate Frenkie De Jong has dismissed. Meanwhile, Netherlands coach Ronald Koeman is devising a plan to contain Yamal in an upcoming match.\n",
      "news": [
        {
          "title": "Ronald Koeman reveals Dutch plan to stop Lamine Yamal",
          "description": "Ronald Koeman reveals Dutch plan to stop Lamine Yamal  Football Espana",
          "date": "Sat, 22 Mar 2025 23:53:37 GMT"
        },
        {
          "title": "Lamine Yamal: Barcelona Prodigy Wins Kopa Trophy at Ballon d’Or Ceremony",
          "description": "Lamine Yamal: Barcelona Prodigy Wins Kopa Trophy at Ballon d’Or Ceremony  MSN",
          "date": "Sun, 23 Mar 2025 05:50:04 GMT"
        },
        {
          "title": "FCBN Cover 03/23/2025: FRIENDSHIP, SOCCER, AND A SHARED DREAM",
          "description": "FCBN Cover 03/23/2025: FRIENDSHIP, SOCCER, AND A SHARED DREAM  FC Barcelona Noticias",
          "date": "Sun, 23 Mar 2025 09:39:05 GMT"
        },
        {
          "title": "Lionel Messi vs Lamine Yamal? Frenkie De Jong Shuts Down Comparisons",
          "description": "Lionel Messi vs Lamine Yamal? Frenkie De Jong Shuts Down Comparisons",
          "date": "Sat, 22 Mar 2025 20:26:50 GMT"
        },
        {
          "title": "What Lamine Yamal has now said about Liverpool will be bittersweet for Reds supporters",
          "description": "What Lamine Yamal has now said about Liverpool will be bittersweet for Reds supporters  OneFootball",
          "date": "Sat, 22 Mar 2025 22:02:10 GMT"
        },
        {
          "title": "Barcelona ace Frenkie de Jong shuts down Lamine Yamal and Lionel Messi comparison",
          "description": "Barcelona ace Frenkie de Jong shuts down Lamine Yamal and Lionel Messi comparison  Tribal Football",
          "date": "Sat, 22 Mar 2025 14:51:33 GMT"
        },
        {
          "title": "Frenkie De Jong Dismisses Comparisons Between Lamine Yamal And Lionel Messi",
          "description": "Frenkie De Jong Dismisses Comparisons Between Lamine Yamal And Lionel Messi  myKhel",
          "date": "Sat, 22 Mar 2025 16:18:40 GMT"
        },
        {
          "title": "The 'hidden gem' of FC Barcelona for the left winger could be in Serie A",
          "description": "The 'hidden gem' of FC Barcelona for the left winger could be in Serie A  FC Barcelona Noticias",
          "date": "Sat, 22 Mar 2025 21:15:21 GMT"
        },
        {
          "title": "Barça breathes! The RFEF releases three key players for the match against Osasuna",
          "description": "Barça breathes! The RFEF releases three key players for the match against Osasuna  FC Barcelona Noticias",
          "date": "Sat, 22 Mar 2025 15:02:00 GMT"
        },
        {
          "title": "Football Tips: Sunday night’s 33/1 sharp shooting Nations League Bet Builder",
          "description": "Football Tips: Sunday night’s 33/1 sharp shooting Nations League Bet Builder  Paddy Power News",
          "date": "Sat, 22 Mar 2025 14:39:19 GMT"
        }
      ]
    },
    {
      "player_id": 754,
      "player_name": "Luka Modrić",
      "trending_score": 56.0,
      "trend_summary": "Luka Modrić, a Real Madrid legend, has expressed his dream to retire at the club and is seeking a short-term, potentially one-year, contract extension as he prepares for negotiations. While providing a hint towards retirement plans, Modrić insists he's in no hurry to hang up his boots.\n",
      "news": [
        {
          "title": "Luka Modric sets out Real Madrid ‘dream’ ahead of contract decision",
          "description": "Luka Modric sets out Real Madrid ‘dream’ ahead of contract decision  Football Espana",
          "date": "Sat, 22 Mar 2025 20:52:03 GMT"
        },
        {
          "title": "Aurélien Tchouaméni : « Luka Modric est une légende du Real Madrid et du football »",
          "description": "Aurélien Tchouaméni : « Luka Modric est une légende du Real Madrid et du football »  OneFootball",
          "date": "Sat, 22 Mar 2025 19:09:08 GMT"
        },
        {
          "title": "Real Madrid aims to retain Luka Modric as veteran midfielder seeks short-term deal",
          "description": "Real Madrid aims to retain Luka Modric as veteran midfielder seeks short-term deal",
          "date": "Sun, 23 Mar 2025 09:05:00 GMT"
        },
        {
          "title": "Luka Modric provides retirement hint as Real Madrid legend reveals his plans over a new contract at the Spanis",
          "description": "Luka Modric provides retirement hint as Real Madrid legend reveals his plans over a new contract at the Spanis  Daily Mail",
          "date": "Sat, 22 Mar 2025 16:12:17 GMT"
        },
        {
          "title": "Modric: My dream is to retire at Real Madrid",
          "description": "Modric: My dream is to retire at Real Madrid  KOHA.net",
          "date": "Sat, 22 Mar 2025 20:45:00 GMT"
        },
        {
          "title": "Modrić: I'm in no hurry to retire",
          "description": "Modrić: I'm in no hurry to retire  Vijesti.me",
          "date": "Sat, 22 Mar 2025 20:26:33 GMT"
        },
        {
          "title": "'That would be a dream'",
          "description": "'That would be a dream'",
          "date": "Sat, 22 Mar 2025 22:54:01 GMT"
        },
        {
          "title": "Real Madrid Legend Makes Huge Statement On His Future At The Club",
          "description": "Real Madrid Legend Makes Huge Statement On His Future At The Club  Sports Illustrated",
          "date": "Sat, 22 Mar 2025 17:32:32 GMT"
        },
        {
          "title": "Luka Modric provides retirement hint as Real Madrid legend reveals his plans over a new contract at the Spanish giants",
          "description": "Luka Modric provides retirement hint as Real Madrid legend reveals his plans over a new contract at the Spanish giants  MSN",
          "date": "Sun, 23 Mar 2025 00:06:12 GMT"
        },
        {
          "title": "Modrić plans to retire at Real Madrid, seeks one-year contract extension",
          "description": "Modrić plans to retire at Real Madrid, seeks one-year contract extension",
          "date": "Sun, 23 Mar 2025 01:00:00 GMT"
        }
      ]
    },
    {
      "player_id": 328074,
      "player_name": "Jordan Anthony James",
      "trending_score": 52.0,
      "trend_summary": "Recent headlines are dominated by Wales' World Cup qualifying victory over Kazakhstan, with a score of 3-1, marking a successful start to their campaign under Craig Bellamy. However, none of these articles mention Jordan James.\n",
      "news": [
        {
          "title": "Oregon Ducks Transfer Makhi Hughes Leading 'Really Competitive' Running Back Room",
          "description": "Oregon Ducks Transfer Makhi Hughes Leading 'Really Competitive' Running Back Room  Sports Illustrated",
          "date": "Sat, 22 Mar 2025 19:39:09 GMT"
        },
        {
          "title": "The Replacements: The 5 biggest losses to graduation in Oregon football and the plan to account for them",
          "description": "The Replacements: The 5 biggest losses to graduation in Oregon football and the plan to account for them  Autzen Zoo",
          "date": "Sat, 22 Mar 2025 19:21:03 GMT"
        },
        {
          "title": "Former Tulane Football Star Named Top 'Breakout' Candidate for Oregon Ducks",
          "description": "Former Tulane Football Star Named Top 'Breakout' Candidate for Oregon Ducks  Sports Illustrated",
          "date": "Sun, 23 Mar 2025 00:00:00 GMT"
        },
        {
          "title": "Wales sink Kazakhstan to get World Cup campaign up and running",
          "description": "Wales sink Kazakhstan to get World Cup campaign up and running  The Guardian",
          "date": "Sat, 22 Mar 2025 21:55:00 GMT"
        },
        {
          "title": "Wales 3-1 Kazakhstan: Craig Bellamy begins World Cup bid with well-earned victory",
          "description": "Wales 3-1 Kazakhstan: Craig Bellamy begins World Cup bid with well-earned victory  Wales Online",
          "date": "Sat, 22 Mar 2025 21:51:00 GMT"
        },
        {
          "title": "Wales 3-1 Kazakhstan: Craig Bellamy's side start 2026 World Cup qualifying campaign with win",
          "description": "Wales 3-1 Kazakhstan: Craig Bellamy's side start 2026 World Cup qualifying campaign with win  Sky Sports",
          "date": "Sat, 22 Mar 2025 22:21:47 GMT"
        },
        {
          "title": "Wales win again as the World Cup kicks off in exciting style",
          "description": "Wales win again as the World Cup kicks off in exciting style  FansNetwork",
          "date": "Sat, 22 Mar 2025 22:43:00 GMT"
        },
        {
          "title": "Wales 3-1 Kazakhstan: World Cup qualifier – as it happened",
          "description": "Wales 3-1 Kazakhstan: World Cup qualifier – as it happened  The Guardian",
          "date": "Sat, 22 Mar 2025 18:30:00 GMT"
        },
        {
          "title": "Wales 3-1 Kazakhstan: Bellamy stays unbeaten as World Cup qualifying commences",
          "description": "Wales 3-1 Kazakhstan: Bellamy stays unbeaten as World Cup qualifying commences  VAVEL",
          "date": "Sat, 22 Mar 2025 22:23:59 GMT"
        },
        {
          "title": "Wales cruise to win against Kazakhstan on comfortable qualifying night in Cardiff",
          "description": "Wales cruise to win against Kazakhstan on comfortable qualifying night in Cardiff  Flashscore.com",
          "date": "Sun, 23 Mar 2025 07:57:10 GMT"
        }
      ]
    }
  ]
}